Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/betterstring/mcp/locale/*.po
Languages: dutch, german, italian, russian, spanish

# MSG_Label_Active (0//)
source: Active:
dutch: Actief:
german: Aktiv:
italian: Attivo:
russian: Активно:
spanish: Activo

# MSG_Label_Background (1//)
source: Background
dutch: Achtergrond
german: Hintergrund
italian: Sfondo
russian: Фон
spanish: Fondo

# MSG_Label_Cursor (2//)
source: Cursor:
italian: Cursore:
russian: Курсор:

# MSG_Label_Inactive (5//)
source: Inactive:
dutch: Inactief:
german: Inaktiv:
italian: Inattivo:
russian: Неактивно:
spanish: Inactivo

# MSG_Label_Marked (6//)
source: Marked:
dutch: Gemarkeerd:
german: Markiert:
italian: Marcato:
russian: Выделено:
spanish: Marcado

# MSG_Label_Text (7//)
source: Text
dutch: Tekst
italian: Testo
russian: Текст
spanish: Texto

# MSG_String_TestString (8//)
source: Test the power of BetterString here!
dutch: Test hier de kracht van BetterString
german: Teste BetterString hier!
italian: Testa la potenza della BetterString qui!
russian: Здесь можно тестировать настройки BetterString!
spanish: ¡Pruebe la potencia de BetterString aquí!

# MSG_Help_Copy (9//)
source: Copy all or marked text
dutch: Kopieer alle of gemarkeerde tekst
german: Kopiert den kompletten oder markierten Text
italian: Copia tutto o marca testo
russian: Копировать весь или выделенный текст
spanish: Copiar todo o texto marcado

# MSG_Help_Cut (11//)
source: Cut all or marked text
dutch: Knip alle of gemarkeerde tekst
german: Schneidet den kompletten oder markierten Text aus
italian: Taglia tutto o marca testo
russian: Вырезать весь или выделенный текст
spanish: Cortar todo o texto marcado

# MSG_Help_Paste (13//)
source: Paste
dutch: Plak
german: Einfügen
italian: Incolla
russian: Вставить
spanish: Pegar

# MSG_Help_Undo (15//)
source: Undo last deletion
dutch: Herstel laatste keer wissen
german: Letzte Änderung rückgängig machen
italian: Annulla l'ultima cancellazione
russian: Отменить последнее удаление
spanish: Deshacer último borrado

# MSG_Help_Redo (17//)
source: Redo last deletion
dutch: Opnieuw laatste keer wissen
german: Letzte Änderung wiederherstellen
italian: Ripristina l'ultima cancellazione
russian: Вернуть последнее удаление
spanish: Rehacer último borrado

# MSG_Help_ToggleBuffer (19//)
source: Toggle between original and modified buffer
dutch: Wissel tussen originele en gewijzigde buffer
german: Zwischen normalem und geänderten Puffer umschalten
italian: Alterna tra buffer originale e modificato
russian: Переключить оригинальный и изменённый буфер
spanish: Intercambiar original<->modificado

# MSG_Help_ToggleCaseChar (21//)
source: Toggle case on character
dutch: Wissel tussen onder- en bovenkast van letter
german: Groß-/Kleinschreibung für Zeichen umschalten
italian: Alterna maiuscole/minuscole sul carattere
russian: Изменить регистр символа
spanish: Caracter MAYÚSCULA<->minúscula

# MSG_Help_ToggleCaseWord (23//)
source: Toggle case on word
dutch: Wissel tussen onder- en bovenkast van woord
german: Groß-/Kleinschreibung für Wort umschalten
italian: Alterna maiuscole/minuscole sulla parola
russian: Изменить регистр слова
spanish: Palabra MAYÚSCULAS<->minúsculas

# MSG_Help_IncreaseNumber (25//)
source: Increase number
dutch: Hoger getal
german: Zahl vergrößern
italian: Incrementa numero
russian: Увеличить число
spanish: Incrementar número

# MSG_Help_DecreaseNumber (27//)
source: Decrease number
dutch: Lager getal
german: Zahl verkleinern
italian: Decrementa numero
russian: Уменьшить число
spanish: Decrementar número

# MSG_Help_HexToDecimal (29//)
source: Hex to Decimal
dutch: Hex naar decimaal
german: Hex zu Dezimal
italian: Hex su Decimale
russian: Шестнадцатиричное в десятичное
spanish: Hexadecimal a Decimal

# MSG_Help_DecimalToHex (31//)
source: Decimal to Hex
dutch: Decimaal naar hex
german: Dezimal zu Hex
italian: Decimale su Hex
russian: Десятичное в шестнадцатиричное
spanish: Decimal a Hexadecimal

# MSG_Help_FilenameCompletition (33//)
source: Filenamecompletion (use SHIFT to cycle back)
dutch: Bestandsnaam aanvullen (gebruik SHIFT om achteruit te gaan)
german: Dateinamenvervollständigung (SHIFT für umgekehrte Richtung)
italian: Auto-completamento del nome file (SHIFT per tornare indietro)
russian: Дополнение имени файла (SHIFT для перебора назад)
spanish: Completar nombre [+Shift hacia atrás]

# MSG_Help_Mark (35//)
source: Mark
dutch: Markeer
german: Markieren
italian: Marca
russian: Выделить
spanish: Marcar

# MSG_Help_Mark_Shortcut (36//)
source: CTRL + cursor
german: CTRL + Cursortasten
italian: CTRL + cursore
russian: CTRL + курсор

# MSG_Help_GotoToStartEndOfLine (37//)
source: Goto to start/end of line
dutch: Ga naar begin/eind van regel
german: Sprung zu Anfang/Ende der Zeile
italian: Vai all'inizio/fine della linea
russian: Перейти к началу/концу строки
spanish: Ir al inicio/fin de línea

# MSG_Help_GotoToStartEndOfLine_Shortcut (38//)
source: SHIFT + cursor
german: SHIFT + Cursortasten
italian: SHIFT + cursore
russian: SHIFT + курсор

# MSG_Help_DeleteToStartEndOfLine (39//)
source: Delete to start/end of line
dutch: Wissen tot aan begin/eind van regel
german: Bis zum Anfang/Ende der Zeile löschen
italian: Cancella l'inizio/fine della linea
russian: Удалить до начала/конца строки
spanish: Borrar hasta inicio/fin de línea

# MSG_Help_DeleteToStartEndOfLine_Shortcut (40//)
source: SHIFT + BACKSPACE/DELETE
italian: SHIFT + SPAZIO/CANC
russian: SHIFT + ЗАБОЙ/УДАЛИТЬ
spanish: Shift + borrar/Supr

# MSG_Help_GotoToPrevNextWord (41//)
source: Goto to previous/next word
dutch: Ga naar vorig/volgend woord
german: Sprung zum vorherigen/nächsten Wort
italian: Vai alla parola precedente/successiva
russian: Перейти к предыдущему/следующему слову
spanish: Ir a palabra anterior/siguiente

# MSG_Help_GotoToPrevNextWord_Shortcut (42//)
source: ALT + cursor
german: ALT + Cursortasten
italian: ALT + cursore
russian: ALT + курсор

# MSG_Help_DeleteToPrevNextWord (43//)
source: Delete previous/next word
dutch: Wis vorig/volgend woord
german: Lösche vorheriges/nächstes Wort
italian: Cancella la parola precedente/successiva
russian: Удалить предыдущее/следующее слово
spanish: Borrar palabra anterior/siguiente

# MSG_Help_DeleteToPrevNextWord_Shortcut (44//)
source: ALT + BACKSPACE/DELETE
italian: ALT + SPAZIO/CANC
russian: ALT + ЗАБОЙ/УДАЛИТЬ
spanish: Alt + borrar/Supr

# MSG_SelectOnActive (45//)
source: Select on Active
dutch: Selecteer op Actief
german: Auswahl bei Aktivierung
italian: Seleziona su attivo
russian: Выделить в активном
spanish: Seleccionar todo al activar

# MSG_HELP_SelectOnActive (46//)
source: Automatically select all text when a BetterString object gets activated via TAB cycling or mouse activation.
dutch: Selecteer alle tekst automatisch wanneer een BetterString-object geactiveerd wordt via TAB-cyclus of muis-activiteit.
german: Wenn ausgewählt wird der Inhalt eines BetterString Objektes automatisch selektiert wenn es per TAB oder Mauszeiger aktiviert wird.
italian: Seleziona tutto il testo automaticamente quando un oggetto BetterString è attivato tramite il tasto TAB o con il mouse.
russian: Автоматически выделяет весь текст, когда объект BetterString активируется клавишей TAB или мышью.
spanish: Seleccionar automáticamente todo el texto al activar una zona \033iBetterString \033n con el tabuldaor o el ratón.

# MSG_SelectPointer (47//)
source: Selection Pointer
dutch: Selectie punt:
german: Auswahl-Mauszeiger
italian: Selezione puntatore
russian: Указатель выделения
spanish: Cambiar puntero

# MSG_HELP_SelectPointer (48//)
source: If enabled, a custom selection pointer will appear when the mouse pointer is above a betterstring gadget.
dutch: Als dit ingeschakeld is komt er een custom selectiepunt wanneer de muis boven een BetterString-gadget komt.
german: Wenn ausgewählt wird ein spezieller Mauszeiger dargestellt der das selektieren von Zeichen vereinfachen soll.
italian: Se attivato, una selezione predefinita del puntatore apparirà come risultato del passaggio del puntatore stesso al di sopra di un gadget BetterString.
russian: Если включено, указатель мыши, находящийся над активным элементом, изменяет форму для удобства выделения.
spanish: Cambiar el puntero al posicionarse en una zona \033iBetterString.\033n

# MSG_Help_FilenameCompletition_Shortcut (34//)
source: Amiga + TAB
spanish: Amiga + tabulador

# MSG_Help_ToggleBuffer_Shortcut (20//)
source: Amiga + q
dutch: Amiga + u
