Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/betterstring/mcp/locale/danish.po
Languages: da

# MSG_Label_Active (0//)
source: Active:
da: Aktiv:

# MSG_Label_Background (1//)
source: Background
da: Baggrund

# MSG_Label_Cursor (2//)
source: Cursor:
da: Markør:

# MSG_Label_Inactive (5//)
source: Inactive:
da: Inaktiv:

# MSG_Label_Marked (6//)
source: Marked:
da: Markeret:

# MSG_Label_Text (7//)
source: Text
da: Tekst

# MSG_String_TestString (8//)
source: Test the power of BetterString here!
da: Her kan du prøve BetterStrings mange muligheder.

# MSG_Help_Copy (9//)
source: Copy all or marked text
da: Kopierer al eller markeret tekst

# MSG_Help_Cut (11//)
source: Cut all or marked text
da: Klipper al eller markeret tekst

# MSG_Help_Paste (13//)
source: Paste
da: Indsætter

# MSG_Help_Undo (15//)
source: Undo last deletion
da: Tilbagefører seneste sletning

# MSG_Help_Redo (17//)
source: Redo last deletion
da: Genudfører seneste sletning

# MSG_Help_ToggleBuffer (19//)
source: Toggle between original and modified buffer
da: Skifter mellem oprindelig og ændret buffer

# MSG_Help_ToggleCaseChar (21//)
source: Toggle case on character
da: Skifter bogstavet mellem store og små

# MSG_Help_ToggleCaseWord (23//)
source: Toggle case on word
da: Skifter ordet mellem store og små bogstaver

# MSG_Help_IncreaseNumber (25//)
source: Increase number
da: Øger tallet

# MSG_Help_DecreaseNumber (27//)
source: Decrease number
da: Mindsker tallet

# MSG_Help_HexToDecimal (29//)
source: Hex to Decimal
da: Hex til decimal

# MSG_Help_DecimalToHex (31//)
source: Decimal to Hex
da: Decimal til hex

# MSG_Help_FilenameCompletition (33//)
source: Filenamecompletion (use SHIFT to cycle back)
da: Filnavnsfuldførelse (brug SKIFT for at bladre baglæns)

# MSG_Help_Mark (35//)
source: Mark
da: Markerer

# MSG_Help_Mark_Shortcut (36//)
source: CTRL + cursor
da: CTRL + pile

# MSG_Help_GotoToStartEndOfLine (37//)
source: Goto to start/end of line
da: Hopper til start/slut af linje

# MSG_Help_GotoToStartEndOfLine_Shortcut (38//)
source: SHIFT + cursor
da: SKIFT + pile

# MSG_Help_DeleteToStartEndOfLine (39//)
source: Delete to start/end of line
da: Sletter til start/slut af linje

# MSG_Help_DeleteToStartEndOfLine_Shortcut (40//)
source: SHIFT + BACKSPACE/DELETE
da: SKIFT + slet baglæns/slet

# MSG_Help_GotoToPrevNextWord (41//)
source: Goto to previous/next word
da: Hopper til forrige/næste ord

# MSG_Help_GotoToPrevNextWord_Shortcut (42//)
source: ALT + cursor
da: ALT + pile

# MSG_Help_DeleteToPrevNextWord (43//)
source: Delete previous/next word
da: Sletter forrige/næste ord

# MSG_Help_DeleteToPrevNextWord_Shortcut (44//)
source: ALT + BACKSPACE/DELETE
da: ALT + slet baglæns/slet

# MSG_SelectOnActive (45//)
source: Select on Active
da: Markér ved aktivering

# MSG_HELP_SelectOnActive (46//)
source: Automatically select all text when a BetterString object gets activated via TAB cycling or mouse activation.
da: Markerer automatisk al tekst når et BetterString-objekt bliver aktiveret ved brug af TAB-tasten eller musen.

# MSG_SelectPointer (47//)
source: Selection Pointer
da: Markerings-musepil

# MSG_HELP_SelectPointer (48//)
source: If enabled, a custom selection pointer will appear when the mouse pointer is above a betterstring gadget.
da: Ved hak her vil en særlig musepil til markering blive vist når musepilen er over et BetterString-objekt.
