Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/betterstring/mcp/locale/greek.po
Languages: el

# MSG_Label_Active (0//)
source: Active:
el: Ενεργό:

# MSG_Label_Background (1//)
source: Background
el: Φόντο

# MSG_Label_Cursor (2//)
source: Cursor:
el: Κέρσορας:

# MSG_Label_Inactive (5//)
source: Inactive:
el: Ανενεργό:

# MSG_Label_Marked (6//)
source: Marked:
el: Μαρκαρισμένο:

# MSG_Label_Text (7//)
source: Text
el: Κείμενο

# MSG_String_TestString (8//)
source: Test the power of BetterString here!
el: Δοκιμάστε εδώ τις δυνατότητες του BetterString!

# MSG_Help_Copy (9//)
source: Copy all or marked text
el: Αντιγράψτε όλο ή το μαρκαρισμένο κείμενο

# MSG_Help_Cut (11//)
source: Cut all or marked text
el: Αποκοπή όλου ή του μαρκαρισμένου κειμένου

# MSG_Help_Paste (13//)
source: Paste
el: Επικόλληση

# MSG_Help_Undo (15//)
source: Undo last deletion
el: Αναίρεση τελευταίας διαγραφής

# MSG_Help_Redo (17//)
source: Redo last deletion
el: Επανάληψη τελευταίας διαγραφής

# MSG_Help_ToggleBuffer (19//)
source: Toggle between original and modified buffer
el: Εναλλαγή μεταξύ αρχικής και τροποποιημένης προσωρινής μνήμης

# MSG_Help_ToggleCaseChar (21//)
source: Toggle case on character
el: Εναλλαγή πεζών/κεφαλαίων στο χαρακτήρα

# MSG_Help_ToggleCaseWord (23//)
source: Toggle case on word
el: Εναλλαγή πεζών/κεφαλαίων στη λέξη

# MSG_Help_IncreaseNumber (25//)
source: Increase number
el: Αυξήστε τον αριθμό

# MSG_Help_DecreaseNumber (27//)
source: Decrease number
el: Μειώστε τον αριθμό

# MSG_Help_HexToDecimal (29//)
source: Hex to Decimal
el: Δεκαεξαδικό σε δεκαδικό σύστημα

# MSG_Help_DecimalToHex (31//)
source: Decimal to Hex
el: Δεκαδικό σε δεκαεξαδικό σύστημα

# MSG_Help_FilenameCompletition (33//)
source: Filenamecompletion (use SHIFT to cycle back)
el: Συμπλήρωση ονόματος αρχείου (χρησιμοποιήστε το SHIFT για να πάτε πίσω)

# MSG_Help_Mark (35//)
source: Mark
el: Μαρκάρισμα

# MSG_Help_Mark_Shortcut (36//)
source: CTRL + cursor
el: CTRL + κέρσορας

# MSG_Help_GotoToStartEndOfLine (37//)
source: Goto to start/end of line
el: Πηγαίνετε στην αρχή/τέλος της γραμμής

# MSG_Help_GotoToStartEndOfLine_Shortcut (38//)
source: SHIFT + cursor
el: SHIFT + κέρσορας

# MSG_Help_DeleteToStartEndOfLine (39//)
source: Delete to start/end of line
el: Διαγράψτε από την αρχή/τέλος της γραμμής

# MSG_Help_GotoToPrevNextWord (41//)
source: Goto to previous/next word
el: Πηγαίνετε στη προηγούμενη/επόμενη λέξη

# MSG_Help_GotoToPrevNextWord_Shortcut (42//)
source: ALT + cursor
el: ALT + κέρσορας

# MSG_Help_DeleteToPrevNextWord (43//)
source: Delete previous/next word
el: Διαγράψτε τη προηγούμενη/επόμενη λέξη

# MSG_SelectOnActive (45//)
source: Select on Active
el: Επιλογή όταν είναι ενεργό

# MSG_HELP_SelectOnActive (46//)
source: Automatically select all text when a BetterString object gets activated via TAB cycling or mouse activation.
el: Επιλογή όλου του κειμένου αυτόματα όταν ένα αντικείμενο BetterString ενεργοποιείται μέσω της κύλισης TAB ή την ενεργοποίηση του ποντικιού.

# MSG_SelectPointer (47//)
source: Selection Pointer
el: Επιλογή δείκτη

# MSG_HELP_SelectPointer (48//)
source: If enabled, a custom selection pointer will appear when the mouse pointer is above a betterstring gadget.
el: Αν ενεργοποιηθεί, θα εμφανιστεί μια τροποποιημένη επιλογή δείκτη όταν ο δείκτης του ποντικιού είναι πάνω από ένα αντικείμενο BetterString.
