Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/betterstring/mcp/locale/polish.po
Languages: pl

# MSG_Label_Active (0//)
source: Active:
pl: Aktywny:

# MSG_Label_Background (1//)
source: Background
pl: Tło

# MSG_Label_Cursor (2//)
source: Cursor:
pl: Kursor:

# MSG_Label_Inactive (5//)
source: Inactive:
pl: Niekatywny:

# MSG_Label_Marked (6//)
source: Marked:
pl: Zaznaczony:

# MSG_Label_Text (7//)
source: Text
pl: Tekst

# MSG_String_TestString (8//)
source: Test the power of BetterString here!
pl: Tutaj przetestuj zalety klasy BetterString!

# MSG_Help_Copy (9//)
source: Copy all or marked text
pl: Kopiuje cały lub zaznaczony fragment tekstu

# MSG_Help_Cut (11//)
source: Cut all or marked text
pl: Wycina cały lub zaznaczony fragment tekstu

# MSG_Help_Paste (13//)
source: Paste
pl: Wkleja

# MSG_Help_Undo (15//)
source: Undo last deletion
pl: Cofa ostatni± operacjê

# MSG_Help_Redo (17//)
source: Redo last deletion
pl: Przywraca ostatnio cofniêt± operacjê

# MSG_Help_ToggleBuffer (19//)
source: Toggle between original and modified buffer
pl: Przeł±cza pomiêdzy oryginalnym, a zmodyfikowanym buforem

# MSG_Help_ToggleCaseChar (21//)
source: Toggle case on character
pl: Zmienia wielko¶æ znaków

# MSG_Help_ToggleCaseWord (23//)
source: Toggle case on word
pl: Zmienia wielko¶æ znaków w słowie

# MSG_Help_IncreaseNumber (25//)
source: Increase number
pl: Zwiêksza warto¶æ

# MSG_Help_DecreaseNumber (27//)
source: Decrease number
pl: Zmniejsza warto¶æ

# MSG_Help_HexToDecimal (29//)
source: Hex to Decimal
pl: Zamienia warto¶æ szesnastkow± na dziesiêtn±

# MSG_Help_DecimalToHex (31//)
source: Decimal to Hex
pl: Zamienia warto¶æ dziesiêtn± na szesnastkow±

# MSG_Help_FilenameCompletition (33//)
source: Filenamecompletion (use SHIFT to cycle back)
pl: Uzupełnia nazwê (z klawiszem SHIFT powrót do poprzedniego uzupełnienia)

# MSG_Help_Mark (35//)
source: Mark
pl: Zaznaczanie

# MSG_Help_Mark_Shortcut (36//)
source: CTRL + cursor
pl: CTRL + strzałki kursora

# MSG_Help_GotoToStartEndOfLine (37//)
source: Goto to start/end of line
pl: Przej¶cie na pocz±tek/koniec linii

# MSG_Help_GotoToStartEndOfLine_Shortcut (38//)
source: SHIFT + cursor
pl: SHIFT + strzałki kursora

# MSG_Help_DeleteToStartEndOfLine (39//)
source: Delete to start/end of line
pl: Skasowanie do pocz±tku/końca linii

# MSG_Help_GotoToPrevNextWord (41//)
source: Goto to previous/next word
pl: Przej¶cie do poprzedniego/nastêpnego słowa

# MSG_Help_GotoToPrevNextWord_Shortcut (42//)
source: ALT + cursor
pl: ALT + strzałki kursora

# MSG_Help_DeleteToPrevNextWord (43//)
source: Delete previous/next word
pl: Skasowanie poprzedniego/nastêpnego słowa

# MSG_SelectOnActive (45//)
source: Select on Active
pl: Zaznaczanie przy aktywacji

# MSG_HELP_SelectOnActive (46//)
source: Automatically select all text when a BetterString object gets activated via TAB cycling or mouse activation.
pl: Automatycznie zaznacza cały tekst podczas aktywowania obiektu BetterString przy użyciu klawisza TAB lub wskaŒnika myszki.

# MSG_SelectPointer (47//)
source: Selection Pointer
pl: WskaŒnik zaznaczania

# MSG_HELP_SelectPointer (48//)
source: If enabled, a custom selection pointer will appear when the mouse pointer is above a betterstring gadget.
pl: Wł±czenie tej opcji spowoduje używanie własnego wskaŒnika zaznaczania gdy strzałka myszki znajdzie siê nad gadżetem klasy BetterString.
