Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/betterstring/mcp/locale/swedish.po
Languages: sv

# MSG_Label_Active (0//)
source: Active:
sv: Aktiv:

# MSG_Label_Background (1//)
source: Background
sv: Bakgrund

# MSG_Label_Cursor (2//)
source: Cursor:
sv: Markör:

# MSG_Label_Inactive (5//)
source: Inactive:
sv: Inaktiv:

# MSG_Label_Marked (6//)
source: Marked:
sv: Markerad:

# MSG_String_TestString (8//)
source: Test the power of BetterString here!
sv: Testa BetterStrings styrka här!

# MSG_Help_Copy (9//)
source: Copy all or marked text
sv: Kopiera allt eller markerad text

# MSG_Help_Cut (11//)
source: Cut all or marked text
sv: Klipp ut allt eller markerad text

# MSG_Help_Paste (13//)
source: Paste
sv: Klistra in

# MSG_Help_Undo (15//)
source: Undo last deletion
sv: Ångra senaste radering

# MSG_Help_Redo (17//)
source: Redo last deletion
sv: Gör om senaste radering

# MSG_Help_ToggleBuffer (19//)
source: Toggle between original and modified buffer
sv: Växla mellan original och modifierad buffer

# MSG_Help_ToggleCaseChar (21//)
source: Toggle case on character
sv: Växla mellan stor och liten bokstav

# MSG_Help_ToggleCaseWord (23//)
source: Toggle case on word
sv: Växla mellan stor och liten bokstav på ord

# MSG_Help_IncreaseNumber (25//)
source: Increase number
sv: Öka nummer

# MSG_Help_DecreaseNumber (27//)
source: Decrease number
sv: Minska nummer

# MSG_Help_HexToDecimal (29//)
source: Hex to Decimal
sv: Hex till decimal

# MSG_Help_DecimalToHex (31//)
source: Decimal to Hex
sv: Decimal till hex

# MSG_Help_FilenameCompletition (33//)
source: Filenamecompletion (use SHIFT to cycle back)
sv: Filnamnskomplettering (använd SHIFT för att gå bakåt)

# MSG_Help_Mark (35//)
source: Mark
sv: Markera

# MSG_Help_Mark_Shortcut (36//)
source: CTRL + cursor
sv: CTRL + markör

# MSG_Help_GotoToStartEndOfLine (37//)
source: Goto to start/end of line
sv: Gå till början/slutet av rad

# MSG_Help_GotoToStartEndOfLine_Shortcut (38//)
source: SHIFT + cursor
sv: SHIFT + markör

# MSG_Help_DeleteToStartEndOfLine (39//)
source: Delete to start/end of line
sv: Radera till början/slutet av rad

# MSG_Help_GotoToPrevNextWord (41//)
source: Goto to previous/next word
sv: Gå till föregående/nästa ord

# MSG_Help_GotoToPrevNextWord_Shortcut (42//)
source: ALT + cursor
sv: ALT + markör

# MSG_Help_DeleteToPrevNextWord (43//)
source: Delete previous/next word
sv: Radera föregående/nästa ord

# MSG_SelectOnActive (45//)
source: Select on Active
sv: Markera när aktiv

# MSG_HELP_SelectOnActive (46//)
source: Automatically select all text when a BetterString object gets activated via TAB cycling or mouse activation.
sv: Markera automatiskt all text när ett BetterString objekt blir aktivt, via TAB cykling eller mus aktivering.

# MSG_SelectPointer (47//)
source: Selection Pointer
sv: Markeringspekare

# MSG_HELP_SelectPointer (48//)
source: If enabled, a custom selection pointer will appear when the mouse pointer is above a betterstring gadget.
sv: Om vald, kommer en specialpekare att visas när muspekaren är ovanför ett betterstring objekt.
