Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/betterstring/mcp/locale/turkish.po
Languages: tr

# MSG_Label_Active (0//)
source: Active:
tr: Etkin:

# MSG_Label_Background (1//)
source: Background
tr: Art Alan

# MSG_Label_Cursor (2//)
source: Cursor:
tr: İmleç:

# MSG_Label_Inactive (5//)
source: Inactive:
tr: Etkin Olmayan:

# MSG_Label_Marked (6//)
source: Marked:
tr: İşaretli:

# MSG_Label_Text (7//)
source: Text
tr: Metin

# MSG_String_TestString (8//)
source: Test the power of BetterString here!
tr: BetterString'in gücünü burada sınayın!

# MSG_Help_Copy (9//)
source: Copy all or marked text
tr: Tüm veya işaretlenmiş metni kopyala

# MSG_Help_Cut (11//)
source: Cut all or marked text
tr: Tüm veya işaretlenmiş metni kes

# MSG_Help_Paste (13//)
source: Paste
tr: Yapıştır

# MSG_Help_Undo (15//)
source: Undo last deletion
tr: Son silineni geri al

# MSG_Help_Redo (17//)
source: Redo last deletion
tr: Son silmeyi yeniden yap

# MSG_Help_ToggleBuffer (19//)
source: Toggle between original and modified buffer
tr: Özgün veya değiştirilmiş tampon arasında geçiş yap

# MSG_Help_ToggleCaseChar (21//)
source: Toggle case on character
tr: Büyük harf/küçük harf değiştir

# MSG_Help_ToggleCaseWord (23//)
source: Toggle case on word
tr: Sözcüğü büyük/küçük harf değiştir

# MSG_Help_IncreaseNumber (25//)
source: Increase number
tr: Sayı arttır

# MSG_Help_DecreaseNumber (27//)
source: Decrease number
tr: Sayı azalt

# MSG_Help_HexToDecimal (29//)
source: Hex to Decimal
tr: 16'lığı, ondalık sayıya dönüştür.

# MSG_Help_DecimalToHex (31//)
source: Decimal to Hex
tr: Ondalığı 16'lığa dönüştür.

# MSG_Help_FilenameCompletition (33//)
source: Filenamecompletion (use SHIFT to cycle back)
tr: Dosya adı tamamlama (geri sekmek için BÜYÜKHARF tuşu kullanın)

# MSG_Help_FilenameCompletition_Shortcut (34//)
source: Amiga + TAB
tr: Aimiga + TAB

# MSG_Help_Mark (35//)
source: Mark
tr: İşaretle

# MSG_Help_Mark_Shortcut (36//)
source: CTRL + cursor
tr: CTRL + yön tuşu

# MSG_Help_GotoToStartEndOfLine (37//)
source: Goto to start/end of line
tr: Satırın başına/sonuna git

# MSG_Help_GotoToStartEndOfLine_Shortcut (38//)
source: SHIFT + cursor
tr: BÜYÜKHARF + yön tuşu

# MSG_Help_DeleteToStartEndOfLine (39//)
source: Delete to start/end of line
tr: Satırın başına/sonuna kadar sil

# MSG_Help_DeleteToStartEndOfLine_Shortcut (40//)
source: SHIFT + BACKSPACE/DELETE
tr: BÜYÜKHARF + GERİ/SİL

# MSG_Help_GotoToPrevNextWord (41//)
source: Goto to previous/next word
tr: Önceki/sonraki sözcük

# MSG_Help_GotoToPrevNextWord_Shortcut (42//)
source: ALT + cursor
tr: ALT + yön tuşu

# MSG_Help_DeleteToPrevNextWord (43//)
source: Delete previous/next word
tr: Önceki/sonraki sözcüğü sil

# MSG_Help_DeleteToPrevNextWord_Shortcut (44//)
source: ALT + BACKSPACE/DELETE
tr: ALT + GERİTUŞU/SİL

# MSG_SelectOnActive (45//)
source: Select on Active
tr: Etkinleşirken Tümünü Seç

# MSG_HELP_SelectOnActive (46//)
source: Automatically select all text when a BetterString object gets activated via TAB cycling or mouse activation.
tr: Bir BetterString nesnesi fare veya sekme tuşu ile etkinleştirildiğinde, otomatik olarak içerdiği tüm metin seçilir.

# MSG_SelectPointer (47//)
source: Selection Pointer
tr: Seçim İşaretçisi

# MSG_HELP_SelectPointer (48//)
source: If enabled, a custom selection pointer will appear when the mouse pointer is above a betterstring gadget.
tr: Etkinleştirilirse, fare bir BetterString nesnesi üzerinde olduğunda özel seçim işaretçisi görüntülenecektir.
