Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlisttree_mcp/locale/*.po
Languages: german, italian

# MSG_GROUP_IMAGES_COLORS (2//)
source: Images/Colors
german: Bilder/Farben
italian: Immagini e colori

# MSG_BUTTON_LABEL_CLOSED (3//)
source: Closed
german: Geschlossen
italian: Nodo chiuso

# MSG_BUTTON_SHORTCUT_CLOSED (4//)
source: c
german: g

# MSG_HELP_CLOSED_IMAGE (5//)
source: Image to use for closed nodes.
german: Bild für geschlossene Knoten
italian: Immagine da usare per i nodi chiusi.

# MSG_WIN_TITLE_CLOSED_IMAGE (6//)
source: Adjust image for closed nodes
german: Bild für geschlossene Knoten ändern
italian: Modifica immagine per i nodi chiusi

# MSG_BUTTON_LABEL_LINES (7//)
source: Lines
german: Linien
italian: Linee

# MSG_HELP_LINES_COLOR (9//)
source: Color to use for lines.
german: Farbe für Linien
italian: Colore da usare per le linee.

# MSG_WIN_TITLE_LINES_COLOR (10//)
source: Adjust lines color
german: Farbe für Linien ändern
italian: Modifica colore delle linee

# MSG_BUTTON_LABEL_OPEN (11//)
source: Open
german: Geöffnet
italian: Nodo aperto

# MSG_BUTTON_SHORTCUT_OPEN (12//)
source: o
german: ö
italian: a

# MSG_HELP_OPEN_IMAGE (13//)
source: Image to use for open nodes.
german: Bild für geöffnete Knoten
italian: Immagine da usare per i nodi aperti.

# MSG_WIN_TITLE_OPEN_IMAGE (14//)
source: Adjust image for open nodes
german: Bild für geöffnete Knoten ändern
italian: Modifica immagine per i nodi aperti

# MSG_BUTTON_LABEL_SHADOW (15//)
source: Shadow
german: Schatten
italian: Ombra

# MSG_BUTTON_SHORTCUT_SHADOW (16//)
source: w
german: s
italian: o

# MSG_HELP_SHADOW_COLOR (17//)
source: Color to use to cast shadows after lines.
german: Farbe um Schatten unter Linien zu malen
italian: Colore da usare per la formazione delle ombre dopo le linee.

# MSG_WIN_TITLE_SHADOW_COLOR (18//)
source: Adjust shadow color
german: Schattenfarbe ändern
italian: Modifica colore ombra

# MSG_BUTTON_LABEL_SPECIAL (19//)
source: Special
german: Speziell
italian: Speciale

# MSG_BUTTON_SHORTCUT_SPECIAL (20//)
source: i
german: p

# MSG_HELP_SPECIAL_IMAGE (21//)
source: A special image to be displayed after every node.
german: Spezielles Bild, das hinter jedem Knoten angezeigt wird
italian: Immagine speciale da visualizzare dopo ogni nodo.

# MSG_WIN_TITLE_SPECIAL_IMAGE (22//)
source: Adjust special image
german: Spezielles Bild ändern
italian: Modifica immagine speciale

# MSG_BUTTON_LABEL_DRAW (23//)
source: Draw
german: Zeichnen

# MSG_BUTTON_SHORTCUT_DRAW (24//)
source: d
german: z

# MSG_HELP_DRAW_COLOR (25//)
source: A draw color to be combined with the lines color.
german: Zeichenfarbe, die mit der Linienfarbe kombiniert wird
italian: Un colore draw da combinare con i colori delle linee.

# MSG_WIN_TITLE_DRAW_COLOR (26//)
source: Adjust draw color
german: Zeichenfarbe ändern
italian: Modifica colore draw

# MSG_GROUP_STYLE (27//)
source: Style
german: Stil
italian: Stile

# MSG_CYCLE_LABEL_STYLE (28//)
source: Style
german: Stil
italian: Stile

# MSG_CYCLE_SHORTCUT_STYLE (29//)
source: s
german: i

# MSG_HELP_STYLE (30//)
source: Select here the global style of the tree. Depending on your choice, some of the options above may become (un)available.
german: Wählen Sie hier den globalen Stil des Baums. Abhängig von Ihrer Wahl können einige Optionen von oben (in)aktiv werden.
italian: Seleziona qui lo stile globale dell'albero directory. In base alle scelte effettuate alcune funzionalità potrebbero risultare disattivate.

# MSG_CYCLE_ITEM_STYLE_INSERTED (32//)
source: Inserted
german: Eingerückt
italian: Inserito

# MSG_CYCLE_ITEM_STYLE_LINES (33//)
source: Lines
german: Linien
italian: Linee

# MSG_CYCLE_ITEM_STYLE_LINES3D (36//)
source: Lines 3D
german: 3D-Linien
italian: Linee 3D

# MSG_BUTTON_LABEL_SPACE (39//)
source: Spacing
german: Abstand
italian: Spaziatura

# MSG_BUTTON_SHORTCUT_SPACE (40//)
source: p
german: a

# MSG_HELP_SPACE (41//)
source: The more spacing, the wider the listtree will be.
german: Je mehr Abstand um so breiter wird der Baum werden.
italian: Maggiore sarà lo spazio più ampia sarà la listtree.

# MSG_BUTTON_LABEL_REMEMBER (42//)
source: Remember status?
german: Zustand merken?
italian: Ricorda stato?

# MSG_BUTTON_SHORTCUT_REMEMBER (43//)
source: r
german: m

# MSG_HELP_REMEMBER (44//)
source: If enabled, the open/closed status of nodes will be 'remembered' after the listtree is closed the next time it is opened again. Please note, however, that an application can override your choice here.
german: Fall aktiv merkt sich der Baum den geöffnet/geschlossen Zustand der Knoten und stellt diesen beim nächsten Darstellen wieder her. Hinweis: ein Programm kann diese Option ignorieren.
italian: Se attivato, lo stato dei nodi di apertura e chiusura verrà memorizzato in tutte le listtree in precedenza aperte. Non dimenticare però che le singole applicazioni continueranno ad essere in grado di sovrascrivere queste impostazioni.

# MSG_BUTTON_LABEL_AUTOSCROLL (45//)
source: Autoscroll?
german: Automatisch scrollen?
italian: Scorrimento automatico?

# MSG_BUTTON_SHORTCUT_AUTOSCROLL (46//)
source: a
german: c

# MSG_HELP_AUTOSCROLL (47//)
source: If enabled, the listview will auto-scroll its contents when opening nodes to try and fit the visible area.
german: Fall aktiv wird der Baum seinen Inhalt entsprechend anpassen, um geöffnete Knoten möglichst komplett darzustellen.
italian: Se attivato la listview scrollerà automaticamente i suoi contenuti durante l'apertuta dei nodi in modo da adattarsi per quanto possibile all'area visibile.

# MSG_TAB_EXAMPLE (48//)
source: Example
german: Beispiel
italian: Esempio

# MSG_HELP_LISTVIEW_EXAMPLE (49//)
source: This NListtree object reacts in real time to the changes you apply under the 'Layout' tab. Give it a try! :)
german: Der Baum reagiert in Echtzeit auf Änderungen auf der Layout-Seite. Probieren Sie es aus! :)
italian: L'oggetto NListtree è in grado di reagire in tempo reale ad ogni modifica apportata al 'Layout' Fai alcune prove! :-)

# MSG_BUTTON_LABEL_EXPAND (50//)
source: Expand
german: Alle öffnen
italian: Espandi

# MSG_BUTTON_SHORTCUT_EXPAND (51//)
source: n
german: f

# MSG_BUTTON_LABEL_COLLAPSE (52//)
source: Collapse
german: Alle schließen
italian: Comprimi

# MSG_BUTTON_LABEL_LINETYPES (54//)
source: Line type
german: Linienstil
italian: Linea tipo

# MSG_BUTTON_SHORTCUT_LINETYPES (55//)
source: l
german: n

# MSG_LINETYPE_DISABLED (56//)
source: Disabled
german: keine
italian: disattivata

# MSG_LINETYPE_DOTTED (58//)
source: Dotted
german: gepunktet
italian: puntata

# MSG_LINETYPE_SHADOW (59//)
source: Shadow
german: schattiert
italian: ombra

# MSG_LINETYPE_GLOW (60//)
source: Glow
german: glühend

# MSG_HELP_LINETYPES (61//)
source: Select the line type used for drawing the individual levels in the listtree.
german: Wählen Sie hier den Stil zum Zeichen der Linien für die unterschiedlichen Ebenen des Baumes.
italian: Seleziona il tipo di linea da usare per il disegno dei livelli individuali all'interno della listtree.

# MSG_BUTTON_LABEL_FOLDER (62//)
source: Folder image
german: Verzeichnisbild
italian: Immagine cassetto

# MSG_BUTTON_SHORTCUT_FOLDER (63//)
source: f
german: V
italian: c

# MSG_WIN_TITLE_FOLDER_IMAGE (64//)
source: Adjust folder image
german: Verzeichnisbild ändern
italian: Modifica immagine cassetto

# MSG_HELP_FOLDER_IMAGE (65//)
source: An image displayed in front of every node containing subnodes.
german: Vor jedem Eintrag mit weiteren Untereinträgen wird dieses Bild angezeigt.
italian: Un'immagine verrà mostrata davanti ad ogni nodo contenente dei sotto-nodi.

# MSG_BUTTON_LABEL_FOLDERIMAGE (66//)
source: Use folder image
german: Verzeichnisbild benutzen
italian: Usa immagine cassetto

# MSG_BUTTON_SHORTCUT_FOLDERIMAGE (67//)
source: i
german: b

# MSG_HELP_FOLDERIMAGE (68//)
source: Select if you want a folder image to appear in front of every node containing subnodes.
german: Wählen Sie hier, ob vor jedem Eintrag mit weiteren Untereinträgen ein Verzeichnisbild angezeigt werden soll.
italian: Scegli se avere o meno un'immagine per la cartella da visualizzare davanti ad ogni nodo contenente dei sotto-nodi.

# MSG_BUTTON_LABEL_INDENTWIDTH (69//)
source: Additional indent width
german: Zusätzl. Einzugsbreite
italian: Larghezza indentazione aggiuntiva

# MSG_BUTTON_SHORTCUT_INDENTWIDTH (70//)
source: w
german: E
italian: v

# MSG_HELP_INDENTWIDTH (71//)
source: Specify an additional indent width applied to each subnode.
german: Legt eine zusätzliche Einzugsbreite für jeden Untereintrag fest.
italian: Specifica la larghezza dell'indentazione aggiuntiva da applicare in ciascun sotto-nodo.

# MSG_BUTTON_LABEL_GLOW (72//)
source: Glow color
german: Glühfarbe
italian: Colore glow

# MSG_WIN_TITLE_GLOW_COLOR (74//)
source: Set glow line color
german: Legt die Linienfarbe für das Glühen fest
italian: Imposta linea di colore glow

# MSG_HELP_GLOW_COLOR (75//)
source: Allows to set the color for the glow line type
german: Wählen Sie hier die Farbe für den Glüheffekt der Linien.
italian: Permette l'impostazione del colore relativa al tipo di linea glow.

# MSG_CYCLE_ITEM_STYLE_NORMAL (31//)
source: Normal
italian: Normale

# MSG_CYCLE_ITEM_STYLE_WIN98 (34//)
source: Win98
italian: Windows 98

# MSG_CYCLE_ITEM_STYLE_MAC (35//)
source: Mac
italian: MacOS

# MSG_CYCLE_ITEM_STYLE_WIN98PLUS (37//)
source: Win98+
italian: Windows 98+

# MSG_BUTTON_SHORTCUT_COLLAPSE (53//)
source: e
italian: m

# MSG_LINETYPE_NORMAL (57//)
source: Normal
italian: normale
