Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlisttree_mcp/locale/danish.po
Languages: da

# MSG_TAB_LAYOUT (1//)
source: Layout
da: Udseende

# MSG_GROUP_IMAGES_COLORS (2//)
source: Images/Colors
da: Billeder/Farver

# MSG_BUTTON_LABEL_CLOSED (3//)
source: Closed
da: Lukkede

# MSG_BUTTON_SHORTCUT_CLOSED (4//)
source: c
da: k

# MSG_HELP_CLOSED_IMAGE (5//)
source: Image to use for closed nodes.
da: Billede som benyttes til lukkede knuder.

# MSG_WIN_TITLE_CLOSED_IMAGE (6//)
source: Adjust image for closed nodes
da: Tilpas billedet for lukkede knuder

# MSG_BUTTON_LABEL_LINES (7//)
source: Lines
da: Linjer

# MSG_HELP_LINES_COLOR (9//)
source: Color to use for lines.
da: Farve som benyttes til linjer.

# MSG_WIN_TITLE_LINES_COLOR (10//)
source: Adjust lines color
da: Tilpas linjers farve

# MSG_BUTTON_LABEL_OPEN (11//)
source: Open
da: Åbne

# MSG_BUTTON_SHORTCUT_OPEN (12//)
source: o
da: å

# MSG_HELP_OPEN_IMAGE (13//)
source: Image to use for open nodes.
da: Billede som benyttes til åbne knuder.

# MSG_WIN_TITLE_OPEN_IMAGE (14//)
source: Adjust image for open nodes
da: Tilpas billedet for åbne knuder

# MSG_BUTTON_LABEL_SHADOW (15//)
source: Shadow
da: Skygge

# MSG_BUTTON_SHORTCUT_SHADOW (16//)
source: w
da: y

# MSG_HELP_SHADOW_COLOR (17//)
source: Color to use to cast shadows after lines.
da: Farve som benyttes til at lave skygger efter linjer.

# MSG_WIN_TITLE_SHADOW_COLOR (18//)
source: Adjust shadow color
da: Tilpas skyggefarven

# MSG_BUTTON_LABEL_SPECIAL (19//)
source: Special
da: Specielt

# MSG_HELP_SPECIAL_IMAGE (21//)
source: A special image to be displayed after every node.
da: Et specielt billede som vises efter hver knude.

# MSG_WIN_TITLE_SPECIAL_IMAGE (22//)
source: Adjust special image
da: Tilpas det specielle billede

# MSG_BUTTON_LABEL_DRAW (23//)
source: Draw
da: Tegning

# MSG_BUTTON_SHORTCUT_DRAW (24//)
source: d
da: t

# MSG_HELP_DRAW_COLOR (25//)
source: A draw color to be combined with the lines color.
da: En tegningsfarve som kombineres med linjefarven.

# MSG_WIN_TITLE_DRAW_COLOR (26//)
source: Adjust draw color
da: Tilpas tegningsfarven

# MSG_GROUP_STYLE (27//)
source: Style
da: Stil

# MSG_CYCLE_LABEL_STYLE (28//)
source: Style
da: Stil

# MSG_HELP_STYLE (30//)
source: Select here the global style of the tree. Depending on your choice, some of the options above may become (un)available.
da: Her vælges træets generelle stil. Afhængigt af hvilke valg man foretager, kan nogle af ovenstående valgmuligheder blive (u)tilgængelige.

# MSG_CYCLE_ITEM_STYLE_INSERTED (32//)
source: Inserted
da: Indrykket

# MSG_CYCLE_ITEM_STYLE_LINES (33//)
source: Lines
da: Linjer

# MSG_CYCLE_ITEM_STYLE_LINES3D (36//)
source: Lines 3D
da: 3D-linjer

# MSG_CYCLE_ITEM_STYLE_GLOW (38//)
source: Glow
da: Glød

# MSG_BUTTON_LABEL_SPACE (39//)
source: Spacing
da: Afstand

# MSG_BUTTON_SHORTCUT_SPACE (40//)
source: p
da: a

# MSG_HELP_SPACE (41//)
source: The more spacing, the wider the listtree will be.
da: Jo mere afstand, des bredere bliver listetræet.

# MSG_BUTTON_LABEL_REMEMBER (42//)
source: Remember status?
da: Gemme tilstand

# MSG_BUTTON_SHORTCUT_REMEMBER (43//)
source: r
da: g

# MSG_HELP_REMEMBER (44//)
source: If enabled, the open/closed status of nodes will be 'remembered' after the listtree is closed the next time it is opened again. Please note, however, that an application can override your choice here.
da: Ved hak her vil knudernes åben-/lukket-tilstande blive gemt efter at listetræet er lukket, til næste gang det åbnes. Bemærk dog at en applikation kan overstyre dit valg her.

# MSG_BUTTON_LABEL_AUTOSCROLL (45//)
source: Autoscroll?
da: Autorulning

# MSG_BUTTON_SHORTCUT_AUTOSCROLL (46//)
source: a
da: u

# MSG_HELP_AUTOSCROLL (47//)
source: If enabled, the listview will auto-scroll its contents when opening nodes to try and fit the visible area.
da: Ved hak her vil listetræet automatisk rulle sit indhold når knuder åbnes, for at forsøge at tilpasse sig det synlige område.

# MSG_TAB_EXAMPLE (48//)
source: Example
da: Eksempel

# MSG_HELP_LISTVIEW_EXAMPLE (49//)
source: This NListtree object reacts in real time to the changes you apply under the 'Layout' tab. Give it a try! :)
da: Dette NListtree-objekt reagerer straks på de ændringer man foretager i fanebladet 'Udseende'. Prøv det engang! :)

# MSG_BUTTON_LABEL_EXPAND (50//)
source: Expand
da: Folde ud

# MSG_BUTTON_SHORTCUT_EXPAND (51//)
source: n
da: f

# MSG_BUTTON_LABEL_COLLAPSE (52//)
source: Collapse
da: Folde sammen

# MSG_BUTTON_SHORTCUT_COLLAPSE (53//)
source: e
da: m

# MSG_BUTTON_LABEL_LINETYPES (54//)
source: Line type
da: Linjetype

# MSG_BUTTON_SHORTCUT_LINETYPES (55//)
source: l
da: p

# MSG_LINETYPE_DISABLED (56//)
source: Disabled
da: Slået fra

# MSG_LINETYPE_DOTTED (58//)
source: Dotted
da: Punkteret

# MSG_LINETYPE_SHADOW (59//)
source: Shadow
da: Skygge

# MSG_LINETYPE_GLOW (60//)
source: Glow
da: Glød

# MSG_HELP_LINETYPES (61//)
source: Select the line type used for drawing the individual levels in the listtree.
da: Vælg hvilken linjetype der skan benyttes til at tegne de enkelte niveauer i listetræet.

# MSG_BUTTON_LABEL_FOLDER (62//)
source: Folder image
da: Mappebillede

# MSG_BUTTON_SHORTCUT_FOLDER (63//)
source: f
da: b

# MSG_WIN_TITLE_FOLDER_IMAGE (64//)
source: Adjust folder image
da: Tilpas mappebilledet

# MSG_HELP_FOLDER_IMAGE (65//)
source: An image displayed in front of every node containing subnodes.
da: Et billede som vises foran hver knude som har andre knuder under sig.

# MSG_BUTTON_LABEL_FOLDERIMAGE (66//)
source: Use folder image
da: Benytte mappebillede

# MSG_BUTTON_SHORTCUT_FOLDERIMAGE (67//)
source: i
da: e

# MSG_HELP_FOLDERIMAGE (68//)
source: Select if you want a folder image to appear in front of every node containing subnodes.
da: Ved hak her vises et mappebillede foran hver knude som har andre knuder under sig.

# MSG_BUTTON_LABEL_INDENTWIDTH (69//)
source: Additional indent width
da: Bredde på ekstra indrykning

# MSG_BUTTON_SHORTCUT_INDENTWIDTH (70//)
source: w
da: r

# MSG_HELP_INDENTWIDTH (71//)
source: Specify an additional indent width applied to each subnode.
da: Angiv bredden på den ekstra indrykning som hver underknude skal have.

# MSG_BUTTON_LABEL_GLOW (72//)
source: Glow color
da: Glødefarve

# MSG_BUTTON_SHORTCUT_GLOW (73//)
source: g
da: ø

# MSG_WIN_TITLE_GLOW_COLOR (74//)
source: Set glow line color
da: Angiv farven på linjeglødeeffekten

# MSG_HELP_GLOW_COLOR (75//)
source: Allows to set the color for the glow line type
da: Giver mulighed for at angive den farve som glødende linjer skal benytte.
