Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlisttree_mcp/locale/greek.po
Languages: el

# MSG_TAB_LAYOUT (1//)
source: Layout
el: Διάταξη

# MSG_GROUP_IMAGES_COLORS (2//)
source: Images/Colors
el: Εικόνες/Χρώματα

# MSG_BUTTON_LABEL_CLOSED (3//)
source: Closed
el: Κλειστό

# MSG_BUTTON_SHORTCUT_CLOSED (4//)
source: c
el: κ

# MSG_HELP_CLOSED_IMAGE (5//)
source: Image to use for closed nodes.
el: Χρήση εικόνας για κλειστούς κόμβους.

# MSG_WIN_TITLE_CLOSED_IMAGE (6//)
source: Adjust image for closed nodes
el: Τροποποίηση εικόνας για κλειστούς κόμβους

# MSG_BUTTON_LABEL_LINES (7//)
source: Lines
el: Γραμμές

# MSG_BUTTON_SHORTCUT_LINES (8//)
source: l
el: γ

# MSG_HELP_LINES_COLOR (9//)
source: Color to use for lines.
el: Χρήση χρώματος για τις γραμμές.

# MSG_WIN_TITLE_LINES_COLOR (10//)
source: Adjust lines color
el: Τροποποίηση χρώματος γραμμών

# MSG_BUTTON_LABEL_OPEN (11//)
source: Open
el: Ανοικτό

# MSG_BUTTON_SHORTCUT_OPEN (12//)
source: o
el: α

# MSG_HELP_OPEN_IMAGE (13//)
source: Image to use for open nodes.
el: Χρήση εικόνας για ανοικτούς κόμβους.

# MSG_WIN_TITLE_OPEN_IMAGE (14//)
source: Adjust image for open nodes
el: Τροποποίηση εικόνας για ανοικτούς κόμβους

# MSG_BUTTON_LABEL_SHADOW (15//)
source: Shadow
el: Σκιά

# MSG_BUTTON_SHORTCUT_SHADOW (16//)
source: w
el: σ

# MSG_HELP_SHADOW_COLOR (17//)
source: Color to use to cast shadows after lines.
el: Χρήση χρώματος για την επιβολή σκιάς μετά τις γραμμές.

# MSG_WIN_TITLE_SHADOW_COLOR (18//)
source: Adjust shadow color
el: Τροποποίηση χρώματος σκιάς

# MSG_BUTTON_LABEL_SPECIAL (19//)
source: Special
el: Ειδική

# MSG_BUTTON_SHORTCUT_SPECIAL (20//)
source: i
el: δ

# MSG_HELP_SPECIAL_IMAGE (21//)
source: A special image to be displayed after every node.
el: Προβολή μιας ειδικής εικόνας μετά από κάθε κόμβο.

# MSG_WIN_TITLE_SPECIAL_IMAGE (22//)
source: Adjust special image
el: Τροποποίηση ειδικής εικόνας

# MSG_BUTTON_LABEL_DRAW (23//)
source: Draw
el: Σχεδίαση

# MSG_BUTTON_SHORTCUT_DRAW (24//)
source: d
el: χ

# MSG_HELP_DRAW_COLOR (25//)
source: A draw color to be combined with the lines color.
el: Ένα χρώμα σχεδίασης που θα συνδυαστεί με το χρώμα των γραμμών.

# MSG_WIN_TITLE_DRAW_COLOR (26//)
source: Adjust draw color
el: Τροποποίηση χρώματος σχεδίασης

# MSG_GROUP_STYLE (27//)
source: Style
el: Στυλ

# MSG_CYCLE_LABEL_STYLE (28//)
source: Style
el: Στυλ

# MSG_CYCLE_SHORTCUT_STYLE (29//)
source: s
el: λ

# MSG_HELP_STYLE (30//)
source: Select here the global style of the tree. Depending on your choice, some of the options above may become (un)available.
el: Επιλέξτε εδώ το γενικό στυλ του δέντρου. Ανάλογα με την επιλογή σας, μερικές από τις παραπάνω επιλογές μπορεί να γίνουν (μη) διαθέσιμες.

# MSG_CYCLE_ITEM_STYLE_NORMAL (31//)
source: Normal
el: Κανονικό

# MSG_CYCLE_ITEM_STYLE_INSERTED (32//)
source: Inserted
el: Εισεχθόμενο

# MSG_CYCLE_ITEM_STYLE_LINES (33//)
source: Lines
el: Γραμμές

# MSG_CYCLE_ITEM_STYLE_LINES3D (36//)
source: Lines 3D
el: Γραμμές 3D

# MSG_CYCLE_ITEM_STYLE_GLOW (38//)
source: Glow
el: Λάμψη

# MSG_BUTTON_LABEL_SPACE (39//)
source: Spacing
el: Διάστημα

# MSG_BUTTON_SHORTCUT_SPACE (40//)
source: p
el: τ

# MSG_HELP_SPACE (41//)
source: The more spacing, the wider the listtree will be.
el: Όσο περισσότερο διάστημα, τόσο ευρύτερη θα γίνει η λίστα του δέντρου.

# MSG_BUTTON_LABEL_REMEMBER (42//)
source: Remember status?
el: Υπενθύμιση κατάστασης;

# MSG_BUTTON_SHORTCUT_REMEMBER (43//)
source: r
el: υ

# MSG_HELP_REMEMBER (44//)
source: If enabled, the open/closed status of nodes will be 'remembered' after the listtree is closed the next time it is opened again. Please note, however, that an application can override your choice here.
el: Αν ενεργοποιηθεί, η κατάσταση άνοιγμα/κλείσιμο των κόμβων θα αποθηκευτεί μετά το κλείσιμο της λίστας δέντρου για την επόμενη φορά που θα ανοιχτεί ξανά. Σημειώστε, όμως, ότι κάποιο πρόγραμμα μπορεί να υπερκαλύψει την επιλογή σας.

# MSG_BUTTON_LABEL_AUTOSCROLL (45//)
source: Autoscroll?
el: Αυτόματη κύλιση;

# MSG_BUTTON_SHORTCUT_AUTOSCROLL (46//)
source: a
el: μ

# MSG_HELP_AUTOSCROLL (47//)
source: If enabled, the listview will auto-scroll its contents when opening nodes to try and fit the visible area.
el: Αν ενεργοποιηθεί, η προβολή λίστας θα κυλίσει αυτόματα τα περιεχόμενά της κατά το άνοιγμα κόμβων, προσπαθώντας να προσαρμοστεί με την ορατή περιοχή.

# MSG_TAB_EXAMPLE (48//)
source: Example
el: Παράδειγμα

# MSG_HELP_LISTVIEW_EXAMPLE (49//)
source: This NListtree object reacts in real time to the changes you apply under the 'Layout' tab. Give it a try! :)
el: Αυτό το αντικείμενο NListtree αντιδρά σε πραγματικό χρόνο στις αλλαγές που κάνετε κάτω από την ετικέττα 'Διάταξη'. Δώστε του μια προσπάθεια!

# MSG_BUTTON_LABEL_EXPAND (50//)
source: Expand
el: Ανάπτυξη

# MSG_BUTTON_SHORTCUT_EXPAND (51//)
source: n
el: ξ

# MSG_BUTTON_LABEL_COLLAPSE (52//)
source: Collapse
el: Σύμπτυξη

# MSG_BUTTON_SHORTCUT_COLLAPSE (53//)
source: e
el: μ

# MSG_BUTTON_LABEL_LINETYPES (54//)
source: Line type
el: Τύπος γραμμής

# MSG_BUTTON_SHORTCUT_LINETYPES (55//)
source: l
el: γ

# MSG_LINETYPE_DISABLED (56//)
source: Disabled
el: Απενεργοποιημένη

# MSG_LINETYPE_NORMAL (57//)
source: Normal
el: Κανονική

# MSG_LINETYPE_DOTTED (58//)
source: Dotted
el: Κουκίδες

# MSG_LINETYPE_SHADOW (59//)
source: Shadow
el: Σκιά

# MSG_LINETYPE_GLOW (60//)
source: Glow
el: Λάμψη

# MSG_HELP_LINETYPES (61//)
source: Select the line type used for drawing the individual levels in the listtree.
el: Επιλέξτε το τύπο γραμμής που θα χρησιμοποιηθεί για τη σχεδίαση των μεμονομένων επιπέδων στη λίστα του δέντρου.

# MSG_BUTTON_LABEL_FOLDER (62//)
source: Folder image
el: Φάκελος εικόνας

# MSG_BUTTON_SHORTCUT_FOLDER (63//)
source: f
el: φ

# MSG_WIN_TITLE_FOLDER_IMAGE (64//)
source: Adjust folder image
el: Τροποποίηση φακέλου εικόνας

# MSG_HELP_FOLDER_IMAGE (65//)
source: An image displayed in front of every node containing subnodes.
el: Εμφανίζεται μια εικόνα μπροστά από κάθε κόμβο που περιλαμβάνει υπο-κόμβους.

# MSG_BUTTON_LABEL_FOLDERIMAGE (66//)
source: Use folder image
el: Χρήση φακέλου εικόνας

# MSG_BUTTON_SHORTCUT_FOLDERIMAGE (67//)
source: i
el: χ

# MSG_HELP_FOLDERIMAGE (68//)
source: Select if you want a folder image to appear in front of every node containing subnodes.
el: Επιλέξτε αν θέλετε ένας φάκελος εικόνας να εμφανίζεται μπροστά από κάθε κόμβο που περιέχει υπο-κόμβους.

# MSG_BUTTON_LABEL_INDENTWIDTH (69//)
source: Additional indent width
el: Επιπλέον πρόθεση μήκους

# MSG_BUTTON_SHORTCUT_INDENTWIDTH (70//)
source: w
el: θ

# MSG_HELP_INDENTWIDTH (71//)
source: Specify an additional indent width applied to each subnode.
el: Καθορίστε μια επιπλέον πρόθεση μήκους που θα εφαρμοστεί σε κάθε υπο-κόμβο.

# MSG_BUTTON_LABEL_GLOW (72//)
source: Glow color
el: Χρώμα λάμψης

# MSG_BUTTON_SHORTCUT_GLOW (73//)
source: g
el: ψ

# MSG_WIN_TITLE_GLOW_COLOR (74//)
source: Set glow line color
el: Ορίστε το χρώμα λάμψης γραμμής

# MSG_HELP_GLOW_COLOR (75//)
source: Allows to set the color for the glow line type
el: Επιτρέπει να ορίστε το χρώμα για το τύπο λάμψης γραμμής.
