Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlisttree_mcp/locale/polish.po
Languages: pl

# MSG_TAB_LAYOUT (1//)
source: Layout
pl: Układ

# MSG_GROUP_IMAGES_COLORS (2//)
source: Images/Colors
pl: Obrazki/Kolory

# MSG_BUTTON_LABEL_CLOSED (3//)
source: Closed
pl: Zamkniêty

# MSG_BUTTON_SHORTCUT_CLOSED (4//)
source: c
pl: Z

# MSG_HELP_CLOSED_IMAGE (5//)
source: Image to use for closed nodes.
pl: Obrazek używany do wy¶wietlania zamkniêtych wêzłów.

# MSG_WIN_TITLE_CLOSED_IMAGE (6//)
source: Adjust image for closed nodes
pl: Wybierz obrazek dla zamkniêtych wêzłów

# MSG_BUTTON_LABEL_LINES (7//)
source: Lines
pl: Linie

# MSG_HELP_LINES_COLOR (9//)
source: Color to use for lines.
pl: Kolor używany do rysowania linii ł±cz±cych.

# MSG_WIN_TITLE_LINES_COLOR (10//)
source: Adjust lines color
pl: Wybierz kolor linii

# MSG_BUTTON_LABEL_OPEN (11//)
source: Open
pl: Otwarty

# MSG_HELP_OPEN_IMAGE (13//)
source: Image to use for open nodes.
pl: Obrazek używany do wy¶wietlania otwartych wêzłów.

# MSG_WIN_TITLE_OPEN_IMAGE (14//)
source: Adjust image for open nodes
pl: Wybierz obrazek dla otwartych wêzłów

# MSG_BUTTON_LABEL_SHADOW (15//)
source: Shadow
pl: Cienie

# MSG_BUTTON_SHORTCUT_SHADOW (16//)
source: w
pl: C

# MSG_HELP_SHADOW_COLOR (17//)
source: Color to use to cast shadows after lines.
pl: Kolor używany do rysowania cienia rzucanego przez linie.

# MSG_WIN_TITLE_SHADOW_COLOR (18//)
source: Adjust shadow color
pl: Wybierz kolor cienia

# MSG_BUTTON_LABEL_SPECIAL (19//)
source: Special
pl: Specjalny

# MSG_BUTTON_SHORTCUT_SPECIAL (20//)
source: i
pl: j

# MSG_HELP_SPECIAL_IMAGE (21//)
source: A special image to be displayed after every node.
pl: Specjalny obrazek wy¶wietlany za każdym wêzłem.

# MSG_WIN_TITLE_SPECIAL_IMAGE (22//)
source: Adjust special image
pl: Wybierz obrazek specjalny

# MSG_BUTTON_LABEL_DRAW (23//)
source: Draw
pl: Rysowanie

# MSG_BUTTON_SHORTCUT_DRAW (24//)
source: d
pl: R

# MSG_HELP_DRAW_COLOR (25//)
source: A draw color to be combined with the lines color.
pl: Kolor rysowania używany w poł±czeniu z kolorem linii.

# MSG_WIN_TITLE_DRAW_COLOR (26//)
source: Adjust draw color
pl: Wybierz kolor rysowania

# MSG_GROUP_STYLE (27//)
source: Style
pl: Styl

# MSG_CYCLE_LABEL_STYLE (28//)
source: Style
pl: Styl

# MSG_HELP_STYLE (30//)
source: Select here the global style of the tree. Depending on your choice, some of the options above may become (un)available.
pl: Wybiera globalne ustawienia stylu drzewa. W zależno¶ci od wybranego stylu niektóre opcje powyżej mog± byæ (nie)dostêpne.

# MSG_CYCLE_ITEM_STYLE_NORMAL (31//)
source: Normal
pl: normalny

# MSG_CYCLE_ITEM_STYLE_INSERTED (32//)
source: Inserted
pl: z wciêciami

# MSG_CYCLE_ITEM_STYLE_LINES (33//)
source: Lines
pl: linie

# MSG_CYCLE_ITEM_STYLE_LINES3D (36//)
source: Lines 3D
pl: linie 3D

# MSG_CYCLE_ITEM_STYLE_GLOW (38//)
source: Glow
pl: styl Glow

# MSG_BUTTON_LABEL_SPACE (39//)
source: Spacing
pl: Odstêpy

# MSG_HELP_SPACE (41//)
source: The more spacing, the wider the listtree will be.
pl: Im wiêksze odstêpy zostan± ustawione, tym obszerniejsze bêdzie wy¶wietlane drzewo.

# MSG_BUTTON_LABEL_REMEMBER (42//)
source: Remember status?
pl: Pamiêtaj stan

# MSG_BUTTON_SHORTCUT_REMEMBER (43//)
source: r
pl: P

# MSG_HELP_REMEMBER (44//)
source: If enabled, the open/closed status of nodes will be 'remembered' after the listtree is closed the next time it is opened again. Please note, however, that an application can override your choice here.
pl: Je¶li ta opcja jest wł±czona, stan wêzłów bêdzie "zapamiêtywany" po zamkniêciu widoku drzewa i przywracany po jego ponownym otworzeniu. Pamiêtaj jednak, iż aplikacja może zastosowaæ inne ustawienia, niż wybrane tutaj przez Ciebie.

# MSG_BUTTON_LABEL_AUTOSCROLL (45//)
source: Autoscroll?
pl: Autoprzewijanie

# MSG_HELP_AUTOSCROLL (47//)
source: If enabled, the listview will auto-scroll its contents when opening nodes to try and fit the visible area.
pl: Je¶li ta opcja jest wł±czona, lista wy¶wietlania bêdzie automatycznie przewijała zawarto¶æ podczas otwierania wêzłów tak, by spróbowaæ wy¶wietliæ zawarto¶æ w widocznym obszarze.

# MSG_TAB_EXAMPLE (48//)
source: Example
pl: Przykład

# MSG_HELP_LISTVIEW_EXAMPLE (49//)
source: This NListtree object reacts in real time to the changes you apply under the 'Layout' tab. Give it a try! :)
pl: Ten obiekt NListtree reaguje w czasie rzeczywistym na zmiany wprowadzane w zakładce "Układ". Wypróbuj go! :)

# MSG_BUTTON_LABEL_EXPAND (50//)
source: Expand
pl: Rozwiń

# MSG_BUTTON_SHORTCUT_EXPAND (51//)
source: n
pl: R

# MSG_BUTTON_LABEL_COLLAPSE (52//)
source: Collapse
pl: Zwiń

# MSG_BUTTON_SHORTCUT_COLLAPSE (53//)
source: e
pl: Z

# MSG_BUTTON_LABEL_LINETYPES (54//)
source: Line type
pl: Linie

# MSG_LINETYPE_DISABLED (56//)
source: Disabled
pl: wył±czone

# MSG_LINETYPE_NORMAL (57//)
source: Normal
pl: normalne

# MSG_LINETYPE_DOTTED (58//)
source: Dotted
pl: kropkowane

# MSG_LINETYPE_SHADOW (59//)
source: Shadow
pl: cieniowane

# MSG_LINETYPE_GLOW (60//)
source: Glow
pl: z po¶wiat±

# MSG_HELP_LINETYPES (61//)
source: Select the line type used for drawing the individual levels in the listtree.
pl: Wybiera rodzaj linii używany do rysowania poszczególnych poziomów zagnieżddżenia drzewa.

# MSG_BUTTON_LABEL_FOLDER (62//)
source: Folder image
pl: Obrazek folderu

# MSG_WIN_TITLE_FOLDER_IMAGE (64//)
source: Adjust folder image
pl: Ustala folder obrazków

# MSG_HELP_FOLDER_IMAGE (65//)
source: An image displayed in front of every node containing subnodes.
pl: Obrazek wy¶wietlany przed każdym wêzłem zawieraj±cym podwêzły.

# MSG_BUTTON_LABEL_FOLDERIMAGE (66//)
source: Use folder image
pl: Używaj obrazka folderu

# MSG_BUTTON_SHORTCUT_FOLDERIMAGE (67//)
source: i
pl: o

# MSG_HELP_FOLDERIMAGE (68//)
source: Select if you want a folder image to appear in front of every node containing subnodes.
pl: Zaznacz tê opcjê, je¶li chcesz aby obrazek folderu był wy¶wietlany przed każdym wêzłem zawieraj±cym podwêzły.

# MSG_BUTTON_LABEL_INDENTWIDTH (69//)
source: Additional indent width
pl: Szeroko¶æ dodatkowego wciêcia

# MSG_HELP_INDENTWIDTH (71//)
source: Specify an additional indent width applied to each subnode.
pl: Okre¶la dodatkowe wciêcie dla każdego podwêzła.

# MSG_BUTTON_LABEL_GLOW (72//)
source: Glow color
pl: Kolor po¶wiaty

# MSG_BUTTON_SHORTCUT_GLOW (73//)
source: g
pl: k

# MSG_WIN_TITLE_GLOW_COLOR (74//)
source: Set glow line color
pl: Ustaw koloro po¶wiaty linii

# MSG_HELP_GLOW_COLOR (75//)
source: Allows to set the color for the glow line type
pl: Pozwala na ustawienie koloru po¶wiaty linii.
