Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlisttree_mcp/locale/swedish.po
Languages: sv

# MSG_GROUP_IMAGES_COLORS (2//)
source: Images/Colors
sv: Bilder/färger

# MSG_BUTTON_LABEL_CLOSED (3//)
source: Closed
sv: Stängd

# MSG_HELP_CLOSED_IMAGE (5//)
source: Image to use for closed nodes.
sv: Bild att använda för stängda noder.

# MSG_WIN_TITLE_CLOSED_IMAGE (6//)
source: Adjust image for closed nodes
sv: Justera bild för stängda noder

# MSG_BUTTON_LABEL_LINES (7//)
source: Lines
sv: Linjer

# MSG_HELP_LINES_COLOR (9//)
source: Color to use for lines.
sv: Färg att använda för linjer.

# MSG_WIN_TITLE_LINES_COLOR (10//)
source: Adjust lines color
sv: Justera linje färg

# MSG_BUTTON_LABEL_OPEN (11//)
source: Open
sv: Öppen

# MSG_HELP_OPEN_IMAGE (13//)
source: Image to use for open nodes.
sv: Bild att använda för öppna noder.

# MSG_WIN_TITLE_OPEN_IMAGE (14//)
source: Adjust image for open nodes
sv: Justera bild för öppna noder

# MSG_BUTTON_LABEL_SHADOW (15//)
source: Shadow
sv: Skugga

# MSG_HELP_SHADOW_COLOR (17//)
source: Color to use to cast shadows after lines.
sv: Färg att använda för att kasta skugga efter linjer.

# MSG_WIN_TITLE_SHADOW_COLOR (18//)
source: Adjust shadow color
sv: Justera skugg färg

# MSG_HELP_SPECIAL_IMAGE (21//)
source: A special image to be displayed after every node.
sv: En speciell bild att visa efter varje nod.

# MSG_WIN_TITLE_SPECIAL_IMAGE (22//)
source: Adjust special image
sv: Justera special bild

# MSG_BUTTON_LABEL_DRAW (23//)
source: Draw
sv: Rita

# MSG_HELP_DRAW_COLOR (25//)
source: A draw color to be combined with the lines color.
sv: En rit färg att kombinera med linje färgen.

# MSG_WIN_TITLE_DRAW_COLOR (26//)
source: Adjust draw color
sv: Justera rit färg

# MSG_GROUP_STYLE (27//)
source: Style
sv: Stil

# MSG_CYCLE_LABEL_STYLE (28//)
source: Style
sv: Stil

# MSG_HELP_STYLE (30//)
source: Select here the global style of the tree. Depending on your choice, some of the options above may become (un)available.
sv: Välj här global stil för trädet. Beroende på ditt val, så kan vissa av alternativen ovan bli otillgängliga.

# MSG_CYCLE_ITEM_STYLE_INSERTED (32//)
source: Inserted
sv: Inmatad

# MSG_CYCLE_ITEM_STYLE_LINES (33//)
source: Lines
sv: Linjer

# MSG_CYCLE_ITEM_STYLE_LINES3D (36//)
source: Lines 3D
sv: Linjer 3D

# MSG_CYCLE_ITEM_STYLE_GLOW (38//)
source: Glow
sv: Glöd

# MSG_BUTTON_LABEL_SPACE (39//)
source: Spacing
sv: Mellanrum

# MSG_HELP_SPACE (41//)
source: The more spacing, the wider the listtree will be.
sv: Ju mer mellanrum, desto vidare blir listträdet.

# MSG_BUTTON_LABEL_REMEMBER (42//)
source: Remember status?
sv: Kom ihåg status?

# MSG_HELP_REMEMBER (44//)
source: If enabled, the open/closed status of nodes will be 'remembered' after the listtree is closed the next time it is opened again. Please note, however, that an application can override your choice here.
sv: Om vald, kommer öppen/stängd statusen för noder att 'kommas-ihåg' efter att listträdet stängs nästa gång det öppnas igen. Var god notera att, en applikation kan åsidosätta ditt val här.

# MSG_BUTTON_LABEL_AUTOSCROLL (45//)
source: Autoscroll?
sv: Autorulla?

# MSG_HELP_AUTOSCROLL (47//)
source: If enabled, the listview will auto-scroll its contents when opening nodes to try and fit the visible area.
sv: Om vald, kommer listvyn att autorulla dess innehåll vid öppning av noder för att försöka passa i det synliga området.

# MSG_TAB_EXAMPLE (48//)
source: Example
sv: Exempel

# MSG_HELP_LISTVIEW_EXAMPLE (49//)
source: This NListtree object reacts in real time to the changes you apply under the 'Layout' tab. Give it a try! :)
sv: Detta NListtree objekt, reagerar i realtid till ändringarna som du gör under 'Layout' fliken. Pröva så får du se! :)

# MSG_BUTTON_LABEL_EXPAND (50//)
source: Expand
sv: Expandera

# MSG_BUTTON_LABEL_COLLAPSE (52//)
source: Collapse
sv: Kollapsa

# MSG_BUTTON_LABEL_LINETYPES (54//)
source: Line type
sv: Linjetyp

# MSG_LINETYPE_DISABLED (56//)
source: Disabled
sv: Inaktiverad

# MSG_LINETYPE_DOTTED (58//)
source: Dotted
sv: Prickad

# MSG_LINETYPE_SHADOW (59//)
source: Shadow
sv: Skugga

# MSG_LINETYPE_GLOW (60//)
source: Glow
sv: Glöd

# MSG_HELP_LINETYPES (61//)
source: Select the line type used for drawing the individual levels in the listtree.
sv: Välj linjetyp att användas för att rita individuella nivåer i listträdet.

# MSG_BUTTON_LABEL_FOLDER (62//)
source: Folder image
sv: Mapp bild

# MSG_WIN_TITLE_FOLDER_IMAGE (64//)
source: Adjust folder image
sv: Justera mapp bild

# MSG_HELP_FOLDER_IMAGE (65//)
source: An image displayed in front of every node containing subnodes.
sv: En bild som visas framför varje nod som innehåller en undernod.

# MSG_BUTTON_LABEL_FOLDERIMAGE (66//)
source: Use folder image
sv: Använd mapp bild

# MSG_HELP_FOLDERIMAGE (68//)
source: Select if you want a folder image to appear in front of every node containing subnodes.
sv: Välj om du vill att en mapp bild syns framför varje nod som innehåller undernoder.

# MSG_BUTTON_LABEL_INDENTWIDTH (69//)
source: Additional indent width
sv: Extra indragsbredd

# MSG_HELP_INDENTWIDTH (71//)
source: Specify an additional indent width applied to each subnode.
sv: Specifiera en extra indragsbredd att applicera på varje undernod.

# MSG_BUTTON_LABEL_GLOW (72//)
source: Glow color
sv: Glöd färg

# MSG_WIN_TITLE_GLOW_COLOR (74//)
source: Set glow line color
sv: Sätt glödlinjefärg

# MSG_HELP_GLOW_COLOR (75//)
source: Allows to set the color for the glow line type
sv: Tillåter att sätta färgen för glödlinjer
