Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlisttree_mcp/locale/turkish.po
Languages: tr

# MSG_TAB_LAYOUT (1//)
source: Layout
tr: Dizilim

# MSG_GROUP_IMAGES_COLORS (2//)
source: Images/Colors
tr: Simgeler/Renkler

# MSG_BUTTON_LABEL_CLOSED (3//)
source: Closed
tr: Kapalı

# MSG_BUTTON_SHORTCUT_CLOSED (4//)
source: c
tr: k

# MSG_HELP_CLOSED_IMAGE (5//)
source: Image to use for closed nodes.
tr: Kapalı çizgeler için kullanılacak simge.

# MSG_WIN_TITLE_CLOSED_IMAGE (6//)
source: Adjust image for closed nodes
tr: Kapalı çizgeler için kullanılacak simgeyi belirleyin.

# MSG_BUTTON_LABEL_LINES (7//)
source: Lines
tr: Çizgiler

# MSG_BUTTON_SHORTCUT_LINES (8//)
source: l
tr: ç

# MSG_HELP_LINES_COLOR (9//)
source: Color to use for lines.
tr: Çizgiler için kullanılacak renk.

# MSG_WIN_TITLE_LINES_COLOR (10//)
source: Adjust lines color
tr: Çizgi rengini belirleyin

# MSG_BUTTON_LABEL_OPEN (11//)
source: Open
tr: Açık

# MSG_BUTTON_SHORTCUT_OPEN (12//)
source: o
tr: a

# MSG_HELP_OPEN_IMAGE (13//)
source: Image to use for open nodes.
tr: Açık çizgeler için kullanılacak simge.

# MSG_WIN_TITLE_OPEN_IMAGE (14//)
source: Adjust image for open nodes
tr: Açık çizgeler için kullanılacak simgeyi seçin

# MSG_BUTTON_LABEL_SHADOW (15//)
source: Shadow
tr: Gölge

# MSG_BUTTON_SHORTCUT_SHADOW (16//)
source: w
tr: g

# MSG_HELP_SHADOW_COLOR (17//)
source: Color to use to cast shadows after lines.
tr: Çizgilerin düşüreceği gölge için kullanılacak renk.

# MSG_WIN_TITLE_SHADOW_COLOR (18//)
source: Adjust shadow color
tr: Gölge rengini belirleyin

# MSG_BUTTON_LABEL_SPECIAL (19//)
source: Special
tr: Özel

# MSG_BUTTON_SHORTCUT_SPECIAL (20//)
source: i
tr: ö

# MSG_HELP_SPECIAL_IMAGE (21//)
source: A special image to be displayed after every node.
tr: Her çizgeden sonra görüntülenecek özel bir simge.

# MSG_WIN_TITLE_SPECIAL_IMAGE (22//)
source: Adjust special image
tr: Özel simgeyi seçin

# MSG_BUTTON_LABEL_DRAW (23//)
source: Draw
tr: Boya

# MSG_BUTTON_SHORTCUT_DRAW (24//)
source: d
tr: b

# MSG_HELP_DRAW_COLOR (25//)
source: A draw color to be combined with the lines color.
tr: Çizgi rengi ile birlikte kullanılacak boyama rengi.

# MSG_WIN_TITLE_DRAW_COLOR (26//)
source: Adjust draw color
tr: Boyama rengini seçin

# MSG_GROUP_STYLE (27//)
source: Style
tr: Biçem

# MSG_CYCLE_LABEL_STYLE (28//)
source: Style
tr: Biçem

# MSG_CYCLE_SHORTCUT_STYLE (29//)
source: s
tr: i

# MSG_HELP_STYLE (30//)
source: Select here the global style of the tree. Depending on your choice, some of the options above may become (un)available.
tr: Ağaç görünümünün genel biçemini seçin Seçiminize bağlı olarak, yukarıdaki bazı seçenekler devre dışı kalabilir.

# MSG_CYCLE_ITEM_STYLE_INSERTED (32//)
source: Inserted
tr: Girinti

# MSG_CYCLE_ITEM_STYLE_LINES (33//)
source: Lines
tr: Çizgiler

# MSG_CYCLE_ITEM_STYLE_LINES3D (36//)
source: Lines 3D
tr: 3B Çizgiler

# MSG_CYCLE_ITEM_STYLE_GLOW (38//)
source: Glow
tr: Parıltılı

# MSG_BUTTON_LABEL_SPACE (39//)
source: Spacing
tr: Boşluklar

# MSG_BUTTON_SHORTCUT_SPACE (40//)
source: p
tr: ş

# MSG_HELP_SPACE (41//)
source: The more spacing, the wider the listtree will be.
tr: Daha fazla boşluklama ile ağaç görünümü daha büyük görüntülenir.

# MSG_BUTTON_LABEL_REMEMBER (42//)
source: Remember status?
tr: Durumu anımsa?

# MSG_BUTTON_SHORTCUT_REMEMBER (43//)
source: r
tr: d

# MSG_HELP_REMEMBER (44//)
source: If enabled, the open/closed status of nodes will be 'remembered' after the listtree is closed the next time it is opened again. Please note, however, that an application can override your choice here.
tr: Etkinleştirilirse, çizgelerin açık/kapalı durumları listeağacı kapatıldıktan sonra hafızada tutulacaktır. Lütfen unutmayınız ki, uygulamalar bu seçiminizi yoksayabilir.

# MSG_BUTTON_LABEL_AUTOSCROLL (45//)
source: Autoscroll?
tr: Otomatik kaydırma?

# MSG_BUTTON_SHORTCUT_AUTOSCROLL (46//)
source: a
tr: o

# MSG_HELP_AUTOSCROLL (47//)
source: If enabled, the listview will auto-scroll its contents when opening nodes to try and fit the visible area.
tr: Etkinleştirildiğinde, çizgeler açılırken görünür alana göre içerik kaydırılacaktır.

# MSG_TAB_EXAMPLE (48//)
source: Example
tr: Örnek

# MSG_HELP_LISTVIEW_EXAMPLE (49//)
source: This NListtree object reacts in real time to the changes you apply under the 'Layout' tab. Give it a try! :)
tr: Bu NListtree nesnesi 'Dizilim' sayfasında yaptığınız seçimlere ayak uyduracaktır. Lütfen deneyin! :)

# MSG_BUTTON_LABEL_EXPAND (50//)
source: Expand
tr: Tümünü Aç

# MSG_BUTTON_SHORTCUT_EXPAND (51//)
source: n
tr: a

# MSG_BUTTON_LABEL_COLLAPSE (52//)
source: Collapse
tr: Tümünü Kapat

# MSG_BUTTON_SHORTCUT_COLLAPSE (53//)
source: e
tr: k
