Repository: aros-development-team/AROS
Catalog: tools/flexcat/src/locale/*.po
Languages: french, german, spanish

# MSG_USAGE_HEAD (0//)
source: Usage:
french: Utilisation :
german: Benutzung:
spanish: Plantilla:

# MSG_USAGE (1//)
source: CDFILE Catalog description file to scan CTFILE Catalog translation file to scan POFILE Catalog translation in PO-style format CATALOG Catalog file to create NEWCTFILE Catalog translation file to create SOURCES Sources to create; must be something like SFILE=SDFILE, where SFILE is a source file and SDFILE is a source description file WARNCTGAPS Warn about identifiers missing in translation NOOPTIM Do not skip unchanged strings in translation/description FILL Fill missing identifiers with original text FLUSH Flush memory after the catalog is created NOBEEP No DisplayBeep() on errors and warnings QUIET No warnings NOLANGTOLOWER Prevent #language name from being lowercased NOBUFFEREDIO Disable I/O buffers MODIFIED Create catalog only if description/translation have changed COPYMSGNEW Copy ***NEW*** markers over from old translation OLDMSGNEW Custom marker in old translation CODESET Codeset to force in output file (e.g. 'UTF-8') VERSION Force a certain version to be used during catalog generation REVISION Force a certain revision to be used during catalog generation NOAUTODATE no operation - kept for compatibility NOSPACES no operation - kept for compatibility
french: CDFILE Fichier de description de catalogue à traiter CTFILE Fichier de traduction de catalogue à traiter POFILE Traduction de catalogue au format PO CATALOG Catalogue à créer NEWCTFILE Fichier de traduction de catalogue à créer SOURCES Sources à créer ; doit être sous la forme SFILE=SDFILE, où SFILE est un fichier source, et SDFILE est un fichier de description de source WARNCTGAPS Alerte en cas d'identifiant absent de la traduction (CT) NOOPTIM Ne pas ignorer les chaînes non-modifiées dans la traduction ou la description FILL Remplace les identifiants vides par le texte original FLUSH Libére la mémoire après la création du catalogue NOBEEP N'émet pas d'alerte visuelle DisplayBeep() en cas d'erreur ou d'alerte QUIET N'affiche pas les alertes NOLANGTOLOWER Ne convertit pas le nom de langue en minuscule NOBUFFEREDIO Désactive les caches d'entrée-sortie MODIFIED Ne crée un catalogue que si la description ou la traduction a changé COPYMSGNEW Ajoute les ***nouveaux*** marqueurs à l'ancienne traduction OLDMSGNEW Identifie les marqueurs de l'ancienne traduction CODESET Jeu de caractères à utiliser dans le fichier de sortie (p.ex. « UTF-8 ») VERSION Numéro de version à renseigner lors de la génération du catalogue REVISION Numéro de révision à renseigner lors de la génération du catalogue NOAUTODATE inactif - conservé pour la compatibilité ascendante NOSPACES inactif - conservé pour la compatibilité ascendante

# MSG_FILEUPTODATE (2//)
source: File '%s' is up to date
french: Le fichier « %s » est mis à jour.
german: Datei '%s' ist auf dem neusten Stand
spanish: El fichero '%s' está al día.

# MSG_ERR_WARNING (100//)
source: %s, line %d - warning:
french: %s, Ligne %d - ATTENTION :
german: %s, Zeile %d - Warnung:
spanish: %s, línea %d - aviso:

# MSG_ERR_ERROR (101//)
source: %s, line %d - ERROR:
french: %s, Ligne %d - ERREUR :
german: %s, Zeile %d - FEHLER:
spanish: %s, línea %d - ERROR:

# MSG_ERR_EXPECTEDHEX (102//)
source: expected hex character (one of [0-9a-fA-F])
french: Caractère hexadécimal attendu (parmi [0-9a-fA-F]).
german: Hex-Zeichen (eines von [0-9a-fA-F]) erwartet
spanish: se esperaba un carácter hexadecimal ([0-9a-fA-F])

# MSG_ERR_EXPECTEDOCTAL (103//)
source: expected octal character (one of [0-7])
french: Caractère octal attendu (parmi [0-7]).
german: Oktal-Zeichen (eines von [0-7]) erwartet
spanish: se esperaba un carácter octal ([0-7])

# MSG_ERR_NOLENGTHBYTES (104//)
source: lengthbytes cannot be larger than %d (sizeof long)
french: Longueur (octets) ne peut être plus large que %d (taille d'un long)
german: LengthBytes > %d (Größe einer 32-Bit-Integer) nicht möglich
spanish: lengthbytes no puede ser más de %d (sizeof long)

# MSG_ERR_UNKNOWNCDCOMMAND (105//)
source: unknown catalog description command
french: Commande de description de catalogue inconnue.
german: unbekanntes Katalogbeschreibungskommando
spanish: comando desconocido en fichero de descripción

# MSG_ERR_UNEXPECTEDBLANKS (106//)
source: unexpected blanks
french: Espacements inattendus.
german: Leerzeichen nicht erwartet
spanish: espacios en blanco inesperados

# MSG_ERR_NOIDENTIFIER (107//)
source: missing identifier
french: Identificateur absent.
german: Bezeichner erwartet
spanish: falta el identificador

# MSG_ERR_MISSINGSTRING (115//)
source: unexpected end of file (missing catalog strings)
french: Fin de fichier inattendue (chaîne de catalogue manquante).
german: unerwartetes Dateiende (fehlender Katalogstring)
spanish: fin inesperado del fichero (faltan cadenas)

# MSG_ERR_UNKNOWNCTCOMMAND (118//)
source: unknown command in translation
french: Commande inconnue dans la traduction.
german: unbekanntes Katalogübersetzungskommando
spanish: comando desconocido en la traducción

# MSG_ERR_UNKNOWNIDENTIFIER (119//)
source: '%s' missing in catalog description
french: « %s » absent de la description du catalogue.
german: %s fehlt in Katalogbeschreibung
spanish: '%s' no figura en la descripción

# MSG_ERR_UNKNOWNSTRINGTYPE (120//)
source: unknown string type
french: Type de chaîne inconnu.
german: unbekannter Stringtyp
spanish: tipo desconocido de cadena

# MSG_ERR_NOTERMINATEBRACKET (121//)
source: unexpected end of line (missing ')')
french: Fin de ligne inattendue (manque ')').
german: unerwartetes Zeilenende (')' fehlt)
spanish: fin inesperado de la línea (falta ')')

# MSG_ERR_NOBINCHARS (122//)
source: binary characters in string type None
french: Aucun caractère binaire dans un type chaîne.
german: Binärzeichen beim Stringtyp None nicht erlaubt
spanish: caracteres binarios en tipo nulo de cadena

# MSG_ERR_CTGAP (123//)
source: '%s' missing in catalog translation
french: « %s » absent du fichier de traduction
german: Bezeichner '%s' fehlt in der Katalogübersetzung
spanish: '%s' no figura en la traducción

# MSG_ERR_DOUBLECTLANGUAGE (124//)
source: catalog language declared twice
french: Langue du catalogue déclarée deux fois.
german: Katalogsprache mehrfach deklariert
spanish: comando '## language' duplicado

# MSG_ERR_DOUBLECTVERSION (125//)
source: catalog version declared twice
french: Version du catalogue déclarée deux fois.
german: Katalogversion mehrfach deklariert
spanish: comando '## version' duplicado

# MSG_ERR_WRONGRCSID (126//)
source: incorrect RCS Id
french: Identifiant RCS incorrect
german: inkorrekte RCS ID
spanish: identificador RCS no válido

# MSG_ERR_NOMEMORY (127//)
source: out of memory!
french: Mémoire insuffisante !
german: zu wenig Speicher!
spanish: ¡No queda memoria!

# MSG_ERR_NOCATALOGDESCRIPTION (128//)
source: cannot open catalog description '%s'
french: Impossible d'ouvrir le fichier de description « %s ».
german: kann Katalogbeschreibung '%s' nicht öffnen
spanish: No se puede abrir el fichero de descripción '%s'.

# MSG_ERR_NOCATALOGTRANSLATION (129//)
source: cannot open catalog translation '%s'
french: Impossible d'ouvrir le fichier de traduction « %s ».
german: kann Katalogübersetzung '%s' nicht öffnen
spanish: No se puede abrir el fichero de traducción '%s'.

# MSG_ERR_NOCTVERSION (130//)
source: missing catalog translation version Use either '## version' or '## rcsid' and '## name'
french: Version absente du fichier de traduction. Utilisez « ## version » ou « ## rcsid » et « ## name ».
german: Versionsangabe fehlt in der Katalogübersetzung Es sollte entweder ##version oder ##rcsid und ##name benutzt werden
spanish: Falta el indicador de versión en la traducción. Utilice '## version', o bien '## rcsid' y '## name'.

# MSG_ERR_NOCATALOG (131//)
source: cannot open catalog file '%s'
french: Impossible d'ouvrir le catalogue « %s »
german: kann Katalog '%s' nicht erzeugen
spanish: No se puede abrir el catálogo '%s'.

# MSG_ERR_NONEWCTFILE (132//)
source: cannot create catalog translation '%s'
french: Impossible de créer le ficher de traduction « %s »
german: kann Katalogübersetzung '%s' nicht erzeugen
spanish: No se puede crear la traducción '%s'.

# MSG_ERR_NOCTLANGUAGE (133//)
source: missing catalog translation language
french: Marqueur de langue absent du fichier de traduction.
german: Sprachangabe fehlt in der Katalogübersetzung
spanish: Falta el indicador de idioma en la traducción.

# MSG_ERR_NOSOURCE (134//)
source: cannot open source file '%s'
french: Impossible d'ouvrir le fichier source « %s »
german: kann Quelltext '%s' nicht erzeugen
spanish: No se puede abrir la fuente '%s'.

# MSG_ERR_NOSOURCEDESCRIPTION (135//)
source: cannot open source description file '%s'
french: Impossible d'ouvrir le fichier de description source « %s »
german: kann Quelltextbeschreibung '%s' nicht öffnen
spanish: No se puede abrir la descripción de fuente '%s'.

# MSG_ERR_NOCTARGUMENT (136//)
source: creating a catalog requires a translation file
french: Créer un catalogue nécessite un fichier de traduction.
german: zur Erzeugung eines Katalogs wird eine Katalogübersetzung benötigt
spanish: Se necesita una traducción para crear un catálogo.

# MSG_ERR_CANTCHECKDATE (137//)
source: cannot get datestamp of '%s'
french: Impossible d'obtenir une date pour « %s »
german: kann das Datum von '%s' nicht lesen
spanish: No se puede averiguar la fecha de última modificación de '%s'.

# MSG_ERR_NOCTFILENAME (140//)
source: Catalog translation file name not specified at command line or as basename in description
french: Le nom du fichier de traduction non spécifié sur la ligne de commande ou comme nom de base dans la description
german: keine Katalogübersetzung in der Kommandozeile angegeben oder als Basisname der Beschreibung
spanish: No se ha indicado un fichero de traducción ni tampoco puede encontrarse en el comando '#basename' de la descripción.

# MSG_ERR_NOCATFILENAME (141//)
source: catalog file name not specified at command line or as basename in description
french: Le nom du fichier catalogue non spécifié sur la ligne de commande ou comme nom de base dans la description
german: kein Katalogname in der Kommandozeile angegeben oder als Basisname der Beschreibung
spanish: No se ha indicado un catálogo ni tampoco puede encontrarse en el comando '#basename' de la descripción.

# MSG_ERR_BADPREFS (142//)
source: error processing 'FlexCat.prefs' variable, falling back to defaults Template:
french: Erreur en traitant la variable « FlexCat.prefs ». Les valeurs par défaut seront utilisées. Modèle de préférences :
german: Fehler beim Bearbeiten der FlexCat.prefs Variable, Standardwerte werden benutzt Muster:
spanish: Error al interpretar la variable 'FlexCat.prefs', usando valores por omisión... Plantilla:

# MSG_ERR_BADCTLANGUAGE (144//)
source: invalid language in catalog translation file Language MUST be a string with alphabetical characters and no inlined or trailing spaces
french: Langue invalide dans le fichier de traduction. La langue doit être une suite de caractères alphabétiques sans chiffre et sans espace.
german: ungültige Sprachangabe in der Katalogübersetzungsdatei Die Sprachangabe MUSS eine Zeichenkette ohne Leerzeichen in der Mitte oder am Ende sein
spanish: '##language <cadena>' no válido en traducción, solo permite a..z|A..Z (excluyendo ñ|Ñ).

# MSG_ERR_DOUBLECTCODESET (146//)
source: catalog codeset declared twice
french: Jeu de caractères (codeset) de catalogue déclaré deux fois
german: Katalogcodeset doppelt deklariert
spanish: '##codeset <número>' duplicado

# MSG_ERR_BADCTCODESET (147//)
source: invalid codeset in catalog translation file Codeset MUST be a decimal number without any trailing spaces
french: Jeu de caractères invalide dans le fichier de traduction. CODESET doit être un nombre décimal sans aucune suite d'espaces
german: ungültiger Codeset in der Katalogübersetzungsdatei Der Codeset MUSS eine Dezimalzahl sein und darf keine Leerzeichen am Ende haben
spanish: '##codeset <número>' no válido en la traducción. El valor de 'codeset' ha de ser numérico (sin espacios).

# MSG_ERR_NOCTCODESET (148//)
source: missing catalog translation codeset
french: Jeu de caractères absent du fichier de traduction
german: fehlender Codeset in der Katalogübersetzungsdatei
spanish: falta '##codeset <número>' en la traducción

# MSG_ERR_ERROR_QUICK (149//)
source: %s - ERROR:
french: %s - ERREUR :
german: %s - FEHLER:

# MSG_ERR_BADCTVERSION (150//)
source: invalid version string in catalog translation file Version should be something like ## version $VER: name version.revision (date) without any spaces in the name
french: Version dans le fichier de traduction invalide. Version doit être sous la forme ## version $VER: name version.revision (date) sans aucun espace dans le nom
german: ungültiger Versionsstring in der Katalogübersetzungsdatei Die Version sollte folgendermaßen aussehen ## version $VER: name version.revision (datum) ohne Leerzeichen im Namen
spanish: cadena de versión en la traducción no válida. El formato de la cadena de versión debe ser: ##version $VER: nombre.catalog versión.revisión (fecha) sin espacios en el 'nombre.catalog'.

# MSG_ERR_WARNING_QUICK (154//)
source: %s - Warning:
french: %s - Attention :
german: %s - Warnung:
spanish: %s - Aviso:

# MSG_ERR_MISSINGTRANSLATION (155//)
source: missing translation for identifier '%s'
french: traduction manquante pour l'identifiant « %s »
german: fehlende Übersetzung für Bezeichner '%s'
spanish: falta traducción en '%s'

# MSG_ERR_EMPTYTRANSLATION (156//)
source: empty translation for identifier '%s'
french: traduction vide pour l'identifiant « %s »
german: leere Übersetzung für Bezeichner '%s'
spanish: '%s' sin traducir (vacío)

# MSG_ERR_MISMATCHINGCONTROLCHARACTERS (157//)
source: mismatching trailing control characters
french: problèmes sur les caractères de contrôle
german: unterschiedliche Kontrollzeichen am Zeilenende
spanish: caracteres de control incorrectos

# MSG_ERR_DOUBLE_IDENTIFIER (159//)
source: identifier '%s' declared twice
french: identifiant « %s » déclaré deux fois
german: Bezeichner kommt zweimal vor für Bezeichner '%s'
spanish: '%s' duplicado

# MSG_ERR_STRING_TOO_SHORT (160//)
source: string too short for identifier '%s'
french: chaîne trop courte pour l'identifiant « %s »
german: String kürzer als in Katalogbeschreibung erlaubt für Bezeichner '%s'
spanish: cadena en '%s' demasiado corta

# MSG_ERR_STRING_TOO_LONG (161//)
source: string too long for identifier '%s'
french: chaîne trop longue pour l'identifiant « %s »
german: String länger als in Katalogbeschreibung erlaubtfür Bezeichner '%s'
spanish: cadena en '%s' demasiado larga

# MSG_ERR_TRAILING_ELLIPSIS (162//)
source: original string has a trailing ellipsis ('...') for identifier '%s'
french: la chaîne originale se termine par des points de suspension (« ... ») pour l'identifiant « %s »
german: Originalstring hat eine Ellipse (...) am Zeilenende für Bezeichner '%s'
spanish: cadena original '%s' tiene puntos suspensivos ('...')

# MSG_ERR_NO_TRAILING_ELLIPSIS (163//)
source: original string doesn't have a trailing ellipsis ('...') for identifier '%s'
french: la chaîne originale ne se termine pas par des points de suspension (« ... ») pour l'identifiant « %s »
german: Originalstring hat keine Ellipse (...) am Zeilenende für Bezeichner '%s'
spanish: cadena original '%s' no tiene puntos suspensivos ('...')

# MSG_ERR_TRAILING_BLANKS (164//)
source: original string has trailing blanks for identifier '%s'
french: la chaîne originale a un espace final pour l'identifiant « %s »
german: Originalstring hat Leerzeichen am Zeilenende für Bezeichner '%s'
spanish: cadena original tiene espacios en blanco en '%s'

# MSG_ERR_NO_TRAILING_BLANKS (165//)
source: original string doesn't have trailing blanks for identifier '%s'
french: la chaîne originale n'a pas d'espace finale pour l'identifiant « %s »
german: Originalstring hat keine Leerzeichen am Zeilenende für Bezeichner '%s'
spanish: cadena original no tiene espacios en blanco en '%s'

# MSG_ERR_MISMATCHING_PLACEHOLDERS (166//)
source: mismatching placeholders for identifier '%s'
french: les jokers ne correspondent pas pour l'identifiant « %s »
german: unterschiedliche Platzhalter bei Bezeichner '%s'
spanish: variable incorrecta en '%s'

# MSG_ERR_MISSING_PLACEHOLDERS (167//)
source: missing placeholders for identifier '%s'
french: jokers manquants pour l'identifiant « %s »
german: fehlende Platzhalter bei Bezeichner '%s'
spanish: faltan variables en '%s'

# MSG_ERR_EXCESSIVE_PLACEHOLDERS (168//)
source: excessive placeholders for identifier '%s'
french: trop de jokers pour l'identifiant « %s »
german: überzählige Platzhalter bei Bezeichner '%s'
spanish: demasiadas variables en '%s'

# MSG_ERR_NO_LEADING_BRACKET (169//)
source: missing '(' for identifier '%s'
french: parenthèse ouvrante « ( » manquante pour l'identifiant « %s »
german: '(' erwartet für Bezeichner '%s'
spanish: falta '(' en '%s'

# MSG_ERR_NO_TRAILING_BRACKET (170//)
source: missing ')' for identifier '%s'
french: parenthèse fermante « ) » manquante pour l'identifiant « %s »
german: ')' erwartet für Bezeichner '%s'
spanish: falta ')' en '%s'

# MSG_ERR_DOUBLE_ID (171//)
source: ID number used twice for identifier '%s'
french: numéro d'identifiant utilisé deux fois pour l'identifiant « %s »
german: Bezeichnernummer kommt zweimal vor für Bezeichner '%s'
spanish: ID duplicado '(<ID>//)' en '%s'

# MSG_ERR_NO_MIN_LEN (172//)
source: expected MinLen (character '/') for identifier '%s'
french: longueur minimale attendue (caractère « / ») pour l'identifiant « %s »
german: MinLen (Zeichen '/') erwartet für Bezeichner '%s'
spanish: esperado valor en '(/<MINLEN>/)' en '%s'

# MSG_ERR_NO_MAX_LEN (173//)
source: expected MaxLen (character '/') for identifier '%s'
french: longueur maximale attendue (caractère « / ») pour l'identifiant « %s »
german: MaxLen (Zeichen '/') erwartet für Bezeichner '%s'
spanish: esperado valor en '(//<MAXLEN>)' '%s'

# MSG_ERR_EXTRA_CHARACTERS (174//)
source: extra characters at the end of the line
french: caractères trop nombreux à la fin de la ligne
german: zusätzliche Zeichen am Zeilenende
spanish: caracteres extra al final de la línea

# MSG_ERR_EXTRA_CHARACTERS_ID (175//)
source: extra characters at the end of the line for identifier '%s'
french: caractères trop nombreux à la fin de la ligne pour l'identifiant « %s »
german: zusätzliche Zeichen am Zeilenende bei Bezeichner '%s'
spanish: caracteres extra al final de la línea en '%s'

# MSG_ERR_NON_ASCII_CHARACTER (176//)
source: non-ASCII character 0x%02x found in original string for identifier '%s'
french: caractère non-ASCII 0x%02x trouvé dans la chaîne originale pour l'identifiant « %s »
german: nicht-ASCII-Zeichen 0x%02x im Originalstring für Bezeichner '%s' gefunden
spanish: carácter no ASCII (0x%02x) en cadena origen '%s'

# MSG_ERR_NO_CAT_REVISION (177//)
source: no catalog revision information found, using revision 0
french: aucune information de révision de catalogue trouvée, utilisation de la révision 0
german: keine Revisionsinformation gefunden, benutze Revision 0

# MSG_ERR_CONVERSION_FAILED (178//)
source: UTF8 conversion failed for identifier '%s'
french: La conversion UTF8 a échoué pour l'identifiant « %s »

# MSG_ERR_UNKNOWN_SOURCE_CHARSET (179//)
source: ERROR in CodesetsFind(): unknown source charset '%s'
french: ERREUR dans CodesetsFind() : jeu de caractères source « %s » inconnu

# MSG_ERR_UNKNOWN_DESTINATION_CHARSET (180//)
source: ERROR in CodesetsFind(): unknown destination charset '%s'
french: ERREUR dans CodesetsFind() : jeu de caractères cible « %s » inconnu

# MSG_ERR_INVALID_CHARS_FOUND (181//)
source: ERROR in CodesetsConvertStr(): %d invalid characters found
french: ERREUR dans CodesetsConvertStr() : %d caractères invalides trouvés

# MSG_ERR_ICONV_FAILED (182//)
source: ERROR in iconv(): %s
french: ERREUR dans iconv() : %s

# MSG_ERR_ICONV_OPEN_FAILED (183//)
source: ERROR in iconv_open(): %s
french: ERREUR dans iconv_open() : %s

# MSG_ERR_NO_CAT_VERSION (184//)
source: no catalog version information found, using version 0
french: Aucune information de version de catalogue trouvée, utilisation de la version 0

# MSG_USAGE (1//)
source: CDFILE Catalog description file to scan CTFILE Catalog translation file to scan POFILE Catalog translation in PO-style format CATALOG Catalog file to create NEWCTFILE Catalog translation file to create SOURCES Sources to create; must be something like SFILE=SDFILE, where SFILE is a source file and SDFILE is a source description file WARNCTGAPS Warn about identifiers missing in translation NOOPTIM Do not skip unchanged strings in translation/description FILL Fill missing identifiers with original text FLUSH Flush memory after the catalog is created NOBEEP No DisplayBeep() on errors and warnings QUIET No warnings NOLANGTOLOWER Prevent #language name from being lowercased NOBUFFEREDIO Disable I/O buffers MODIFIED Create catalog only if description/translation have changed COPYMSGNEW Copy ***NEW*** markers over from old translation OLDMSGNEW Custom marker in old translation CODESET Codeset to force in output file (e.g. 'UTF-8') NOAUTODATE no operation - kept for compatibility NOSPACES no operation - kept for compatibility
german: CDFILE Einzulesende Katalogbeschreibung CTFILE Einzulesende Katalogübersetzung POFILE Einzulesende Katalogübersetzung im PO-Format CATALOG Zu erzeugender Katalog NEWCTFILE Zu erzeugende Katalogübersetzung SOURCES Zu erzeugende Quelltexte; in der Form SFILE=SDFILE, wobei SFILE die zu erzeugende Quelltextdatei und SDFILE die zu verwendende Quelltextbeschreibung ist. WARNCTGAPS Bei fehlenden Bezeichnern in der Katalogübersetzung warnen NOOPTIM Unveränderte Texte in Übersetzung/Beschreibung nicht überspringen FILL Text aus #?.cd verwenden falls die Übersetzung fehlt FLUSH Katalog aus dem Speicher entfernen NOBEEP DisplayBeep() bei Warnungen und Fehlern unterdrücken QUIET Warnungen unterdrücken NOLANGTOLOWER Parameter bei #language nicht in Kleinschrift wandeln NOBUFFEREDIO IO Puffer nicht verwenden MODIFIED Katalog nur erzeugen wenn Übersetzung/Beschreibung geändert wurden COPYMSGNEW ***NEW*** Markierung beim Erneuern von #?.ct Dateien kopieren OLDMSGNEW Wenn die #?.ct Datei einen anderen Marker benutzt, diesen hier angeben CODESET Zeichenkodierung in der Ausgabedatei erzwingen (z.B. 'UTF-8') NOAUTODATE keine Funktion - nur zur Kompatibilität NOSPACES keine Funktion - nur zur Kompatibilität
spanish: CDFILE Descripción a comprobar CTFILE Traducción a comprobar POFILE Traducción en formato PO a comprobar CATALOG Catálogo a crear NEWCTFILE Nueva traducción a crear SOURCES Fuentes a generar; deberá ser algo como SFILE=SDFILE, donde SFILE es un fichero fuente y SDFILE un fichero de descripción de fuente WARNCTGAPS Avisar si faltan cadenas en la traducción NOOPTIM Incluir en el catálogo las cadenas que no han cambiado FILL Rellenar las cadenas que falten con los textos originales FLUSH Liberar memoria tras generar el catálogo NOBEEP No usar DisplayBeep() en los errores y avisos QUIET Suprimir avisos NOLANGTOLOWER Evitar que '#language <cadena>' se convierta a minúsculas NOBUFFEREDIO No usar bufers de E/S MODIFIED Crear catálogo sólo si descripción/traducción han cambiado COPYMSGNEW Copiar las marcas ***NEW*** de la antigua traducción OLDMSGNEW Marca utilizada en la antigua traducción CODESET Código de página a forzar en el fichero de salida (ej. 'UTF-8') NOAUTODATE sin validez; se mantiene por compatibilidad NOSPACES sin validez; se mantiene por compatibilidad
