Repository: aros-development-team/AROS
Catalog: tools/flexcat/src/locale/danish.po
Languages: da

# MSG_USAGE_HEAD (0//)
source: Usage:
da: Anvendelse

# MSG_FILEUPTODATE (2//)
source: File '%s' is up to date
da: Filen '%s' er aktuel

# MSG_ERR_WARNING (100//)
source: %s, line %d - warning:
da: %s, linje %d; advarsel:

# MSG_ERR_ERROR (101//)
source: %s, line %d - ERROR:
da: %s, linje %d - FEJL:

# MSG_ERR_EXPECTEDHEX (102//)
source: expected hex character (one of [0-9a-fA-F])
da: hexadecimalt ciffer forventet (et af [0-9a-fA-F])

# MSG_ERR_EXPECTEDOCTAL (103//)
source: expected octal character (one of [0-7])
da: oktalt ciffer forventet (et af [0-7])

# MSG_ERR_NOLENGTHBYTES (104//)
source: lengthbytes cannot be larger than %d (sizeof long)
da: lengthbytes > %d (sizeof long) ikke mulig

# MSG_ERR_UNKNOWNCDCOMMAND (105//)
source: unknown catalog description command
da: ukendt kommando i catalog-beskrivelsen

# MSG_ERR_UNEXPECTEDBLANKS (106//)
source: unexpected blanks
da: uventede blanktegn

# MSG_ERR_NOIDENTIFIER (107//)
source: missing identifier
da: identifikator mangler

# MSG_ERR_MISSINGSTRING (115//)
source: unexpected end of file (missing catalog strings)
da: uventet afslutning på filen (der mangler nogle catalog-strenge)

# MSG_ERR_UNKNOWNCTCOMMAND (118//)
source: unknown command in translation
da: ukendt kommando i oversættelsen

# MSG_ERR_UNKNOWNIDENTIFIER (119//)
source: '%s' missing in catalog description
da: '%s' mangler i catalog-beskrivelsen

# MSG_ERR_UNKNOWNSTRINGTYPE (120//)
source: unknown string type
da: ukendt strengtype

# MSG_ERR_NOTERMINATEBRACKET (121//)
source: unexpected end of line (missing ')')
da: uventet linjeslutning (mangler ')')

# MSG_ERR_NOBINCHARS (122//)
source: binary characters in string type None
da: binære tegn i strengtype 'None'

# MSG_ERR_CTGAP (123//)
source: '%s' missing in catalog translation
da: '%s' mangler i .ct-filen

# MSG_ERR_DOUBLECTLANGUAGE (124//)
source: catalog language declared twice
da: catalog-sprog angivet to gange ('language')

# MSG_ERR_DOUBLECTVERSION (125//)
source: catalog version declared twice
da: catalog-version angivet to gange ('version')

# MSG_ERR_WRONGRCSID (126//)
source: incorrect RCS Id
da: forkert RCS-ID

# MSG_ERR_NOMEMORY (127//)
source: out of memory!
da: løbet tør for hukommelse

# MSG_ERR_NOCATALOGDESCRIPTION (128//)
source: cannot open catalog description '%s'
da: fejl ved forsøg på åbning af catalog-beskrivelsesfilen '%s'

# MSG_ERR_NOCATALOGTRANSLATION (129//)
source: cannot open catalog translation '%s'
da: fejl ved forsøg på åbning af catalog-oversættelsesfilen '%s'

# MSG_ERR_NOCTVERSION (130//)
source: missing catalog translation version Use either '## version' or '## rcsid' and '## name'
da: mangler catalog-oversættelsesversion Anvend enten '## version' eller '## rcsid' og '## name'

# MSG_ERR_NOCATALOG (131//)
source: cannot open catalog file '%s'
da: fejl ved forsøg på åbning af catalog-filen '%s'

# MSG_ERR_NONEWCTFILE (132//)
source: cannot create catalog translation '%s'
da: fejl ved forsøg på at oprette catalog-oversættelsesfilen '%s'

# MSG_ERR_NOCTLANGUAGE (133//)
source: missing catalog translation language
da: mangler catalog-oversættelsessprog ('language')

# MSG_ERR_NOSOURCE (134//)
source: cannot open source file '%s'
da: fejl ved forsøg på åbning af sourcefilen '%s'

# MSG_ERR_NOSOURCEDESCRIPTION (135//)
source: cannot open source description file '%s'
da: fejl ved forsøg på åbning af source-beskrivelsesfilen '%s'

# MSG_ERR_NOCTARGUMENT (136//)
source: creating a catalog requires a translation file
da: oprettelse af et catalog kræver en catalog-oversættelsesfil

# MSG_ERR_CANTCHECKDATE (137//)
source: cannot get datestamp of '%s'
da: fejl ved forsøg på at hente fildatoen for '%s'

# MSG_ERR_NOCTFILENAME (140//)
source: Catalog translation file name not specified at command line or as basename in description
da: Catalog-oversættelsens filnavn blev ikke angivet på kommandolinjen eller som basisnavn i beskrivelsen

# MSG_ERR_NOCATFILENAME (141//)
source: catalog file name not specified at command line or as basename in description
da: Catalog-filens navn blev ikke angivet på kommandolinjen eller som basisnavn i beskrivelsen

# MSG_ERR_BADPREFS (142//)
source: error processing 'FlexCat.prefs' variable, falling back to defaults Template:
da: fejl ved forsøg på behandling af variablen 'FlexCat.prefs', falder tilbage til standardindstillingerne Skabelon:

# MSG_ERR_BADCTLANGUAGE (144//)
source: invalid language in catalog translation file Language MUST be a string with alphabetical characters and no inlined or trailing spaces
da: ugyldigt sprog ('language') i catalog-oversættelsesfilen Sproget SKAL være en streng kun med bogstaver og ingen indlejrede eller eftersillede blanktegn

# MSG_ERR_DOUBLECTCODESET (146//)
source: catalog codeset declared twice
da: catalog'ets kodesæt ('codeset') er defineret to gange

# MSG_ERR_BADCTCODESET (147//)
source: invalid codeset in catalog translation file Codeset MUST be a decimal number without any trailing spaces
da: ugyldigt kodesæt ('codeset') i catalog-oversættelsesfilen Kodesættet SKAL være et decimalt heltal uden efterstillede blanktegn

# MSG_ERR_NOCTCODESET (148//)
source: missing catalog translation codeset
da: mangler catalog-oversættelsens kodesæt ('codeset')

# MSG_ERR_ERROR_QUICK (149//)
source: %s - ERROR:
da: %s - FEJL:

# MSG_ERR_BADCTVERSION (150//)
source: invalid version string in catalog translation file Version should be something like ## version $VER: name version.revision (date) without any spaces in the name
da: ugylding versionsstreng i catalog-oversættelsesfilen Versionen skal være på formen ## version $VER: navn version.revision (dato) uden nogen blanktegn i navnet

# MSG_ERR_WARNING_QUICK (154//)
source: %s - Warning:
da: %s - Advarsel:

# MSG_ERR_MISSINGTRANSLATION (155//)
source: missing translation for identifier '%s'
da: mangler oversættelse for ID '%s'

# MSG_ERR_EMPTYTRANSLATION (156//)
source: empty translation for identifier '%s'
da: blank oversættelse for ID '%s'

# MSG_ERR_MISMATCHINGCONTROLCHARACTERS (157//)
source: mismatching trailing control characters
da: efterstillede styretegn stemmer ikke overens

# MSG_ERR_DOUBLE_IDENTIFIER (159//)
source: identifier '%s' declared twice
da: ID '%s' er erklæret to gange

# MSG_ERR_STRING_TOO_SHORT (160//)
source: string too short for identifier '%s'
da: strengen er for kort til ID '%s'

# MSG_ERR_STRING_TOO_LONG (161//)
source: string too long for identifier '%s'
da: strengen er for lang til ID '%s'

# MSG_ERR_TRAILING_ELLIPSIS (162//)
source: original string has a trailing ellipsis ('...') for identifier '%s'
da: den oprindelige streng for ID '%s' har en efterstillet ellipsis ('...')

# MSG_ERR_NO_TRAILING_ELLIPSIS (163//)
source: original string doesn't have a trailing ellipsis ('...') for identifier '%s'
da: den oprindelige streng for ID '%s' har ingen efterstillet ellipsis ('...')

# MSG_ERR_TRAILING_BLANKS (164//)
source: original string has trailing blanks for identifier '%s'
da: den oprindelige streng for ID '%s' har efterstillede blanktegn

# MSG_ERR_NO_TRAILING_BLANKS (165//)
source: original string doesn't have trailing blanks for identifier '%s'
da: den oprindelige streng for ID '%s' har ingen efterstillede blanktegn

# MSG_ERR_MISMATCHING_PLACEHOLDERS (166//)
source: mismatching placeholders for identifier '%s'
da: pladsholdere for ID '%s' stemmer ikke overens

# MSG_ERR_MISSING_PLACEHOLDERS (167//)
source: missing placeholders for identifier '%s'
da: mangler pladsholdere for ID '%s'

# MSG_ERR_EXCESSIVE_PLACEHOLDERS (168//)
source: excessive placeholders for identifier '%s'
da: for mange pladsholdere for ID '%s'

# MSG_ERR_NO_LEADING_BRACKET (169//)
source: missing '(' for identifier '%s'
da: mangler '(' for ID '%s'

# MSG_ERR_NO_TRAILING_BRACKET (170//)
source: missing ')' for identifier '%s'
da: mangler ')' for ID '%s'

# MSG_ERR_DOUBLE_ID (171//)
source: ID number used twice for identifier '%s'
da: ID'en '%s' er benyttet to gange

# MSG_ERR_NO_MIN_LEN (172//)
source: expected MinLen (character '/') for identifier '%s'
da: der forventedes en MinLen (tegnet '/') for ID '%s'

# MSG_ERR_NO_MAX_LEN (173//)
source: expected MaxLen (character '/') for identifier '%s'
da: der forventedes en MaxLen (tegnet '/') for ID '%s'

# MSG_ERR_EXTRA_CHARACTERS (174//)
source: extra characters at the end of the line
da: der var overskydende tegn ved linjens slutning

# MSG_ERR_EXTRA_CHARACTERS_ID (175//)
source: extra characters at the end of the line for identifier '%s'
da: der var overskydende tegn ved linjens slutning for ID '%s'

# MSG_ERR_NON_ASCII_CHARACTER (176//)
source: non-ASCII character 0x%02x found in original string for identifier '%s'
da: tegn uden for ASCII - 0x%02x - fundet i den oprindelige streng for ID '%s'

# MSG_ERR_NO_CAT_REVISION (177//)
source: no catalog revision information found, using revision 0
da: ingen catalog-revisionsoplysninger fundet, benytter revision 0

# MSG_ERR_CONVERSION_FAILED (178//)
source: UTF8 conversion failed for identifier '%s'
da: fejl under forsøg på UTF-8-konvertering af ID '%s'

# MSG_ERR_UNKNOWN_SOURCE_CHARSET (179//)
source: ERROR in CodesetsFind(): unknown source charset '%s'
da: FEJL i CodeSetsFind(): ukendt kilde-tegnsæt '%s'

# MSG_ERR_UNKNOWN_DESTINATION_CHARSET (180//)
source: ERROR in CodesetsFind(): unknown destination charset '%s'
da: FEJL i CodeSetsFind(): ukendt mål-tegnsæt '%s'

# MSG_ERR_INVALID_CHARS_FOUND (181//)
source: ERROR in CodesetsConvertStr(): %d invalid characters found
da: FEJL i CodeSetsConvertStr(): %d ugyldige tegn fundet

# MSG_ERR_ICONV_FAILED (182//)
source: ERROR in iconv(): %s
da: FEJL i iconv(): %s

# MSG_ERR_ICONV_OPEN_FAILED (183//)
source: ERROR in iconv_open(): %s
da: FEJL i iconv_open(): %s
