Repository: aros-development-team/AROS
Catalog: tools/flexcat/src/locale/finnish.po
Languages: fi

# MSG_USAGE_HEAD (0//)
source: Usage:
fi: Käyttö

# MSG_USAGE (1//)
source: CDFILE Catalog description file to scan CTFILE Catalog translation file to scan POFILE Catalog translation in PO-style format CATALOG Catalog file to create NEWCTFILE Catalog translation file to create SOURCES Sources to create; must be something like SFILE=SDFILE, where SFILE is a source file and SDFILE is a source description file WARNCTGAPS Warn about identifiers missing in translation NOOPTIM Do not skip unchanged strings in translation/description FILL Fill missing identifiers with original text FLUSH Flush memory after the catalog is created NOBEEP No DisplayBeep() on errors and warnings QUIET No warnings NOLANGTOLOWER Prevent #language name from being lowercased NOBUFFEREDIO Disable I/O buffers MODIFIED Create catalog only if description/translation have changed COPYMSGNEW Copy ***NEW*** markers over from old translation OLDMSGNEW Custom marker in old translation CODESET Codeset to force in output file (e.g. 'UTF-8') NOAUTODATE no operation - kept for compatibility NOSPACES no operation - kept for compatibility
fi: CDFILE lähteenä käytettävä kuvaustiedosto (#?.cd) CTFILE lähteenä käytettävä käännöstiedosto (%?.ct) POFILE käännöstiedosto PO-formaatissa CATALOG luotavan catalog-tiedoston nimi NEWCTFILE luotavan CT-käännöstiedoston nimi SOURCES luotava lähdekooditiedosto muotoa SFILE=SDFILE, jossa SFILE on lähdekooditiedosto ja SDFILE on lähdekuvaustiedosto WARNCTGAPS varoita käännöstiedostosta puuttuvista tunnisteista NOOPTIM älä ohita muuttumattomia käännöksen/lähdekuvauksen merkkijonoja FILL täytä puuttuvat tunnisteet alkuperäistekstillä FLUSH tyhjennä käännökset muistista kun catalog luotu NOBEEP älä käytä DisplayBeep()-rutiinia varoitusten ja virheiden kohdalla QUIET Ei varoituksia NOLANGTOLOWER Estä kielen nimen muuttaminen pieniksi kirjaimiksi NOBUFFEREDIO älä käytä puskuroitua I/O:ta MODIFIED Luo catalog-tiedosto vain jos kuvaus/lähdetiedostoja on muutettu COPYMSGNEW Kopioi ***NEW***-merkit vanhasta käännöksestä OLDMSGNEW Omavalintainen merkki vanhassa käännöksessä CODESET merkistö, jota käytetään tulostiedostoissa (e.g. 'UTF-8') NOAUTODATE ei toimintoa - säilytetty yhteensopivuuden vuoksi NOSPACES ei toimintoa - säilytetty yhteensopivuuden vuoksi

# MSG_FILEUPTODATE (2//)
source: File '%s' is up to date
fi: Tiedosto %s on jo ajan tasalla.

# MSG_ERR_WARNING (100//)
source: %s, line %d - warning:
fi: %s, rivi %d; varoitus:

# MSG_ERR_ERROR (101//)
source: %s, line %d - ERROR:
fi: %s, rivi %d - VIRHE:

# MSG_ERR_EXPECTEDHEX (102//)
source: expected hex character (one of [0-9a-fA-F])
fi: Puuttuva heksamerkki (kuten [0-9a-fA-F]).

# MSG_ERR_EXPECTEDOCTAL (103//)
source: expected octal character (one of [0-7])
fi: Puuttuva oktaalimerkki (väliltä [0-7]).

# MSG_ERR_NOLENGTHBYTES (104//)
source: lengthbytes cannot be larger than %d (sizeof long)
fi: LengthBytes > %d (pitkä sana), mahdotonta.

# MSG_ERR_UNKNOWNCDCOMMAND (105//)
source: unknown catalog description command
fi: Tuntematon catalog-kuvauksen komento.

# MSG_ERR_UNEXPECTEDBLANKS (106//)
source: unexpected blanks
fi: Odottamattomia välilyöntejä.

# MSG_ERR_NOIDENTIFIER (107//)
source: missing identifier
fi: Puuttuva tunniste.

# MSG_ERR_MISSINGSTRING (115//)
source: unexpected end of file (missing catalog strings)
fi: Ennenaikainen tiedoston päättyminen, puuttuva catalog-merkkijono.

# MSG_ERR_UNKNOWNCTCOMMAND (118//)
source: unknown command in translation
fi: Tuntematon catalog-käännöksen komento.

# MSG_ERR_UNKNOWNIDENTIFIER (119//)
source: '%s' missing in catalog description
fi: '%s' puuttuu catalog-kuvauksesta.

# MSG_ERR_UNKNOWNSTRINGTYPE (120//)
source: unknown string type
fi: Tuntematon merkkijonotyyppi.

# MSG_ERR_NOTERMINATEBRACKET (121//)
source: unexpected end of line (missing ')')
fi: Odottamaton rivin loppu (puuttuva ')').

# MSG_ERR_NOBINCHARS (122//)
source: binary characters in string type None
fi: Binaarimerkkejä merkkijonotyypissä 'None'.

# MSG_ERR_CTGAP (123//)
source: '%s' missing in catalog translation
fi: Tunniste '%s' puuttuu käännöstiedostosta.

# MSG_ERR_DOUBLECTLANGUAGE (124//)
source: catalog language declared twice
fi: Catalog-kieli määritelty kahdesti.

# MSG_ERR_DOUBLECTVERSION (125//)
source: catalog version declared twice
fi: Catalog-versio määritelty kahdesti.

# MSG_ERR_WRONGRCSID (126//)
source: incorrect RCS Id
fi: Väärin muotoiltu rcs-tunniste

# MSG_ERR_NOMEMORY (127//)
source: out of memory!
fi: Muisti ei riitä!

# MSG_ERR_NOCATALOGDESCRIPTION (128//)
source: cannot open catalog description '%s'
fi: Catalog-kuvaustiedosto '%s' ei aukea.

# MSG_ERR_NOCATALOGTRANSLATION (129//)
source: cannot open catalog translation '%s'
fi: Catalog-käännöstiedosto '%s' ei aukea.

# MSG_ERR_NOCTVERSION (130//)
source: missing catalog translation version Use either '## version' or '## rcsid' and '## name'
fi: Catalog-käännöksen versio puuttuu; käytä joko komentoa ##version tai ##rcsid ja ##name.

# MSG_ERR_NOCATALOG (131//)
source: cannot open catalog file '%s'
fi: Catalog-tiedosto '%s' ei aukea.

# MSG_ERR_NONEWCTFILE (132//)
source: cannot create catalog translation '%s'
fi: Catalog-käännöstiedoston '%s' luonti epäonnistui.

# MSG_ERR_NOCTLANGUAGE (133//)
source: missing catalog translation language
fi: Catalog-käännöksen kieli puuttuu (##language).

# MSG_ERR_NOSOURCE (134//)
source: cannot open source file '%s'
fi: Lähdetiedosto '%s' ei aukea.

# MSG_ERR_NOSOURCEDESCRIPTION (135//)
source: cannot open source description file '%s'
fi: Lähdekuvaustiedosto '%s' ei aukea.

# MSG_ERR_NOCTARGUMENT (136//)
source: creating a catalog requires a translation file
fi: Catalog-tiedoston luonti vaatii argumenttina catalog-käännöstiedoston.

# MSG_ERR_CANTCHECKDATE (137//)
source: cannot get datestamp of '%s'
fi: Tiedoston %s päiväys ei selvinnyt.

# MSG_ERR_NOCTFILENAME (140//)
source: Catalog translation file name not specified at command line or as basename in description
fi: Catalog-käännöstiedoston nimeä ei määritelty komentorivillä eikä kuvaustiedoston perusnimessä.

# MSG_ERR_NOCATFILENAME (141//)
source: catalog file name not specified at command line or as basename in description
fi: catalog-tiedoston nimeä ei määritelty komentorivillä eikä kuvaustiedoston perusnimessä.

# MSG_ERR_BADPREFS (142//)
source: error processing 'FlexCat.prefs' variable, falling back to defaults Template:
fi: Virhe tulkittaessa asetuksia FlexCat.prefs, käytetään oletusarvoja. Asetusten malli:

# MSG_ERR_BADCTLANGUAGE (144//)
source: invalid language in catalog translation file Language MUST be a string with alphabetical characters and no inlined or trailing spaces
fi: catalog-käännöstiedostossa virheellinen kieli Kielen tulee olla merkkijono, jossa on tavallisia kirjaimia eikä välilyöntejä keskellä eikä lopussa

# MSG_ERR_DOUBLECTCODESET (146//)
source: catalog codeset declared twice
fi: Catalog-merkistö määritelty kahdesti

# MSG_ERR_BADCTCODESET (147//)
source: invalid codeset in catalog translation file Codeset MUST be a decimal number without any trailing spaces
fi: catalog-käännöstiedostossa virheellinen merkistö Merkistön pitää olla numero ilman välilyöntejä numeron jälkeen

# MSG_ERR_NOCTCODESET (148//)
source: missing catalog translation codeset
fi: catalog-käännöstiedoston merkistö puuttuu

# MSG_ERR_ERROR_QUICK (149//)
source: %s - ERROR:
fi: %s - VIRHE:

# MSG_ERR_BADCTVERSION (150//)
source: invalid version string in catalog translation file Version should be something like ## version $VER: name version.revision (date) without any spaces in the name
fi: catalog-käännöstiedostossa on virheellinen versiomerkkijono Versiotiedon pitää olla muotoa ## version $VER: nimi versio.revisio (päiväys) ilman välilyöntejä nimessä

# MSG_ERR_WARNING_QUICK (154//)
source: %s - Warning:
fi: %s - Varoitus:

# MSG_ERR_MISSINGTRANSLATION (155//)
source: missing translation for identifier '%s'
fi: tunnisteelta '%s' puuttuu käännös

# MSG_ERR_EMPTYTRANSLATION (156//)
source: empty translation for identifier '%s'
fi: tunnisteella '%s' on tyhjä käännös

# MSG_ERR_MISMATCHINGCONTROLCHARACTERS (157//)
source: mismatching trailing control characters
fi: kontrollimerkkejä on virheellinen määrä

# MSG_ERR_DOUBLE_IDENTIFIER (159//)
source: identifier '%s' declared twice
fi: tunniste '%s' määritelty kahdesti

# MSG_ERR_STRING_TOO_SHORT (160//)
source: string too short for identifier '%s'
fi: tunnisteen '%s' käännös on liian lyhyt

# MSG_ERR_STRING_TOO_LONG (161//)
source: string too long for identifier '%s'
fi: tunnisteen '%s' käännös on liian pitkä

# MSG_ERR_TRAILING_ELLIPSIS (162//)
source: original string has a trailing ellipsis ('...') for identifier '%s'
fi: tunnisteen '%s' alkuperäisen merkkijonon lopussa on kolme pistettä ('...')

# MSG_ERR_NO_TRAILING_ELLIPSIS (163//)
source: original string doesn't have a trailing ellipsis ('...') for identifier '%s'
fi: tunnisteen '%s' alkuperäisen merkkijonon lopussa ei ole kolmea pistettä ('...')

# MSG_ERR_TRAILING_BLANKS (164//)
source: original string has trailing blanks for identifier '%s'
fi: tunnisteen '%s' alkuperäisen merkkijonon lopussa on välilyöntejä

# MSG_ERR_NO_TRAILING_BLANKS (165//)
source: original string doesn't have trailing blanks for identifier '%s'
fi: tunnisteen '%s' alkuperäisen merkkijonon lopussa ei ole välilyöntejä

# MSG_ERR_MISMATCHING_PLACEHOLDERS (166//)
source: mismatching placeholders for identifier '%s'
fi: tunnisteessa '%s' on virheellinen määrä 'paikanpitäjiä'

# MSG_ERR_MISSING_PLACEHOLDERS (167//)
source: missing placeholders for identifier '%s'
fi: tunnisteessa '%s' puuttuu 'paikanpitäjiä'

# MSG_ERR_EXCESSIVE_PLACEHOLDERS (168//)
source: excessive placeholders for identifier '%s'
fi: tunnisteessa '%s' on liikaa 'paikanpitäjiä'

# MSG_ERR_NO_LEADING_BRACKET (169//)
source: missing '(' for identifier '%s'
fi: tunnisteessa '%s' puuttuu '('

# MSG_ERR_NO_TRAILING_BRACKET (170//)
source: missing ')' for identifier '%s'
fi: tunnisteessa '%s' puuttuu ')'

# MSG_ERR_DOUBLE_ID (171//)
source: ID number used twice for identifier '%s'
fi: tunnisteen '%s' ID-numero on käytetty kahdesti

# MSG_ERR_NO_MIN_LEN (172//)
source: expected MinLen (character '/') for identifier '%s'
fi: tunnisteessa '%s' olisi pitänyt olla MinLen (merkki '/')

# MSG_ERR_NO_MAX_LEN (173//)
source: expected MaxLen (character '/') for identifier '%s'
fi: tunnisteessa '%s' olisi pitänyt olla MaxLen (merkki '/')

# MSG_ERR_EXTRA_CHARACTERS (174//)
source: extra characters at the end of the line
fi: rivin lopussa ylimääräisiä merkkejä

# MSG_ERR_EXTRA_CHARACTERS_ID (175//)
source: extra characters at the end of the line for identifier '%s'
fi: tunnisteessa '%s' rivin lopussa ylimääräisiä merkkejä

# MSG_ERR_NON_ASCII_CHARACTER (176//)
source: non-ASCII character 0x%02x found in original string for identifier '%s'
fi: tunnisteen '%s' alkuperäisessä merkkijonossa löytyi ei-ASCII-merkki 0x%02x
