Repository: aros-development-team/AROS
Catalog: tools/flexcat/src/locale/greek.po
Languages: el

# MSG_USAGE_HEAD (0//)
source: Usage:
el: Χρήση:

# MSG_FILEUPTODATE (2//)
source: File '%s' is up to date
el: Το αρχείο '%s' είναι ενημερωμένο

# MSG_ERR_WARNING (100//)
source: %s, line %d - warning:
el: %s, γραμμή %d - προειδοποίηση:

# MSG_ERR_ERROR (101//)
source: %s, line %d - ERROR:
el: %s, γραμμή %d - ΣΦΑΛΜΑ:

# MSG_ERR_EXPECTEDHEX (102//)
source: expected hex character (one of [0-9a-fA-F])
el: αναμενόμενος δεκαεξαδικός χαρακτήρας (ένα από [0-9a-fA-F])

# MSG_ERR_EXPECTEDOCTAL (103//)
source: expected octal character (one of [0-7])
el: αναμενόμενος οκταδικός χαρακτήρας (ένα από [0-7])

# MSG_ERR_NOLENGTHBYTES (104//)
source: lengthbytes cannot be larger than %d (sizeof long)
el: Τα μήκη bytes δεν μπορεί να είναι μεγαλύτερα από %d (sizeof long)

# MSG_ERR_UNKNOWNCDCOMMAND (105//)
source: unknown catalog description command
el: άγνωση εντολή της περιγραφής καταλόγου

# MSG_ERR_UNEXPECTEDBLANKS (106//)
source: unexpected blanks
el: αναπάντεχα κενά

# MSG_ERR_NOIDENTIFIER (107//)
source: missing identifier
el: απουσιάζει αναγνωριστικό

# MSG_ERR_MISSINGSTRING (115//)
source: unexpected end of file (missing catalog strings)
el: αναπάντεχο τέλος αρχείου (λείπουν συμβολοσειρές καταλόγου)

# MSG_ERR_UNKNOWNCTCOMMAND (118//)
source: unknown command in translation
el: άγνωση εντολή στη μετάφραση

# MSG_ERR_UNKNOWNIDENTIFIER (119//)
source: '%s' missing in catalog description
el: Το '%s' απουσιάζει στον κατάλογο περιγραφής

# MSG_ERR_UNKNOWNSTRINGTYPE (120//)
source: unknown string type
el: άγνωστος τύπος συμβολοσειράς

# MSG_ERR_NOTERMINATEBRACKET (121//)
source: unexpected end of line (missing ')')
el: αναπάντεχο τέλος αρχείου (λείπει ')')

# MSG_ERR_NOBINCHARS (122//)
source: binary characters in string type None
el: δυαδικοί χαρακτήρες στον τύπο συμβολοσειράς Κανένας

# MSG_ERR_CTGAP (123//)
source: '%s' missing in catalog translation
el: Το '%s' απουσιάζει από τον κατάλογο μετάφρασης

# MSG_ERR_DOUBLECTLANGUAGE (124//)
source: catalog language declared twice
el: Η γλώσσα καταλόγου έχει δηλωθεί δυο φορές

# MSG_ERR_DOUBLECTVERSION (125//)
source: catalog version declared twice
el: Η έκδοση καταλόγου έχει δηλωθεί δυο φορές

# MSG_ERR_WRONGRCSID (126//)
source: incorrect RCS Id
el: εσφαλμένο RCS Id

# MSG_ERR_NOMEMORY (127//)
source: out of memory!
el: μη επαρκής μνήμη!

# MSG_ERR_NOCATALOGDESCRIPTION (128//)
source: cannot open catalog description '%s'
el: αδυναμία ανοίγματος της περιγραφής καταλόγου '%s'

# MSG_ERR_NOCATALOGTRANSLATION (129//)
source: cannot open catalog translation '%s'
el: αδυναμία ανοίγματος της μετάφρασης καταλόγου '%s'

# MSG_ERR_NOCTVERSION (130//)
source: missing catalog translation version Use either '## version' or '## rcsid' and '## name'
el: απουσία έκδοσης της μετάφρασης καταλόγου Χρησιμοποιήστε είτε '## version' ή '## rcsid' και '## name'

# MSG_ERR_NOCATALOG (131//)
source: cannot open catalog file '%s'
el: αδυναμία ανοίγματος του αρχείου καταλόγου '%s'

# MSG_ERR_NONEWCTFILE (132//)
source: cannot create catalog translation '%s'
el: αδυναμία δημιουργίας της μετάφρασης καταλόγου '%s'

# MSG_ERR_NOCTLANGUAGE (133//)
source: missing catalog translation language
el: απουσία γλώσσας της μετάφρασης καταλόγου

# MSG_ERR_NOSOURCE (134//)
source: cannot open source file '%s'
el: αδυναμία ανοίγματος του αρχείου πηγής '%s'

# MSG_ERR_NOSOURCEDESCRIPTION (135//)
source: cannot open source description file '%s'
el: αδυναμία ανοίγματος του αρχείου περιγραφής '%s'

# MSG_ERR_NOCTARGUMENT (136//)
source: creating a catalog requires a translation file
el: η δημουργία ενός καταλόγου απαιτεί ένα αρχείο μετάφρασης

# MSG_ERR_CANTCHECKDATE (137//)
source: cannot get datestamp of '%s'
el: αδυναμία λήψης ημερομηνίας του '%s'

# MSG_ERR_NOCTFILENAME (140//)
source: Catalog translation file name not specified at command line or as basename in description
el: δεν έχει οριστεί το όνομα αρχείου του καταλόγου μετάφρασης στη γραμμή εντολής ή ως όνομα βάσης στη περιγραφή

# MSG_ERR_NOCATFILENAME (141//)
source: catalog file name not specified at command line or as basename in description
el: δεν έχει οριστεί το όνομα αρχείου καταλόγου στη γραμμή εντολής ή ως όνομα βάσης στη περιγραφή

# MSG_ERR_BADPREFS (142//)
source: error processing 'FlexCat.prefs' variable, falling back to defaults Template:
el: σφάλμα κατά την διαδικασία μεταβλητής του 'FlexCat.prefs'. Επαναφορά πίσω στα προεπιλεγμένα Πρότυπο:

# MSG_ERR_BADCTLANGUAGE (144//)
source: invalid language in catalog translation file Language MUST be a string with alphabetical characters and no inlined or trailing spaces
el: μη έγκυρη γλώσσα στο αρχείου μετάφρασης καταλόγου Η γλώσσα ΠΡΕΠΕΙ να είναι μια συμβολοσειρά από αλφαβητικούς χαρακτήρες και όχι με ενσωματωμένα ή καταληκτικά κενά

# MSG_ERR_DOUBLECTCODESET (146//)
source: catalog codeset declared twice
el: η κωδικοποίηση χαρακτήρων έχει δηλωθεί δυο φορές

# MSG_ERR_BADCTCODESET (147//)
source: invalid codeset in catalog translation file Codeset MUST be a decimal number without any trailing spaces
el: μη έγκυρη κωδικοποίηση χαρακτήρων στο αρχείο καταλόγου μετάφρασης Η κωδικοποίηση χαρακτήρων ΠΡΕΠΕΙ να είναι ένας δεκαδικός αριθμός χωρίς καταληκτικά κενά

# MSG_ERR_NOCTCODESET (148//)
source: missing catalog translation codeset
el: απουσία κωδικοποίησης χαρακτήρων στη μετάφραση καταλόγου

# MSG_ERR_ERROR_QUICK (149//)
source: %s - ERROR:
el: %s - ΣΦΑΛΜΑ:

# MSG_ERR_BADCTVERSION (150//)
source: invalid version string in catalog translation file Version should be something like ## version $VER: name version.revision (date) without any spaces in the name
el: μη έγκυρη συμβολοσειρά έκδοσης στο αρχείο μετάφρασης καταλόγου Η έκδοση θα πρέπει να είναι όπως ## version $VER: name version.revision (date) χωρίς κενά στο όνομα

# MSG_ERR_WARNING_QUICK (154//)
source: %s - Warning:
el: %s - Προειδοποίηση:

# MSG_ERR_MISSINGTRANSLATION (155//)
source: missing translation for identifier '%s'
el: απουσία μετάφρασης για το αναγνωριστικό '%s'

# MSG_ERR_EMPTYTRANSLATION (156//)
source: empty translation for identifier '%s'
el: κενή μετάφραση για το αναγνωριστικό '%s'

# MSG_ERR_MISMATCHINGCONTROLCHARACTERS (157//)
source: mismatching trailing control characters
el: αναντιστοιχία τελικών χαρακτήρων ελέγχου

# MSG_ERR_DOUBLE_IDENTIFIER (159//)
source: identifier '%s' declared twice
el: το αναγνωριστικό '%s' έχει δηλωθεί δυο φορές

# MSG_ERR_STRING_TOO_SHORT (160//)
source: string too short for identifier '%s'
el: η συμβολοσειρά είναι πολύ κοντή για το αναγνωριστικό '%s'

# MSG_ERR_STRING_TOO_LONG (161//)
source: string too long for identifier '%s'
el: η συμβολοσειρά είναι πολύ μακρύς για το αναγνωριστικό '%s'

# MSG_ERR_TRAILING_ELLIPSIS (162//)
source: original string has a trailing ellipsis ('...') for identifier '%s'
el: η αρχική συμβολοσειρά έχει αποσιωπητικά ('...') για το αναγνωριστικό '%s'

# MSG_ERR_NO_TRAILING_ELLIPSIS (163//)
source: original string doesn't have a trailing ellipsis ('...') for identifier '%s'
el: η αρχική συμβολοσειρά δεν έχει αποσιωπητικά ('...') για το αναγνωριστικό '%s'

# MSG_ERR_TRAILING_BLANKS (164//)
source: original string has trailing blanks for identifier '%s'
el: η αρχική συμβολοσειρά έχει καταληκτικά κενά για το αναγνωριστικό '%s'

# MSG_ERR_NO_TRAILING_BLANKS (165//)
source: original string doesn't have trailing blanks for identifier '%s'
el: η αρχική συμβολοσειρά δεν έχει καταληκτικά κενά για το αναγνωριστικό '%s'

# MSG_ERR_MISMATCHING_PLACEHOLDERS (166//)
source: mismatching placeholders for identifier '%s'
el: αναντιστοιχία δεσμευτικών θέσης για το αναγνωριστικό '%s'

# MSG_ERR_MISSING_PLACEHOLDERS (167//)
source: missing placeholders for identifier '%s'
el: απουσία δεσμευτικών θέσης για το αναγνωριστικό '%s'

# MSG_ERR_EXCESSIVE_PLACEHOLDERS (168//)
source: excessive placeholders for identifier '%s'
el: υπερβολικά δεσμευτικά θέσης για το αναγνωριστικό '%s'

# MSG_ERR_NO_LEADING_BRACKET (169//)
source: missing '(' for identifier '%s'
el: απουσία '(' για το αναγνωριστικό '%s'

# MSG_ERR_NO_TRAILING_BRACKET (170//)
source: missing ')' for identifier '%s'
el: απουσία ')' για το αναγνωριστικό '%s'

# MSG_ERR_DOUBLE_ID (171//)
source: ID number used twice for identifier '%s'
el: Ο αριθμός ID έχει δηλωθεί δυο φορές για το αναγνωριστικό '%s'

# MSG_ERR_NO_MIN_LEN (172//)
source: expected MinLen (character '/') for identifier '%s'
el: αναμενόταν MinLen (χαρακτήρας '/') για το αναγνωριστικό '%s'

# MSG_ERR_NO_MAX_LEN (173//)
source: expected MaxLen (character '/') for identifier '%s'
el: αναμενόταν MaxLen (χαρακτήρας '/') για το αναγνωριστικό '%s'

# MSG_ERR_EXTRA_CHARACTERS (174//)
source: extra characters at the end of the line
el: επιπλέον χαρακτήρες στο τέλος της γραμμής

# MSG_ERR_EXTRA_CHARACTERS_ID (175//)
source: extra characters at the end of the line for identifier '%s'
el: επιπλέον χαρακτήρες στο τέλος της γραμμής για το αναγνωριστικό '%s'

# MSG_ERR_NON_ASCII_CHARACTER (176//)
source: non-ASCII character 0x%02x found in original string for identifier '%s'
el: βρέθηκε ο μη-ASCII χαρακτήρας 0x%02x στην αρχική συμβολοσειρά του αναγνωριστικού '%s'
