Repository: aros-development-team/AROS
Catalog: tools/flexcat/src/locale/polish.po
Languages: pl

# MSG_USAGE_HEAD (0//)
source: Usage:
pl: Użycie:

# MSG_FILEUPTODATE (2//)
source: File '%s' is up to date
pl: Plik "%s" jest aktualny

# MSG_ERR_WARNING (100//)
source: %s, line %d - warning:
pl: "%s", linia %d - ostrzeżenie:

# MSG_ERR_ERROR (101//)
source: %s, line %d - ERROR:
pl: "%s", linia %d - bł±d:

# MSG_ERR_EXPECTEDHEX (102//)
source: expected hex character (one of [0-9a-fA-F])
pl: oczekiwana liczba w systemie szesnastowym (jedna z zakresu [0-9a-fA-F])

# MSG_ERR_EXPECTEDOCTAL (103//)
source: expected octal character (one of [0-7])
pl: oczekiwana liczba w systemie ósemkowym (jedna z zakresu [0-7])

# MSG_ERR_NOLENGTHBYTES (104//)
source: lengthbytes cannot be larger than %d (sizeof long)
pl: argument LengthBytes nie może byæ wiêkszy niż %d (wielko¶æ długiego słowa).

# MSG_ERR_UNKNOWNCDCOMMAND (105//)
source: unknown catalog description command
pl: nieznane polecenie w pliku opisu

# MSG_ERR_UNEXPECTEDBLANKS (106//)
source: unexpected blanks
pl: nieoczekiwane puste linie

# MSG_ERR_NOIDENTIFIER (107//)
source: missing identifier
pl: brakuj±cy indentyfikator

# MSG_ERR_MISSINGSTRING (115//)
source: unexpected end of file (missing catalog strings)
pl: nieoczekiwany koniec pliku (brakuj±ce ci±gi katalogu)

# MSG_ERR_UNKNOWNCTCOMMAND (118//)
source: unknown command in translation
pl: nieznane polecenie w pliku tłumaczenia katalogu

# MSG_ERR_UNKNOWNIDENTIFIER (119//)
source: '%s' missing in catalog description
pl: brakuj±ca etykieta "%s" w pliku opisu katalogu

# MSG_ERR_UNKNOWNSTRINGTYPE (120//)
source: unknown string type
pl: nie znany rodziaj ci±gu znaków

# MSG_ERR_NOTERMINATEBRACKET (121//)
source: unexpected end of line (missing ')')
pl: nieoczekiwany koniec linii (brakuje ")")

# MSG_ERR_NOBINCHARS (122//)
source: binary characters in string type None
pl: dane binarne w łańcuchu typu None

# MSG_ERR_CTGAP (123//)
source: '%s' missing in catalog translation
pl: brakuj±cy identyfikator "%s" w pliku tłumaczenia

# MSG_ERR_DOUBLECTLANGUAGE (124//)
source: catalog language declared twice
pl: jêzyk katalogu zadeklarowany dwukrotnie

# MSG_ERR_DOUBLECTVERSION (125//)
source: catalog version declared twice
pl: wersja katalogu zadeklarowana dwukrotnie

# MSG_ERR_WRONGRCSID (126//)
source: incorrect RCS Id
pl: niewła¶ciwy identyfikator RCS

# MSG_ERR_NOMEMORY (127//)
source: out of memory!
pl: brak pamiêci!

# MSG_ERR_NOCATALOGDESCRIPTION (128//)
source: cannot open catalog description '%s'
pl: nie można otworzyæ pliku opisu katalogu "%s"

# MSG_ERR_NOCATALOGTRANSLATION (129//)
source: cannot open catalog translation '%s'
pl: nie można otworzyæ pliku tłumaczenia katalogu "%s"

# MSG_ERR_NOCTVERSION (130//)
source: missing catalog translation version Use either '## version' or '## rcsid' and '## name'
pl: brak numeru wersji katalogu Użyj polecenia "## version" albo poleceń "## rcsid" i "## name".

# MSG_ERR_NOCATALOG (131//)
source: cannot open catalog file '%s'
pl: nie można otworzyæ pliku katalogu "%s"

# MSG_ERR_NONEWCTFILE (132//)
source: cannot create catalog translation '%s'
pl: nie można utworzyæ pliku tłumaczenia "%s"

# MSG_ERR_NOCTLANGUAGE (133//)
source: missing catalog translation language
pl: brak okre¶lenia jêzyka tłumaczenia katalogu

# MSG_ERR_NOSOURCE (134//)
source: cannot open source file '%s'
pl: nie można otworzyæ pliku Œródłowego "%s"

# MSG_ERR_NOSOURCEDESCRIPTION (135//)
source: cannot open source description file '%s'
pl: nie można otworzyæ pliku Œródłowego opisu katalogu "%s"

# MSG_ERR_NOCTARGUMENT (136//)
source: creating a catalog requires a translation file
pl: tworzenie pliku katalogu wymaga pliku z tłumaczeniem

# MSG_ERR_CANTCHECKDATE (137//)
source: cannot get datestamp of '%s'
pl: nie można pobraæ oznaczenia czasowego pliku "%s"

# MSG_ERR_NOCTFILENAME (140//)
source: Catalog translation file name not specified at command line or as basename in description
pl: nie okre¶lono nazwy pliku tłumaczenia jako argument w linii polecenia, lub jako nazwa bazowa w pliku opisu

# MSG_ERR_NOCATFILENAME (141//)
source: catalog file name not specified at command line or as basename in description
pl: nie okre¶lono nazwy pliku katalogu jako argument w linii polecenia, lub jako nazwa bazowa w pliku opisu

# MSG_ERR_BADPREFS (142//)
source: error processing 'FlexCat.prefs' variable, falling back to defaults Template:
pl: bł±d podczas przetwarzania zmiennych w pliku "FlexCat.orefs", zostan± użyte warto¶ci domy¶lne Szablon:

# MSG_ERR_BADCTLANGUAGE (144//)
source: invalid language in catalog translation file Language MUST be a string with alphabetical characters and no inlined or trailing spaces
pl: niewła¶ciwy jêzyk w pliku tłumaczenia katalogu Nazwa jêzyka MUSI byæ ci±giem liter bez odstepów ani spacji na końcu linii.

# MSG_ERR_DOUBLECTCODESET (146//)
source: catalog codeset declared twice
pl: strona kodowa katalogu zadeklarowana dwukrotnie

# MSG_ERR_BADCTCODESET (147//)
source: invalid codeset in catalog translation file Codeset MUST be a decimal number without any trailing spaces
pl: niewła¶ciwa strona kodowa w pliku tłumaczenia katalogu Strona kodowa MUSI byæ liczb± bez odstepów ani spacji na końcu linii.

# MSG_ERR_NOCTCODESET (148//)
source: missing catalog translation codeset
pl: brakuj±ca deklaracja strony kodowej w pliku opisu katalogu

# MSG_ERR_ERROR_QUICK (149//)
source: %s - ERROR:
pl: %s - bł±d:

# MSG_ERR_BADCTVERSION (150//)
source: invalid version string in catalog translation file Version should be something like ## version $VER: name version.revision (date) without any spaces in the name
pl: niewła¶ciwa deklaracja wersji w pliku tłumaczenia katalogu Wersja powinna byæ wpisana w postaci ## version $VER: nazwa wersja.rewizja (data) bez spacji w nazwie

# MSG_ERR_WARNING_QUICK (154//)
source: %s - Warning:
pl: %s - ostrzeżenie:

# MSG_ERR_MISSINGTRANSLATION (155//)
source: missing translation for identifier '%s'
pl: brakuj±ce tłumaczenie dla identyfikatora "%s"

# MSG_ERR_EMPTYTRANSLATION (156//)
source: empty translation for identifier '%s'
pl: puste tłumaczenie dla identyfikatora "%s"

# MSG_ERR_MISMATCHINGCONTROLCHARACTERS (157//)
source: mismatching trailing control characters
pl: niepasuj±ce kończ±ce znaki kontrolne
