Repository: aros-development-team/AROS
Catalog: tools/flexcat/src/locale/swedish.po
Languages: sv

# MSG_USAGE_HEAD (0//)
source: Usage:
sv: Användning:

# MSG_USAGE (1//)
source: CDFILE Catalog description file to scan CTFILE Catalog translation file to scan POFILE Catalog translation in PO-style format CATALOG Catalog file to create NEWCTFILE Catalog translation file to create SOURCES Sources to create; must be something like SFILE=SDFILE, where SFILE is a source file and SDFILE is a source description file WARNCTGAPS Warn about identifiers missing in translation NOOPTIM Do not skip unchanged strings in translation/description FILL Fill missing identifiers with original text FLUSH Flush memory after the catalog is created NOBEEP No DisplayBeep() on errors and warnings QUIET No warnings NOLANGTOLOWER Prevent #language name from being lowercased NOBUFFEREDIO Disable I/O buffers MODIFIED Create catalog only if description/translation have changed COPYMSGNEW Copy ***NEW*** markers over from old translation OLDMSGNEW Custom marker in old translation CODESET Codeset to force in output file (e.g. 'UTF-8') NOAUTODATE no operation - kept for compatibility NOSPACES no operation - kept for compatibility
sv: CDFILE Katalogbeskrivning att läsa CTFILE Katalogöversättning att läsa CATALOG Katalog att skapa NEWCTFILE Katalogöversättning att skapa SOURCES Källkoder att skapa; måste vara i stil med SFILE=SDFILE, där SFILE är en källkodsfil och SDFILE är en källkodsbeskrivningsfil WARNCTGAPS Varna om symboler saknas i översättning NOOPTIM Hoppa inte över oändrade strängar i översättning/beskrivning FILL Fyll saknade symboler med originaltext FLUSH Rensa minnet efter katalogen skapats NOBEEP Blinka inte skärmen() vid fel och varningar QUIET Inga varningar NOLANGTOLOWER Förhindra #language namn ändras till små bokstäver NOBUFFEREDIO Inaktivera IO-buffrar MODIFIED Skapa bara katalogen om beskrivning/översättning har ändrats COPYMSGNEW Kopiera **NEW** markörer över från tidigare översättning OLDMSGNEW Egen markör i tidigare översättning CODESET Teckenuppsättning att tvinga i utmatningsfilen (t.ex. 'UTF-8') NOAUTODATE ingen operation - kvar för kompatibilitet NOSPACES ingen operation - kvar för kompatibilitet

# MSG_FILEUPTODATE (2//)
source: File '%s' is up to date
sv: Filen '%s' behöver inte uppdateras

# MSG_ERR_WARNING (100//)
source: %s, line %d - warning:
sv: %s, rad %d - varning:

# MSG_ERR_ERROR (101//)
source: %s, line %d - ERROR:
sv: %s, rad %d - FEL:

# MSG_ERR_EXPECTEDHEX (102//)
source: expected hex character (one of [0-9a-fA-F])
sv: hexadecimal siffra förväntades (någon av [0-9a-fA-F])

# MSG_ERR_EXPECTEDOCTAL (103//)
source: expected octal character (one of [0-7])
sv: oktal siffra förväntades (någon av [0-7])

# MSG_ERR_NOLENGTHBYTES (104//)
source: lengthbytes cannot be larger than %d (sizeof long)
sv: lengthbytes kan inte vara större än %d (sizeof long)

# MSG_ERR_UNKNOWNCDCOMMAND (105//)
source: unknown catalog description command
sv: okänt kommando i katalogbeskrivning

# MSG_ERR_UNEXPECTEDBLANKS (106//)
source: unexpected blanks
sv: oväntade mellanslag

# MSG_ERR_NOIDENTIFIER (107//)
source: missing identifier
sv: identifierare saknas

# MSG_ERR_MISSINGSTRING (115//)
source: unexpected end of file (missing catalog strings)
sv: oväntat filslut (katalogsträng saknas)

# MSG_ERR_UNKNOWNCTCOMMAND (118//)
source: unknown command in translation
sv: okänt kommando i översättning

# MSG_ERR_UNKNOWNIDENTIFIER (119//)
source: '%s' missing in catalog description
sv: '%s' saknas i katalogbeskrivningen

# MSG_ERR_UNKNOWNSTRINGTYPE (120//)
source: unknown string type
sv: okänd strängtyp

# MSG_ERR_NOTERMINATEBRACKET (121//)
source: unexpected end of line (missing ')')
sv: oväntat radslut (')' saknas)

# MSG_ERR_NOBINCHARS (122//)
source: binary characters in string type None
sv: binära tecken i strängtypen None

# MSG_ERR_CTGAP (123//)
source: '%s' missing in catalog translation
sv: '%s' saknas i katalogöversättning

# MSG_ERR_DOUBLECTLANGUAGE (124//)
source: catalog language declared twice
sv: katalogspråk har angetts två gånger

# MSG_ERR_DOUBLECTVERSION (125//)
source: catalog version declared twice
sv: katalogversion har angetts två gånger

# MSG_ERR_WRONGRCSID (126//)
source: incorrect RCS Id
sv: felaktigt RCS-Id

# MSG_ERR_NOMEMORY (127//)
source: out of memory!
sv: ej tillräckligt med minne!

# MSG_ERR_NOCATALOGDESCRIPTION (128//)
source: cannot open catalog description '%s'
sv: kan inte öppna katalogbeskrivning '%s'

# MSG_ERR_NOCATALOGTRANSLATION (129//)
source: cannot open catalog translation '%s'
sv: kan inte öppna katalogöversättning '%s'

# MSG_ERR_NOCTVERSION (130//)
source: missing catalog translation version Use either '## version' or '## rcsid' and '## name'
sv: saknar version för katalogöversättning Använd '##version' eller '## rcsid' och '## name'

# MSG_ERR_NOCATALOG (131//)
source: cannot open catalog file '%s'
sv: kan inte öppna katalogen '%s'

# MSG_ERR_NONEWCTFILE (132//)
source: cannot create catalog translation '%s'
sv: kan inte skapa katalogöversättning '%s'

# MSG_ERR_NOCTLANGUAGE (133//)
source: missing catalog translation language
sv: saknar språk för katalogöversättning

# MSG_ERR_NOSOURCE (134//)
source: cannot open source file '%s'
sv: kan inte öppna källkodsfil '%s'

# MSG_ERR_NOSOURCEDESCRIPTION (135//)
source: cannot open source description file '%s'
sv: kan inte öppna källkodsbeskrivning '%s'

# MSG_ERR_NOCTARGUMENT (136//)
source: creating a catalog requires a translation file
sv: för att skapa en katalog krävs en översättningsfil

# MSG_ERR_CANTCHECKDATE (137//)
source: cannot get datestamp of '%s'
sv: kan inte läsa datumet för '%s'

# MSG_ERR_NOCTFILENAME (140//)
source: Catalog translation file name not specified at command line or as basename in description
sv: Namn för katalogöversättningsfil inte specifierat på kommandoraden eller som basnamn i beskrivning

# MSG_ERR_NOCATFILENAME (141//)
source: catalog file name not specified at command line or as basename in description
sv: namn för katalogfil inte specifierat på kommandoraden eller som basnamn i beskrivning

# MSG_ERR_BADPREFS (142//)
source: error processing 'FlexCat.prefs' variable, falling back to defaults Template:
sv: fel vid bearbetning av variabeln 'FlexCat.prefs', använder förinställda värden. Inställningsmall:

# MSG_ERR_BADCTLANGUAGE (144//)
source: invalid language in catalog translation file Language MUST be a string with alphabetical characters and no inlined or trailing spaces
sv: ogiltigt språk i katalogöversättningsfilen Språk MÅSTE vara en sträng med alfanumeriska tecken och inga infogade eller avslutande mellanslag

# MSG_ERR_DOUBLECTCODESET (146//)
source: catalog codeset declared twice
sv: katalogens teckenuppsättning har angetts två gånger

# MSG_ERR_BADCTCODESET (147//)
source: invalid codeset in catalog translation file Codeset MUST be a decimal number without any trailing spaces
sv: ogiltig teckenuppsättning i katalogöversättningsfilen Teckenuppsättningen MÅSTE vara ett decimalt nummer utan avslutande mellanslag

# MSG_ERR_NOCTCODESET (148//)
source: missing catalog translation codeset
sv: saknar teckenuppsättning för katalogöversättning

# MSG_ERR_ERROR_QUICK (149//)
source: %s - ERROR:
sv: %s - FEL:

# MSG_ERR_BADCTVERSION (150//)
source: invalid version string in catalog translation file Version should be something like ## version $VER: name version.revision (date) without any spaces in the name
sv: ogiltig versionssträng i katalogöversättningsfilen Version bör vara ungefär som ## version $VER: namn version.revision (datum) utan några mellanrum i namnet

# MSG_ERR_WARNING_QUICK (154//)
source: %s - Warning:
sv: %s - Varning:

# MSG_ERR_MISSINGTRANSLATION (155//)
source: missing translation for identifier '%s'
sv: översättning saknas för identifierare '%s'

# MSG_ERR_EMPTYTRANSLATION (156//)
source: empty translation for identifier '%s'
sv: tom översättning för identifierare '%s'

# MSG_ERR_MISMATCHINGCONTROLCHARACTERS (157//)
source: mismatching trailing control characters
sv: avslutande kontrolltecken matchar inte

# MSG_ERR_DOUBLE_IDENTIFIER (159//)
source: identifier '%s' declared twice
sv: identifierare '%s' har angetts två gånger

# MSG_ERR_STRING_TOO_SHORT (160//)
source: string too short for identifier '%s'
sv: sträng för kort för identifierare '%s'

# MSG_ERR_STRING_TOO_LONG (161//)
source: string too long for identifier '%s'
sv: sträng för lång för identifierare '%s'

# MSG_ERR_TRAILING_ELLIPSIS (162//)
source: original string has a trailing ellipsis ('...') for identifier '%s'
sv: originalsträng har en avslutande ellips ('...') för identifierare '%s'

# MSG_ERR_NO_TRAILING_ELLIPSIS (163//)
source: original string doesn't have a trailing ellipsis ('...') for identifier '%s'
sv: originalsträng har inte en avslutande ellips ('...') för identifierare '%s'

# MSG_ERR_TRAILING_BLANKS (164//)
source: original string has trailing blanks for identifier '%s'
sv: originalsträng har avslutande mellanslag för identifierare '%s'

# MSG_ERR_NO_TRAILING_BLANKS (165//)
source: original string doesn't have trailing blanks for identifier '%s'
sv: originalsträng har inte avslutande mellanslag för identifierare '%s'

# MSG_ERR_MISMATCHING_PLACEHOLDERS (166//)
source: mismatching placeholders for identifier '%s'
sv: Felmatchande platshållare för identifierare '%s'

# MSG_ERR_MISSING_PLACEHOLDERS (167//)
source: missing placeholders for identifier '%s'
sv: saknade platshållare för identifierare '%s'

# MSG_ERR_EXCESSIVE_PLACEHOLDERS (168//)
source: excessive placeholders for identifier '%s'
sv: överdrivna platshållare för identifierare '%s'

# MSG_ERR_NO_LEADING_BRACKET (169//)
source: missing '(' for identifier '%s'
sv: saknad '(' för identifierare '%s'

# MSG_ERR_NO_TRAILING_BRACKET (170//)
source: missing ')' for identifier '%s'
sv: saknad ')' för identifierare '%s'

# MSG_ERR_DOUBLE_ID (171//)
source: ID number used twice for identifier '%s'
sv: ID nummer har angetts två gånger för identifierare '%s'

# MSG_ERR_NO_MIN_LEN (172//)
source: expected MinLen (character '/') for identifier '%s'
sv: förväntade MinLen (tecken '/') för identifierare '%s'

# MSG_ERR_NO_MAX_LEN (173//)
source: expected MaxLen (character '/') for identifier '%s'
sv: förväntade MaxLen (tecken '/') för identifierare '%s'

# MSG_ERR_EXTRA_CHARACTERS (174//)
source: extra characters at the end of the line
sv: extra tecken vid radslut

# MSG_ERR_EXTRA_CHARACTERS_ID (175//)
source: extra characters at the end of the line for identifier '%s'
sv: extra tecken vid radslut för identifierare '%s'

# MSG_ERR_NON_ASCII_CHARACTER (176//)
source: non-ASCII character 0x%02x found in original string for identifier '%s'
sv: icke ASCII tecken 0x%02x hittad i originalsträng för identifierare '%s'
