Repository: aros-development-team/AROS
Catalog: tools/flexcat/src/locale/turkish.po
Languages: tr

# MSG_USAGE_HEAD (0//)
source: Usage:
tr: Kullanım:

# MSG_FILEUPTODATE (2//)
source: File '%s' is up to date
tr: '%s' dosyası günceldir

# MSG_ERR_WARNING (100//)
source: %s, line %d - warning:
tr: %s, satır %d - uyarı:

# MSG_ERR_ERROR (101//)
source: %s, line %d - ERROR:
tr: %s, satır %d - HATA:

# MSG_ERR_EXPECTEDHEX (102//)
source: expected hex character (one of [0-9a-fA-F])
tr: onaltılık karakter bekleniyordu ([0-9a-fA-F]'den biri)

# MSG_ERR_EXPECTEDOCTAL (103//)
source: expected octal character (one of [0-7])
tr: sekizlik karakter bekleniyordu ([0-7]'den biri)

# MSG_ERR_NOLENGTHBYTES (104//)
source: lengthbytes cannot be larger than %d (sizeof long)
tr: uzunluk baytları '%d' (long boyutu) değerinden daha büyük olamaz.

# MSG_ERR_UNKNOWNCDCOMMAND (105//)
source: unknown catalog description command
tr: katalog açıklayıcısında bilinmeyen komut

# MSG_ERR_UNEXPECTEDBLANKS (106//)
source: unexpected blanks
tr: beklenmeyen boşluklar

# MSG_ERR_NOIDENTIFIER (107//)
source: missing identifier
tr: eksik tanımlayıcı

# MSG_ERR_MISSINGSTRING (115//)
source: unexpected end of file (missing catalog strings)
tr: beklenmeyen dosya sonu (kayıp katalog satırları)

# MSG_ERR_UNKNOWNCTCOMMAND (118//)
source: unknown command in translation
tr: çeviride bilinmeyen komut

# MSG_ERR_UNKNOWNIDENTIFIER (119//)
source: '%s' missing in catalog description
tr: '%s' katalog açıklayıcısında eksik

# MSG_ERR_UNKNOWNSTRINGTYPE (120//)
source: unknown string type
tr: bilinmeyen metin türü

# MSG_ERR_NOTERMINATEBRACKET (121//)
source: unexpected end of line (missing ')')
tr: beklenmeyen satır sonu (eksik ')' işareti)

# MSG_ERR_NOBINCHARS (122//)
source: binary characters in string type None
tr: metinde ikilik karakterler tip Hiçbiri

# MSG_ERR_CTGAP (123//)
source: '%s' missing in catalog translation
tr: '%s', katalog çevirisinde yok

# MSG_ERR_DOUBLECTLANGUAGE (124//)
source: catalog language declared twice
tr: katalog dili iki kez belirtilmiş

# MSG_ERR_DOUBLECTVERSION (125//)
source: catalog version declared twice
tr: katalog sürümü iki kez belirtilmiş

# MSG_ERR_WRONGRCSID (126//)
source: incorrect RCS Id
tr: yanlış RCS Id

# MSG_ERR_NOMEMORY (127//)
source: out of memory!
tr: yetersiz bellek!

# MSG_ERR_NOCATALOGDESCRIPTION (128//)
source: cannot open catalog description '%s'
tr: '%s' katalog açıklayıcısı açılamadı

# MSG_ERR_NOCATALOGTRANSLATION (129//)
source: cannot open catalog translation '%s'
tr: %s' catalog çevirisi açılamadı

# MSG_ERR_NOCTVERSION (130//)
source: missing catalog translation version Use either '## version' or '## rcsid' and '## name'
tr: katalog çeviri sürümü eksik '## version' veya '## rcsid' ve '## name'den birini kullanın

# MSG_ERR_NOCATALOG (131//)
source: cannot open catalog file '%s'
tr: '%s' katalog dosyası açılamadı

# MSG_ERR_NONEWCTFILE (132//)
source: cannot create catalog translation '%s'
tr: '%s' katalog çevirisi oluşturulamadı

# MSG_ERR_NOCTLANGUAGE (133//)
source: missing catalog translation language
tr: katalog çeviri dili eksik

# MSG_ERR_NOSOURCE (134//)
source: cannot open source file '%s'
tr: %s' kaynak dosyası açılamadı

# MSG_ERR_NOSOURCEDESCRIPTION (135//)
source: cannot open source description file '%s'
tr: '%s' kaynak açıklayıcı dosyası açılamadı

# MSG_ERR_NOCTARGUMENT (136//)
source: creating a catalog requires a translation file
tr: katalog oluşturmak için bir çeviri dosyası gerekli

# MSG_ERR_CANTCHECKDATE (137//)
source: cannot get datestamp of '%s'
tr: '%s' dosyasından tarih bilgisi alınamadı

# MSG_ERR_NOCTFILENAME (140//)
source: Catalog translation file name not specified at command line or as basename in description
tr: Katalog çevirisi dosya adı komut satırında veya temel ad (basename) olarak açıklayıcıda belirtilmedi

# MSG_ERR_NOCATFILENAME (141//)
source: catalog file name not specified at command line or as basename in description
tr: Katalog dosya adı komut satırında veya temel ad (basename) olarak açıklayıcıda belirtilmedi

# MSG_ERR_BADPREFS (142//)
source: error processing 'FlexCat.prefs' variable, falling back to defaults Template:
tr: 'FlexCat.prefs' değişkeni işlenirken hata. Varsayılanlar kullanılacak Şablon:

# MSG_ERR_BADCTLANGUAGE (144//)
source: invalid language in catalog translation file Language MUST be a string with alphabetical characters and no inlined or trailing spaces
tr: katalog çeviri dosyasında geçersiz dil Dil alfabetik karakterlerden oluşan bir girdi OLMALI, sonunda ve içinde boşluk karakteri OLMAMALI

# MSG_ERR_DOUBLECTCODESET (146//)
source: catalog codeset declared twice
tr: katalog codeset'i iki kez belirtilmiş

# MSG_ERR_BADCTCODESET (147//)
source: invalid codeset in catalog translation file Codeset MUST be a decimal number without any trailing spaces
tr: katalog çeviri dosyasında geçersiz 'codeset' 'codeset' bir ondalık sayı OLMALI ve sonunda boşluk karakteri OLMAMALI

# MSG_ERR_NOCTCODESET (148//)
source: missing catalog translation codeset
tr: katalog çevirisinde 'codeset' eksik

# MSG_ERR_ERROR_QUICK (149//)
source: %s - ERROR:
tr: %s - HATA:

# MSG_ERR_BADCTVERSION (150//)
source: invalid version string in catalog translation file Version should be something like ## version $VER: name version.revision (date) without any spaces in the name
tr: katalog çeviri dosyasında geçersiz sürüm bilgisi Sürüm satırı şöyle birşey olmalı: ## version $VER: adı sürümü.revizyonu (tarih)\n'adı' alanında hiç bir boşluk olmamalıdır

# MSG_ERR_WARNING_QUICK (154//)
source: %s - Warning:
tr: %s - Uyarı:

# MSG_ERR_MISSINGTRANSLATION (155//)
source: missing translation for identifier '%s'
tr: '%s' tanımlayıcısı için çeviri yok

# MSG_ERR_EMPTYTRANSLATION (156//)
source: empty translation for identifier '%s'
tr: '%s' tanımlayıcısı için çeviri boş

# MSG_ERR_MISMATCHINGCONTROLCHARACTERS (157//)
source: mismatching trailing control characters
tr: sonda eşleşmeyen kontrol karakterleri

# MSG_ERR_DOUBLE_IDENTIFIER (159//)
source: identifier '%s' declared twice
tr: '%s' tanımlayıcısı iki defa kullanılmış

# MSG_ERR_STRING_TOO_SHORT (160//)
source: string too short for identifier '%s'
tr: girdi '%s' tanımlayıcısı için çok kısa

# MSG_ERR_STRING_TOO_LONG (161//)
source: string too long for identifier '%s'
tr: '%s' tanımlayıcısı için metin çok uzun

# MSG_ERR_TRAILING_ELLIPSIS (162//)
source: original string has a trailing ellipsis ('...') for identifier '%s'
tr: '%s' tanımlayıcısı için özgün metin üç nokta ile bitiyor ('...')

# MSG_ERR_NO_TRAILING_ELLIPSIS (163//)
source: original string doesn't have a trailing ellipsis ('...') for identifier '%s'
tr: '%s' tanımlayıcısı için özgün metin üç nokta ile bitmiyor ('...')

# MSG_ERR_TRAILING_BLANKS (164//)
source: original string has trailing blanks for identifier '%s'
tr: '%s' tanımlayıcısı için özgün metin boşluk ile bitiyor

# MSG_ERR_NO_TRAILING_BLANKS (165//)
source: original string doesn't have trailing blanks for identifier '%s'
tr: '%s' tanımlayıcısı için özgün metin boşluk ile bitmiyor

# MSG_ERR_MISMATCHING_PLACEHOLDERS (166//)
source: mismatching placeholders for identifier '%s'
tr: '%s' tanımlayıcısı eşleşmeyen yer tutucular

# MSG_ERR_MISSING_PLACEHOLDERS (167//)
source: missing placeholders for identifier '%s'
tr: '%s' tanımlayıcısı için eksik yer tutucular

# MSG_ERR_EXCESSIVE_PLACEHOLDERS (168//)
source: excessive placeholders for identifier '%s'
tr: '%s' tanımlayıcısı için fazladan yer tutucular

# MSG_ERR_NO_LEADING_BRACKET (169//)
source: missing '(' for identifier '%s'
tr: '%s' tanımlayıcısı için eksik '(' işareti

# MSG_ERR_NO_TRAILING_BRACKET (170//)
source: missing ')' for identifier '%s'
tr: '%s' tanımlayıcısı için eksik ')' işareti

# MSG_ERR_DOUBLE_ID (171//)
source: ID number used twice for identifier '%s'
tr: '%s' tanımlayıcısı için ID numarası iki kez kullanılmış

# MSG_ERR_NO_MIN_LEN (172//)
source: expected MinLen (character '/') for identifier '%s'
tr: '%s' tanımlayıcısı için MinLen ('/' karakteri) bekleniyordu

# MSG_ERR_NO_MAX_LEN (173//)
source: expected MaxLen (character '/') for identifier '%s'
tr: '%s' tanımlayıcısı için MaxLen ('/' karakteri) bekleniyordu

# MSG_ERR_EXTRA_CHARACTERS (174//)
source: extra characters at the end of the line
tr: satır sonunda fazlalık karakterler

# MSG_ERR_EXTRA_CHARACTERS_ID (175//)
source: extra characters at the end of the line for identifier '%s'
tr: '%s' tanımlayıcısı için satır sonunda fazlalık karakterler

# MSG_ERR_NON_ASCII_CHARACTER (176//)
source: non-ASCII character 0x%02x found in original string for identifier '%s'
tr: Özgün metinde ASCII-dışı 0x%02x karakteri bulundu ('%s' tanımlayıcısı için)

# MSG_ERR_NO_CAT_REVISION (177//)
source: no catalog revision information found, using revision 0
tr: hiçbir katalog revizyon bilgisi bulunamadı, revizyon 0 kullanılıyor

# MSG_ERR_CONVERSION_FAILED (178//)
source: UTF8 conversion failed for identifier '%s'
tr: '%s' açıklayıcısı için UTF8 çevrimi başarısız oldu

# MSG_ERR_UNKNOWN_SOURCE_CHARSET (179//)
source: ERROR in CodesetsFind(): unknown source charset '%s'
tr: CodesetsFind()'da HATA: bilinmeyen kaynak karakter seti '%s'

# MSG_ERR_UNKNOWN_DESTINATION_CHARSET (180//)
source: ERROR in CodesetsFind(): unknown destination charset '%s'
tr: CodesetsFind()'da HATA: bilinmeyen hedef karakter seti '%s'

# MSG_ERR_INVALID_CHARS_FOUND (181//)
source: ERROR in CodesetsConvertStr(): %d invalid characters found
tr: CodesetsConvertStr()'de HATA: %d geçersiz karakter bulundu

# MSG_ERR_ICONV_FAILED (182//)
source: ERROR in iconv(): %s
tr: iconv()'de HATA: %s

# MSG_ERR_ICONV_OPEN_FAILED (183//)
source: ERROR in iconv_open(): %s
tr: iconv_open()'da HATA: %s
