Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlistviews_mcp/locale/*.po
Languages: french, german, italian

# MSG_FONTS (0//)
source: Fonts
french: Polices
german: Schriftarten
italian: Font

# MSG_NORMAL_FONT (1//)
source: Normal Font:
french: Police normale:
german: Normal:
italian: Normale:

# MSG_NORMAL_FONT_HELP (2//)
source: Choose the normal NList font.
french: Choisissez une police normale pour Nlist.
german: Wählen Sie die normale Schriftart für NList-Objekte
italian: Scegli un font NList normale.

# MSG_NORMAL_FONT_ASL (3//)
source: Please select the normal font...
french: SVP, choisissez une police normale...
german: Bitte wählen Sie die normale Schriftart...
italian: Per favore seleziona un font normale...

# MSG_SMALL_FONT (4//)
source: Small Font:
french: Petite police:
german: Klein:
italian: Piccolo:

# MSG_SMALL_FONT_HELP (5//)
source: Choose the small NList font.
french: Choisissez une petite police pour Nlist.
german: Wählen Sie die kleine Schriftart für NList-Objekte
italian: Scegli un font NList piccolo.

# MSG_SMALL_FONT_ASL (6//)
source: Please select a small font...
french: SVP, choisissez une petite police...
german: Bitte wählen Sie die kleine Schriftart...
italian: Per favore seleziona un font piccolo...

# MSG_FIXED_FONT (7//)
source: Fixed Font:
french: Police fixe:
german: Fest:
italian: Fisso:

# MSG_FIXED_FONT_HELP (8//)
source: Choose the fixed NList font.
french: Choisissez une police fixe pour Nlist.
german: Wählen Sie die Schriftart mit fester Breite für NList-Objekte
italian: Scegli un font NList fisso.

# MSG_FIXED_FONT_ASL (9//)
source: Please select a fixed font...
french: SVP, choisissez une police fixe...
german: Bitte wählen Sie die Schriftart mit fester Breite...
italian: Per favore seleziona un font fisso...

# MSG_FONT_MARGIN (10//)
source: Font Margin:
french: Marge
german: Rand:
italian: Margine:

# MSG_FONT_MARGIN_HELP (11//)
source: Allows to set a vertical margin which will be added to the font height and result in the default line height in an NList object.
french: Permet de choisir une marge verticale. Celle-ci sera ajoutée à la hauteur de la police et le résultat sera la hauteur par défaut d'une ligne dans un objet Nlist.
german: Erlaubt das Setzen eines vertikalen Rands, der zur Schrifthöhe hinzuaddiert wird und den Standardhöhe eines Eintrags in einem NList-Objekt ergibt.
italian: Permette l'impostazione di un margine verticale che verrà aggiunto all'altezza finale del carattere. Questa influirà quindi anche sull'altezza predefinita della riga di un oggetto NList.

# MSG_COLORS (12//)
source: Colors
french: Couleurs
german: Farben
italian: Colori

# MSG_TEXTCOLOR (13//)
source: Text Pen
french: Couleur du texte
german: Text
italian: Penna testo

# MSG_BACKGROUNDCOLOR (14//)
source: Background
french: Couleur du fond
german: Hintergrund
italian: Sfondo

# MSG_TITLE_PEN_WIN (15//)
source: Title Pen
french: Couleur du titre
german: Titel
italian: Penna titolo

# MSG_TITLE_PEN_HELP (16//)
source: For adjusting the pen color of a title.
french: Pour ajuster la couleur du texte dans un titre.
german: Ändert die Schriftfarbe der Titelzeile.
italian: Modifica il colore della penna per il titolo.

# MSG_PBG_TITLE (17//)
source: \033cTitle
french: \033cTitre
german: \033cTitel
italian: \033cTitolo

# MSG_TITLE_BG_WIN (18//)
source: Title Background
french: Couleur du fond
german: Titelhintergrund
italian: Sfondo titolo

# MSG_TITLE_BG_HELP (19//)
source: For adjusting the background color of a title.
french: Pour ajuster la couleur du fond dans un titre.
german: Ändert die Hintergrundfarbe der Titelzeile.
italian: Modifica il colore di sfondo del titolo.

# MSG_LIST_PEN_WIN (20//)
source: List Pen
french: Couleur de liste
german: Liste
italian: Penna lista

# MSG_LIST_PEN_HELP (21//)
source: For adjusting the pen color of a list.
french: Pour ajuster la couleur du texte dans une liste.
german: Ändert die Schriftfarbe der Liste.
italian: Modifica il colore della penna per la lista.

# MSG_PBG_LIST (22//)
source: \033cList
french: \033cListe
german: \033cListe
italian: \033cLista

# MSG_LIST_BG_WIN (23//)
source: List Background
french: Couleur du fond
german: Listenhintergrund
italian: Sfondo lista

# MSG_LIST_BG_HELP (24//)
source: For adjusting the background color of a list.
french: Pour ajuster la couleur du fond dans une liste.
german: Ändert die Hintergrundfarbe der Liste.
italian: Modifica il colore di sfondo della lista.

# MSG_SELECT_PEN_WIN (25//)
source: Selected Entry
french: Entrée sélectionnée
german: Ausgewählter Eintrag
italian: Voce selezionata

# MSG_SELECT_PEN_HELP (26//)
source: For adjusting the pen color of selected entries.
french: Pour ajuster la couleur du texte pour les entrées sélectionnées.
german: Ändert die Schriftfarbe eines ausgewählten Eintrags.
italian: Modifica il colore della penna per la voce selezionata.

# MSG_PBG_SELECT (27//)
source: \033cSelected
french: \033cSélectionnée
german: \033causgewählt
italian: \033cSelezione

# MSG_SELECT_BG_WIN (28//)
source: Selected Entry
french: Entrée sélectionnée
german: Hintergrund des ausgewählten Eintrags
italian: Voce selezionata

# MSG_SELECT_BG_HELP (29//)
source: For adjusting the background color of selected entries.
french: Pour ajuster la couleur du fond pour les entrées sélectionnées.
german: Ändert die Hintergrundfarbe des ausgewählten Eintrags.
italian: Modifica il colore di sfondo della voce selezionata.

# MSG_CURSOR_PEN_WIN (30//)
source: Selected Cursor
french: Curseur sélectionnée
german: Cursor
italian: Cursore selezionato

# MSG_CURSOR_PEN_HELP (31//)
source: For adjusting the pen color of a selected cursor.
french: Pour ajuster la couleur pour le curseur sélectionné.
german: Ändert die Schriftfarbe des Cursors.
italian: Modifica il colore della penna per il cursore selezionato.

# MSG_PBG_CURSOR (32//)
source: \033cCursor
french: \033cCurseur
italian: \033cCursore

# MSG_CURSOR_BG_WIN (33//)
source: Selected Cursor
french: Couleur de fond
german: Hintergrund des ausgewählten Cursors
italian: Cursore selezionato

# MSG_CURSOR_BG_HELP (34//)
source: For adjusting the background color of a selected cursor.
french: Pour ajuster la couleur du fond pour le curseur sélectionné.
german: Ändert die Hintergrundfarbe des ausgewählten Cursors.
italian: Modifica il colore di sfondo del cursore selezionato.

# MSG_UNSEL_PEN_WIN (35//)
source: Unselected Cursor
french: Curseur non sélectionné
german: nicht ausgewählter Cursor
italian: Cursore deselezionato

# MSG_UNSEL_PEN_HELP (36//)
source: For adjusting the pen color of an unselected cursor.
french: Pour ajuster la couleur du texte pour le curseur non sélectionné.
german: Ändert die Schriftfarbe des nicht ausgewählten Cursors.
italian: Modifica il colore della penna per il cursore deselezionato.

# MSG_PBG_UNSEL (37//)
source: \033cUnselected
french: \033cNon sélectionné
german: \033cnicht ausgewählt
italian: \033cDeselezione

# MSG_UNSEL_BG_WIN (38//)
source: Unselected Cursor
french: Couleur de fond
german: nicht ausgewählter Cursor
italian: Cursore deselezionato

# MSG_UNSEL_BG_HELP (39//)
source: For adjusting the background color of an unselected cursor.
french: Pour ajuster la couleur du fond pour le curseur non sélectionné.
german: Ändert die Hintergrundfarbe des nicht ausgewählten Cursors.
italian: Modifica il colore di sfondo del cursore deselezionato.

# MSG_INACT_PEN_WIN (40//)
source: Inactive Cursor
french: Curseur inactif
german: Inaktiver Cursor
italian: Cursore inattivo

# MSG_INACT_PEN_HELP (41//)
source: For adjusting the pen color of an inactive cursor.
french: Pour ajuster la couleur pour pour le curseur inactif.
german: Ändert die Schriftfarbe des inaktiven Cursors.
italian: Modifica il colore di sfondo del cursore inattivo.

# MSG_PBG_INACT (42//)
source: \033cInactive
french: \033cInactif
german: \033cinaktiv
italian: \033cInattivo

# MSG_INACT_BG_WIN (43//)
source: Inactive Cursor
french: Curseur du fond
german: Inaktiver Cursor
italian: Cursore inattivo

# MSG_INACT_BG_HELP (44//)
source: For adjusting the background color of an inactive cursor.
french: Pour ajuster la couleur du fond pour pour le curseur inactif.
german: Ändert die Hintergrundfarbe des inaktiven Cursors.
italian: Modifica il colore di sfondo del cursore inattivo.

# MSG_MULTISELECT (45//)
source: MultiSelection
french: Sélection multiple
german: Mehrfachauswahl
italian: Selezione multipla

# MSG_MULTISELECT_QUAL (46//)
source: via Qualifier
french: Avec touches
german: mittels Tastenkombination
italian: Via qualificatore

# MSG_MULTISELECT_ALWAYS (47//)
source: Always
french: Toujours
german: immer
italian: Sempre

# MSG_MULTISELECT_HELP (48//)
source: Allows to specify the default multiselection mode.
french: Permet de spécifier le mode de sélection multiple par défaut.
german: Legt das Standardverhalten für Mehrfachauswahl fest.
italian: Permette di specificare la modalità di selezione multipla predefinita.

# MSG_MMB_MULTISEL (49//)
source: MMB multiselection
french: Sélection multiple avec MMB
german: MMB Mehrfachauswahl
italian: Selezione multipla (MMB)

# MSG_MMB_MULTISEL_HELP (50//)
source: Set it if you want to use the middle mouse button (MMB) as a multiselection qualifier.
french: Permet de choisir le bouton du milieu (MMB) comme mode de sélection multiple.
german: Falls aktiv wird die mittlere Maustaste als Tastenkombination für die Mehrfachauswahl genutzt.
italian: Imposta questa opzione se si desidera usare il tasto centrale del mouse (MMB) come qualificatore per la selezione multipla.

# MSG_DRAGDROP (51//)
source: Drag&Drop
french: Glisser & Déposer

# MSG_DRAGTYPE_IMMEDIATE (52//)
source: Immediate
french: Immédiat
german: sofort
italian: Immediato

# MSG_DRAGTYPE_BORDERS (53//)
source: at Borders
french: Avec bordures
german: am Rand
italian: Sul bordo

# MSG_DRAGTYPE_QUALIFIER (54//)
source: via Qualifier
french: Avec touches
german: mittels Tastenkombination
italian: Via qualificatore

# MSG_DRAGTYPE_HELP (55//)
source: Set the drag mode. 'Immediate' will start drag&drop as soon as you drag an object. 'at Borders' for showing a drag operation as soon as you passed the left/right borders and 'via Qualifier' for only allowing to drag&drop via a qualifier key (see 'Keys'). 'Immediate' is used only when in no-multiselect mode.
french: Défini le fonctionnement du Glisser & Déposer. 'Immédiat' démarre le Glisser & Déposer avec la saisie d'un objet. 'Avec bordures' démarre le Glisser & Déposer lors du passage sur les bordures 'Avec touches' démarre le Glisser & Déposer avec des touches (Voir 'Touches'). 'Immédiat' est utilisé seulement lorsqu'il n'y à pas de mode sélection multiple actif.
german: Legt den Drag&Drop-Modus fest.
italian: Seleziona il tipo di drag&drop da usare, 'Immediato' avvierà l'operazione non appena si sposterà un oggetto. 'Sul bordo' mostrerà l'operazione di spostamento appena ci si sposterà sui bordi sinistro o destro. 'Via qualificatore' permetterà l'operazione di drag&drop solo nel caso venga usato un tasto specifico (vedi 'Assoc. Tasti') L'opzione 'Immediato' infine può essere usata nel caso non sia stata impostata alcuna modalità di selezione multipla.

# MSG_DRAG_LINES (56//)
source: Visible lines
french: Lignes visibles
german: sichtbare Zeilen
italian: Linee visibili

# MSG_DRAG_LINES_HELP (57//)
source: Give the max. number of lines which will be shown when doing drag&drop. If more lines are selected, you'll get a message similar to: 'Dragging xx Items...'.
french: Règle le nombre maxi. de lignes qui seront montrées pendant un Glisser & Déposer. Si plus de lignes sont sélectionnées, vous verrez un message: Glisse & Dépose xx lignes...'.
german: Legt die maximal sichtbaren Zeilen während einer Drag&Drop-Aktion fest. Falls mehr Zeilen ausgewählt sind wird statt dessen der Text 'Dragging <x> items...' angezeigt.
italian: Specifica il numero massimo di linee da mostrare durante le operazioni di drag&drop. Selezionando più linee si otterrà un messaggio del tipo: 'Spostamento di xx oggetti...'

# MSG_PAGE_FONTS (58//)
source: Fonts
french: Polices
german: Schriftarten
italian: Font

# MSG_PAGE_COLORS (59//)
source: Colors
french: Couleurs
german: Farben
italian: Colori

# MSG_PAGE_SCROLLING (61//)
source: Scrolling
french: Défilement
german: Rollen

# MSG_PAGE_KEYBINDINGS (62//)
source: Keybindings
french: Touches
german: Tasten
italian: Associazione tasti

# MSG_SB_HORIZONTAL (63//)
source: Horizontal Scrollbar
french: Déplacement horizontal
german: Horizontaler Rollbalken
italian: Barra di scorrimento orizzontale

# MSG_SB_HORIZONTAL_HELP (64//)
source: Set the default mode for the horizontal scrollbar. (may be overwritten by an application)
french: Règle le mode par défaut pour un déplacement horizontal. (Peut être remplacé par l'application en elle-même).
german: Legt des Standardmodus für den horizontalen Rollbalken fest (kann von der Applikation ignoriert werden).
italian: Imposta la modalità predefinita per la barra di scorrimento orizzontale. (può essere sovrascritta da un'applicazione)

# MSG_SB_VERTICAL (65//)
source: Vertical Scrollbar
french: Déplacement vertical
german: Vertikaler Rollbalken
italian: Barra di scorrimento verticale

# MSG_SB_VERTICAL_HELP (66//)
source: Set the default mode for the vertical scrollbar. (may be overwritten by an application)
french: Règle le mode par défaut pour un déplacement vertical. (Peut être remplacé par l'application en elle-même).
german: Legt des Standardmodus für den vertikalen Rollbalken fest (kann von der Applikation ignoriert werden).
italian: Imposta la modalità predefinita per la barra di scorrimento verticale. (può essere sovrascritta da un'applicazione)

# MSG_SCROLLCONTROL (67//)
source: Scrolling Control
french: Réglages des déplacements
german: Kontrolle
italian: Controllo scrolling

# MSG_SMOOTH_SCROLLING (68//)
source: Smooth Scrolling
french: Déplacement fluide
german: sanftes Rollen
italian: Scrolling veloce

# MSG_SMOOTH_SCROLLING_HELP (69//)
source: If enabled, smoothing scrolling will be used for NList objects. In addition, by using the 'smooth' slider in the normal MUI 'Listview' configuration page the speed of the smooth scrolling can be controled.
french: Si sélectionné, un déplacement fluide sera utilisé pour les objets Nlist. De plus, en utilisant le gadget 'fluidité' dans le menu MUI 'Listes -> Contrôle' dans les configurations de MUI, la vitesse du déplacement fluide sera contrôlable.
german: Falls aktiv werden die Listen sanft gerollt.
italian: Se selezionato verrà usato uno scrolling veloce per tutti gli oggetti NList, Inoltre usando congiuntamente lo scorrimento rapido impostabile dalle configurazioni base di MUI sarà possibile contrallarne la velocità.

# MSG_MMB_FASTWHEEL (70//)
source: MMB Fast Wheel
french: MMB molette rapide
german: schnelles Mausrad
italian: Velocità rotellina del mouse (MMB)

# MSG_MMB_FASTWHEEL_HELP (71//)
source: If enabled, the middle mouse button can be used as a qualifier to perform a fast scroll wheel action. (See 'Keybindings' page as well for more wheel qualifiers)
french: Si sélectionné, le bouton du milieu pourra être utilisé comme action de déplacement rapide avec une molette. (Voir la page 'Touches' pour les autres réglages possible avec la molette).
german: Falls aktiv kann die mittlere Maustaste genutzt werden um das Rollen zu beschleunigen.
italian: Se selezionato il tasto centrale del mouse potrà essere usato come qualificatore per la gestione dello scrolling veloce usando la rotellina del mouse. (Vedi 'Associazione tasti' per altri dettagli)

# MSG_WHEEL_STEP (72//)
source: Mouse Wheel Step
french: Pas (dépl. molette normal)
german: Mausrad-Schritte
italian: Step della rotellina del mouse

# MSG_WHEEL_STEP_HELP (73//)
source: Allows to specify the amount of lines that should be scrolled when using a wheel mouse.
french: Permet de spécifier le nombre de lignes à déplacer en une fois pour une utilisation normale avec la molette de la souris.
german: Gibt an um wie viele Zeilen bei Betätigung des Mausrades gerollt wird.
italian: Permette di impostare il numero di linee da scrollare quando si utilizza la rotellina del mouse.

# MSG_WHEEL_FAST (74//)
source: Mouse Wheel Fast Step
french: Pas (dépl. molette rapide)
german: schnelle Mausrad-Schritte
italian: Step di velocità della rotellina del mouse

# MSG_WHEEL_FAST_HELP (75//)
source: Allows to specify the amount of lines that should be scrolled when using a wheel mouse and when the fast wheel qualifier is pressed.
french: Permet de spécifier le nombre de lignes à déplacer en une fois pour une utilisation rapide avec la molette de la souris.
german: Gibt an um wie viele Zeilen bei Betätigung des Mausrades und der Tastenkombination für das schnelle Mausrad gerollt wird.
italian: Permette di impostare il numero di linee che dovranno essere scrollate quando si usa la rotellina o quando il qualificatore di velocità della rotellina sia stato premuto.

# MSG_LAYOUT (76//)
source: Layout
french: Mise en page

# MSG_PARTIAL_COL_MARK (77//)
source: Partial column mark
french: Marquage partiel colonne
german: Partielle Spalten markieren
italian: Marcatura parziale della colonna

# MSG_PARTIAL_COL_MARK_HELP (78//)
source: If enabled, a special mark will be drawn at the right side of a column in case the text didn't completly fit into it.
french: Si sélectionné, un signe spécial sera utilisé du coté droit de la colonne lorsque le texte ne pourra pas être complètement utilisé.
german: Falls aktiv wird eine Markierung auf der rechten Seite einer Spalte dargestellt, falls der Text nicht komplett dargestellt werden kann.
italian: Se selezionato, verrà disegnata un'apposita marcatura sul lato destro della colonna nel caso il testo non sia in grado di rientrare nello spazio disponibile.

# MSG_PARTIAL_CHARS_DRAWN (79//)
source: Partial chars drawn
french: Caractères partiel dessiné
german: Partielle Zeichen darstellen
italian: Disegno parziale dei caratteri

# MSG_PARTIAL_CHARS_DRAWN_HELP (80//)
source: If enabled, characters that are not fully visible at the left and right corner of an NList object will not be drawn partially.
french: Si sélectionné, les caractères non visible complètement à droite ou à gauche d'un objet Nlist ne seront pas dessinés partiellement.
german: Falls aktiv werden Zeichen, die nicht komplett dargestellt werden können zumindest noch teilweise dargestellt.
italian: Se selezionato, i caratteri non pienamente visibili nell'angolo destro e sinistro di un oggetto NList non verranno disegnati in modo parziale.

# MSG_VERT_CENTERED (81//)
source: Vertical centered lines
french: Lignes verticales centrés
german: vertikal zentrierte Zeilen
italian: Linee verticali centrate

# MSG_VERT_CENTERED_HELP (82//)
source: If activated, the text lines are centered vertically in a NList object.
french: Si sélectionné, les lignes de texte seront centrés verticalement dans les objets Nlist.
german: Falls aktiv werden die Textzeilen vertikal zentriert.
italian: Se attivato le linee di testo verranno centrate verticalmente negli oggetti NList.

# MSG_BALANCING_COLS (83//)
source: Balancing Columns
french: Déplacement colonnes
german: Balancing Spalten
italian: Allineamento colonne

# MSG_BALANCING_COLS_HELP (84//)
source: NList permits to change the column width via mouse dragging the column separator in the title bar. The moved bar can be visible either only in the title, throughout the whole lines or the column width changes can be made visible instantly.
french: Nlist permet de changer la largeur des colonnes par déplacement du séparateur de colonne, dans la barre de titre, avec la souris. Ce déplacement peut être visible seulement dans le titre, ou alors à travers toutes les lignes ou le changement de largeur de la colonne peut aussi simplement être visible constamment.
german: NList erlaubt das Ändern der Spaltenbreite mit der Maus durch Bewegen der Spaltenmarkierung in der Titelzeile. Während des Bewegens kann die Markierung entweder nur in der Titelzeile ange- zeigt werden, in allen Zeilen, oder die Änderungen werden sofort dargestellt.
italian: NList permette di modificare la larghezza delle colonne usando il mouse e trascinando il suo separatore. La barra spostata puà rimanere visibile anche nel solo titolo. Tutte le sue linee possono essere modificate tornando immediatamente visibili.

# MSG_COLWIDTHDRAG_TITLE (85//)
source: Title Bar
french: Barre de titre
german: Titelzeile
italian: Barra del titolo

# MSG_COLWIDTHDRAG_FULLBAR (86//)
source: Full Bar
french: Barre complète
german: alle Zeilen
italian: Barra completa

# MSG_FORCE_SELECT_PEN (89//)
source: Force select pen
french: Forcer couleur sélectionnée
italian: Forza selezione penna

# MSG_FORCE_SELECT_PEN_HELP (90//)
source: If enabled, NList will make sure that the 'Selected', 'Cursor' and 'Unselected' color will be forced.
french: Si sélectionné, Nlist vérifiera bien que la couleur dans 'Sélectionné', 'Curseur' et (Non sélectionné' sera bien forcé.
italian: Se selezionato la classe NList accerterà che i colori dello stato di 'Selezione', 'Cursore' e 'Deselezione' vengano forzati.

# MSG_MULTISEL_MOVEACTIVE (91//)
source: Keyboard moves cursor
french: Clavier déplace le curseur
german: Tastatur bewegt Cursor
italian: Usa tastiera per muovere il cursore

# MSG_MULTISEL_MOVEACTIVE_HELP (92//)
source: If enabled, a keyboard use in an NList object will move the active cursor rather than the unselected one.
french: Si sélectionné, un déplacement au clavier dans un objet Nlist déplacera le curseur actif plutôt que le curseur non sélectionné.
german: Fall aktiv wird über die Tastatur der aktive Cursor anstatt dem inaktiven bewegt.
italian: Se selezionato i tasti utilizzati in un oggetto NList muoveranno il cursore attivo anzichè quello non selezionato.

# MSG_GROUP_MISC (93//)
source: Miscellaneous
french: Divers
german: Verschiedenes
italian: Varie

# MSG_GROUP_EXAMPLE (94//)
source: Example
french: Exemple
german: Beispiel
italian: Esempio

# MSG_SERMOUSE_FIX (95//)
source: Serial Mouse Fix
french: Fix souris (port série)
german: Fix für serielle Maus
italian: Fix per mouse seriale

# MSG_SERMOUSE_FIX_HELP (96//)
source: If enabled, NList tries to fix common drag&drop issues that are related to using a serial mouse.
french: Si sélectionné, Nlist tentera de fixer les problèmes connus de Glisser&Déposer en relation avec l'utilisation d'une souris sur le port série.
german: Fall aktiv versucht NList bekannte Probleme im Zusammenspiel mit seriellen Mäusen zu umgehen.
italian: Se selezionato, NList tenterà di risolvere i comuni problemi di drag&drop che si riscontrano durante l'utilizzo di alcuni mouse seriali.

# MSG_SELECT_POINTER (97//)
source: Custom Select Pointer
french: Pointeur de sélection perso.
german: Auswahl-Mauszeiger
italian: Puntatore di selezione personalizzato

# MSG_SELECT_POINTER_HELP (98//)
source: If enabled, and an NList object is in charwise selection mode a custom select pointer will be displayed instead of the default workbench mouse pointer image.
french: Si sélectionné et si un objet Nlist est en mode de sélection, un pointeur de sélection personnalisé sera utilisé plutôt que le pointeur par défaut du workbench.
german: Falls aktiv und das NList-Objekt zeichenweises Markieren ermöglicht wird der Mauszeiger in einen Auswahlzeiger anstatt dem normalen Bild geändert.
italian: Se selezionato e l'oggetto NList è impostato nella sua modalità di selezione corretta verrà mostrato un puntatore di selezione personalizzato al posto dell'immagine standard del puntatore del mouse presente sul Workbench.

# MSG_BAR_CONTEXTMENU (99//)
source: Context Menu
french: Contexte Menu
german: Kontextmenü
italian: Menu contestuali
