Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlistviews_mcp/locale/*.po
Languages: french, german, italian

# MSG_DEFAULT_CONTEXT_MENU_HELP (100//)
source: NList permits to have its default context menu being disabled or enabled or only in case the mouse is at the top of the NList object.
french: Nlist utilisera son contexte menu par défaut en mode actif ou non actif ou juste dans le cas ou la souris sera positionné sur un objet Nlist.
german: Falls aktiv haben NList-Objekte ein Standard- kontextmenü. Ansonsten ist dieses Menü nur bei einem Klick in der Titelzeile verfügbar.
italian: NList permette di attivare o disattivare i suoi menu contestuali, oppure di attivarli solo nel caso il mouse sia in cima ad un oggetto NList.

# MSG_SNOOP (101//)
source: Snoop
french: Analyse
german: Lauschen

# MSG_SNOOP_KEY (102//)
source: Start the grab of a hotkey.
french: Démarre la capture d'un raccourci clavier
german: Startet das Lauschen einer Tastenkombination
italian: Preleva l'associazione di tasti.

# MSG_BUTTON_INSERT (103//)
source: Insert
french: Insérer
german: Einfügen
italian: Inserisci

# MSG_BUTTON_INSERT_HELP (104//)
source: Allows to insert a new hotkey.
french: Permet d'insérer un nouveau raccourci clavier
german: Fügt eine neue Tastenkombination ein
italian: Permette l'inserimento di una nuova associazione di tasti.

# MSG_BUTTON_REMOVE (105//)
source: Remove
french: Supprimer
german: Entfernen
italian: Rimuovi

# MSG_BUTTON_REMOVE_HELP (106//)
source: Allows to remove an existing hotkey.
french: Permet de supprimer un raccourci clavier existant
german: Entfernt eine Tastenkombination
italian: Rimuove un'associazione già esistente.

# MSG_BUTTON_UPDATEKEYS (107//)
source: Update keys
french: Mise à jour
german: Ergänzen
italian: Aggiorna tasti

# MSG_BUTTON_UPDATEKEYS_HELP (108//)
source: Add the default hotkeys for the functions which are not currently in the list.
french: Ajoute les raccourcis par défaut pour les fonctions qui ne sont pas actuellement dans la liste.
german: Fügt alle Standardtastenkombinationen hinzu, für die noch keine eigenen Kombination fest- gelegt wurde.
italian: Aggiunge un'associazione di tasti predefinita per le funzionalità non ancora impostate nella lista.

# MSG_BUTTON_DEFAULTKEYS (109//)
source: Default keys
french: Touches par défaut
german: Standardtasten
italian: Tasti predefiniti

# MSG_BUTTON_DEFAULTKEYS_HELP (110//)
source: Resets all hotkeys to default ones.
french: Remplace tous les raccourcis par ceux par défaut.
german: Stellt alle Tastenkombinationen auf Standard zurück.
italian: Resetta tutte le associazioni dei tasti ai valori predefiniti.

# MSG_FUNC_MULTISELQUAL (111//)
source: Multiselect/Block Qualifier
french: Sélection multiple/Block
german: Mehrfachauswahl/Block
italian: Selezione multipla/Qualificatore blocco

# MSG_FUNC_DRAGQUAL (112//)
source: Drag&Drop Qualifier
french: Glisser & Déposer
german: Drag&Drop
italian: Qualificatore Drag&Drop

# MSG_FUNC_BALANCEQUAL (113//)
source: Balance Qualifier
french: Déplacement
german: Balance
italian: Qualificatore di bilanciamento

# MSG_FUNC_COPYCLIP (114//)
source: Copy to clipboard
french: Copier dans presse-papiers
german: Kopieren ins Clipboard
italian: Copia nella clipboard

# MSG_FUNC_DEFCOLWIDTH (115//)
source: Default width column
french: Largeur de la colonne par défaut
german: Standard Spaltenbreite
italian: Larghezza predefinita della colonna

# MSG_FUNC_DEFALLCOLWIDTH (116//)
source: Default width all columns
french: Largeur des colonnes par défaut
german: Standard Spaltenbreite (alle)
italian: Larghezza predefinita per tutte le colonne

# MSG_FUNC_DEFORDERCOL (117//)
source: Default order column
french: Ordre de la colonne par défaut
german: Standard Spaltenreihenfolge
italian: Ordine predefinito della colonna

# MSG_FUNC_DEFALLORDERCOL (118//)
source: Default order all columns
french: Ordre des colonnes par défaut
german: Standard Spaltenreihenfolge (alle)
italian: Ordine predefinito per tutte le colonne

# MSG_FUNC_SELECTTOP (119//)
source: Select to top
french: Haut maxi
german: bis zum Anfang auswählen
italian: Paragrafo precedente

# MSG_FUNC_SELECTBOTTOM (120//)
source: Select to bottom
french: Bas maxi
german: bis zum Ende auswählen
italian: Paragrafo successivo

# MSG_FUNC_SELECTPAGEUP (121//)
source: Select to page up
french: 1 page haut
german: Seite aufwärts auswählen
italian: Pagina su

# MSG_FUNC_SELECTPAGEDOWN (122//)
source: Select to page down
french: 1 page bas
german: Seite abwärts auswählen
italian: Pagina giù

# MSG_FUNC_SELECTUP (123//)
source: Select up
french: Haut
german: aufwärts auswählen
italian: Inizio

# MSG_FUNC_SELECTDOWN (124//)
source: Select down
french: Bas
german: abwärts auswählen
italian: Fine

# MSG_FUNC_TOGGLEACTIVE (125//)
source: Toggle active
french: Actif on/off
german: Auswahl umschalten
italian: Alterna su attivo

# MSG_FUNC_FASTWHEELQUAL (126//)
source: Fast MouseWheel Qualifier
french: Touche molette rapide
german: schnelles Mausrad
italian: Rotellina del mouse veloce

# MSG_FUNC_HORIZWHEELQUAL (127//)
source: Horiz MouseWheel Qualifier
french: Touche molette horizontale
german: horizontales Mausrad
italian: Rotellina del mouse in orizzontale

# MSG_FUNC_TITLECLICKQUAL (128//)
source: Title Click Qualifier
french: Touche title Click
german: Titelklick
italian: Qualificatore click del titolo

# MSG_VSB_ALWAYS (129//)
source: Always
french: Toujours
german: immer
italian: Sempre

# MSG_VSB_AUTO (130//)
source: Auto
french: Automatique
german: automatisch
italian: Automatica

# MSG_VSB_FULLAUTO (131//)
source: FullAuto
french: Auto. complet
german: vollautomatisch
italian: Completa

# MSG_HSB_ALWAYS (132//)
source: Always
french: Toujours
german: immer
italian: Sempre

# MSG_HSB_AUTO (133//)
source: Auto
french: Automatique
german: automatisch
italian: Automatica

# MSG_HSB_FULLAUTO (134//)
source: FullAuto
french: Auto. complet
german: vollautomatisch
italian: Completa

# MSG_HSB_NONE (135//)
source: None
french: Non
german: keine
italian: Nessuna

# MSG_CMENU_ALWAYS (136//)
source: Always
french: Toujours
german: immer
italian: Sempre

# MSG_CMENU_TOPONLY (137//)
source: TopOnly
french: Haut seul
german: nur Titelzeile

# MSG_CMENU_NEVER (138//)
source: Never
french: Jamais
german: nie
italian: Mai

# MSG_HOTKEYS_KEY (139//)
source: Key
french: Touche
german: Tastenkombination
italian: Tasto

# MSG_PAGE_OPTIONS (60//)
source: Options
german: Optionen
italian: Opzioni

# MSG_COLWIDTHDRAG_VISIBLE (87//)
source: Visible
german: sichtbar
italian: Barra visibile

# MSG_COLOR_OPTIONS (88//)
source: Options
german: Optionen
italian: Opzioni

# MSG_HOTKEYS_ACTION (140//)
source: Action
german: Aktion
italian: Azione

# MSG_EXAMPLE_TEXT (141//)
source: If you have problems, try to increase the stack value, in the icon infos if you launch the program from icon, stack of CLI if you start it from CLI/Shell, and if you launch it from some utility read its docs to see how to increase it. A stack of 12Kb, 16Kb or 20Kb is most of time a good idea. If you still have problems, try to see if they happen with the Demo prog, then tell me. \033C Latest public release can be found on aminet (dev/mui). All releases are available on http://www.sourceforge.net/projects/nlist-classes/ \033C \033r\0333(C) 2001-2013 by NList Open Source Team \033r\0333(C) 1996-1998 by Gilles Masson \033r\0333http://www.sourceforge.net/projects/nlist-classes/ \033C \033cThis new list/listview custom class \033chandles its own configurable backgrounds, \033cpens, fonts, scrollbars, keys and qualifiers \033C \033cThe way used to handle cursor with multiselection \033cis not exactly as the listview one ! \033cDrag&Drop is supported, both scrollbars \033ccan be configured to disappear automatically \033cwhen not needed because all is visible. \033cJust try it... \033C \033cYou can horizontaly scroll with cursor keys, \033cor going on the right and left of the list \033cwhile selecting with the mouse. \033cTry just clicking on the left/right borders ! \033C \033cYou can change columns widths just dragging \033cthe vertical separator between columns titles \033c(try it using the balancing qualifier too). \033C \033cYou can change columns order just dragging \033cthe column titles. \033C \033cThere is builtin copy to clipboard stuff \033cand classic char selection capability. \033C \033cTry the Demo program to test all that... \033r\033bGive some feedback about it ! :-) \033C **************************************************************************************************
italian: \033c\033bBenvenuto, \033cNel caso si riscontrassero problemi prova ad incrementare il valore \033cdello stack dell'icona tramite le informazioni disponibili su di essa, oppure \033cusa la CLI nel caso l'applicazione sia stata avviata da Shell. \033cInfine consulta la documentazione nel caso la classe MUI sia stata \033cavviata attraverso il lancio di applicazioni esterne. \033cIn generale uno stack impostato su 12Kb, 16Kb o 20Kb è più che sufficiente \033cper un qualsiasi tipo di utilizzo. \033cNel caso si continuasse ad avere problemi è possibile verificarne il \033ccorretto funzionamento testando le varie demo incluse nell'archivio \033coppure contattaci segnalando il tuo problema! \033C \033cL'ultima versione di NList è scaricabile da Aminet (dev/mui) oppure da OS4Depot \033cIl sito ufficiale della classe NList è disponibile al seguente indirizzo: \033c\033bhttp://www.sourceforge.net/projects/nlist-classes/ \033C \033c\033b(C) 1996-1998 di Gilles Masson \033c\033b(C) 2001-2013 un progetto a cura del team della NList \033c\033bhttp://www.sourceforge.net/projects/nlist-classes/ \033C \033cQuesta nuova classe MUI list/listview è in grado \033cdi gestire e configurare gli sfondi, le penne, i font, \033cle barre di scorrimento, i tasti, i qualificatori e tanto altro. \033C \033cIl metodo utilizzato per gestire i cursori o le selezioni multiple \033cnon è esattamente come quello disponibile sulla listview, è molto più potente! \033cAnche il Drag&Drop è perfettamente supportato e persino le barre di \033cscorrimento possono essere modificate a proprio piacimento, \033cad esempio rendendele invisibili quando non necessarie. \033cProvale... \033C \033cE' possibile usufruire dello scrolling orizzontale usando i tasti cursore, \033coppure spostarsi a destra o sinistra all'interno di una lista durante \033cle classiche selezioni con il mouse. \033cProva cliccando alla destra o alla sinistra di un bordo! \033C \033cE' possibile modificare la larghezza delle colonne semplicemente \033cmuovendo il suo separatore verticale all'interno delle colonne dei titoli \033c(prova questa funzionalità usando la funzionalità di allineamento delle colonne). \033C \033cE' possibile modificare l'ordine delle colonne semplicemente spostando \033ci titoli delle colonne stesse. \033C \033cOvviamente è disponibile anche una modalità integrata per il copia e incolla nella \033cclipboard, nonchè tutte le classiche funzionalità di selezione dei caratteri.. \033C \033cPer scoprire ciò che questa classe MUI può offire dai un'occhiata ai \033cprogrammi dimostrativi disponibili all'interno dell'archivio della NList.. \033cProvala e dacci il tuo parere ! :-) \033C \033c********************************************************************************************
