Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlistviews_mcp/locale/czech.po
Languages: cs

# MSG_FONTS (0//)
source: Fonts
cs: Písma

# MSG_NORMAL_FONT (1//)
source: Normal Font:
cs: Standardní písmo:

# MSG_NORMAL_FONT_HELP (2//)
source: Choose the normal NList font.
cs: Umožní definovat standardní písmo.

# MSG_NORMAL_FONT_ASL (3//)
source: Please select the normal font...
cs: Vyberte požadované standardní písmo

# MSG_SMALL_FONT (4//)
source: Small Font:
cs: Drobné písmo:

# MSG_SMALL_FONT_HELP (5//)
source: Choose the small NList font.
cs: Umožní definovat drobné písmo.

# MSG_SMALL_FONT_ASL (6//)
source: Please select a small font...
cs: Vyberte požadované drobné písmo

# MSG_FIXED_FONT (7//)
source: Fixed Font:
cs: Fixní písmo:

# MSG_FIXED_FONT_HELP (8//)
source: Choose the fixed NList font.
cs: Umožní definovat fixní písmo.

# MSG_FIXED_FONT_ASL (9//)
source: Please select a fixed font...
cs: Vyberte požadované fixní písmo

# MSG_FONT_MARGIN (10//)
source: Font Margin:
cs: Svislé odsazení

# MSG_FONT_MARGIN_HELP (11//)
source: Allows to set a vertical margin which will be added to the font height and result in the default line height in an NList object.
cs: Definice výšky řádku v rámci objektu třídy NList.

# MSG_COLORS (12//)
source: Colors
cs: Barvy

# MSG_TEXTCOLOR (13//)
source: Text Pen
cs: Barva textu

# MSG_BACKGROUNDCOLOR (14//)
source: Background
cs: Barva pozadí

# MSG_TITLE_PEN_WIN (15//)
source: Title Pen
cs: Barva záhlaví

# MSG_TITLE_PEN_HELP (16//)
source: For adjusting the pen color of a title.
cs: Definuje barvu textu v záhlaví.

# MSG_PBG_TITLE (17//)
source: \033cTitle
cs: \033cZáhlaví

# MSG_TITLE_BG_WIN (18//)
source: Title Background
cs: Barva pozadí záhlaví

# MSG_TITLE_BG_HELP (19//)
source: For adjusting the background color of a title.
cs: Definuje barvu pozadí záhlaví.

# MSG_LIST_PEN_WIN (20//)
source: List Pen
cs: Barva textu v seznamu

# MSG_LIST_PEN_HELP (21//)
source: For adjusting the pen color of a list.
cs: Definuje barvu textu v seznamu.

# MSG_PBG_LIST (22//)
source: \033cList
cs: \033cSeznam

# MSG_LIST_BG_WIN (23//)
source: List Background
cs: Barva pozadí seznamu

# MSG_LIST_BG_HELP (24//)
source: For adjusting the background color of a list.
cs: Definuje barvu pozadí seznamu.

# MSG_SELECT_PEN_WIN (25//)
source: Selected Entry
cs: Barva vybrané položky

# MSG_SELECT_PEN_HELP (26//)
source: For adjusting the pen color of selected entries.
cs: Definuje barvu vybraných položek v seznamu.

# MSG_PBG_SELECT (27//)
source: \033cSelected
cs: \033cVybraná položka

# MSG_SELECT_BG_WIN (28//)
source: Selected Entry
cs: Vybraná položka

# MSG_SELECT_BG_HELP (29//)
source: For adjusting the background color of selected entries.
cs: Definuje barvu pozadí vybraných položek.

# MSG_CURSOR_PEN_WIN (30//)
source: Selected Cursor
cs: Označený kurzor

# MSG_CURSOR_PEN_HELP (31//)
source: For adjusting the pen color of a selected cursor.
cs: Definuje barvu označeného kurzoru.

# MSG_PBG_CURSOR (32//)
source: \033cCursor
cs: \033cKurzor

# MSG_CURSOR_BG_WIN (33//)
source: Selected Cursor
cs: Označený kurzor

# MSG_CURSOR_BG_HELP (34//)
source: For adjusting the background color of a selected cursor.
cs: Definuje barvu pozadí označeného kurzoru.

# MSG_UNSEL_PEN_WIN (35//)
source: Unselected Cursor
cs: Neoznačený kurzor

# MSG_UNSEL_PEN_HELP (36//)
source: For adjusting the pen color of an unselected cursor.
cs: Definuje barvu neoznačeného kurzoru.

# MSG_PBG_UNSEL (37//)
source: \033cUnselected
cs: \033cNeoznačený kurzor

# MSG_UNSEL_BG_WIN (38//)
source: Unselected Cursor
cs: Neoznačený kurzor

# MSG_UNSEL_BG_HELP (39//)
source: For adjusting the background color of an unselected cursor.
cs: Definuje barvu pozadí neoznačeného kurzoru.

# MSG_INACT_PEN_WIN (40//)
source: Inactive Cursor
cs: Neaktivní kurzor

# MSG_INACT_PEN_HELP (41//)
source: For adjusting the pen color of an inactive cursor.
cs: Definuje barvu neoznačeného kurzoru.

# MSG_PBG_INACT (42//)
source: \033cInactive
cs: \033cNeaktivní kurzor

# MSG_INACT_BG_WIN (43//)
source: Inactive Cursor
cs: Neaktivní kurzor

# MSG_INACT_BG_HELP (44//)
source: For adjusting the background color of an inactive cursor.
cs: Definuje barvu pozadí neoznačeného kurzoru.

# MSG_MULTISELECT (45//)
source: MultiSelection
cs: Vícenásobný výběr

# MSG_MULTISELECT_QUAL (46//)
source: via Qualifier
cs: Pomocí klávesy

# MSG_MULTISELECT_ALWAYS (47//)
source: Always
cs: Standardně zapnuto

# MSG_MULTISELECT_HELP (48//)
source: Allows to specify the default multiselection mode.
cs: Definuje způsob výběru více položek najednou.

# MSG_MMB_MULTISEL (49//)
source: MMB multiselection
cs: Prostředním tlačítkem myši

# MSG_MMB_MULTISEL_HELP (50//)
source: Set it if you want to use the middle mouse button (MMB) as a multiselection qualifier.
cs: Aktivuje vícenásobný výběr položek prostředním tlačítkem myši.

# MSG_DRAGDROP (51//)
source: Drag&Drop
cs: Táhnout a pustit

# MSG_DRAGTYPE_IMMEDIATE (52//)
source: Immediate
cs: Bez zpoždění

# MSG_DRAGTYPE_BORDERS (53//)
source: at Borders
cs: Na okrajích

# MSG_DRAGTYPE_QUALIFIER (54//)
source: via Qualifier
cs: Pomocí klávesy

# MSG_DRAGTYPE_HELP (55//)
source: Set the drag mode. 'Immediate' will start drag&drop as soon as you drag an object. 'at Borders' for showing a drag operation as soon as you passed the left/right borders and 'via Qualifier' for only allowing to drag&drop via a qualifier key (see 'Keys'). 'Immediate' is used only when in no-multiselect mode.
cs: Definuje režim metody 'Táhnout a pustit'. V režimu 'Bez zpoždění' lze vybraný objekt přetáhnout okamžitě po vybrání. 'Na okrajích' znamená, že objekty lze táhnout pouze z jejich levého nebo pravého okraje. Vyberete-li 'Pomocí klávesy', bude možné vybrané objekty táhnout pouze za současného držení vybrané klávesy. Pozn.: 'Bez zpoždění' lze použít jen tehdy, pokud není aktivní režim vícenásobného výběru položek.

# MSG_DRAG_LINES (56//)
source: Visible lines
cs: Viditelné řádky

# MSG_DRAG_LINES_HELP (57//)
source: Give the max. number of lines which will be shown when doing drag&drop. If more lines are selected, you'll get a message similar to: 'Dragging xx Items...'.
cs: Definuje max. počet řádků viditelných během táhnutí objektu. Vyberete-li více řádků, NList zobrazí text "Počet táhnutých položek: xy".

# MSG_PAGE_FONTS (58//)
source: Fonts
cs: Písma

# MSG_PAGE_COLORS (59//)
source: Colors
cs: Barvy

# MSG_PAGE_OPTIONS (60//)
source: Options
cs: Možnosti

# MSG_PAGE_SCROLLING (61//)
source: Scrolling
cs: Posouvání

# MSG_PAGE_KEYBINDINGS (62//)
source: Keybindings
cs: Klávesové zkratky

# MSG_SB_HORIZONTAL (63//)
source: Horizontal Scrollbar
cs: Vodorovný posuvník

# MSG_SB_HORIZONTAL_HELP (64//)
source: Set the default mode for the horizontal scrollbar. (may be overwritten by an application)
cs: Definuje způsob chování vodorovného posuvníku. Pozn.: Programy mohou toto nastavení změnit.

# MSG_SB_VERTICAL (65//)
source: Vertical Scrollbar
cs: Svislý posuvník

# MSG_SB_VERTICAL_HELP (66//)
source: Set the default mode for the vertical scrollbar. (may be overwritten by an application)
cs: Definuje způsob chování svislého posuvníku. Pozn.: Programy mohou toto nastavení změnit.

# MSG_SCROLLCONTROL (67//)
source: Scrolling Control
cs: Možnosti posouvání

# MSG_SMOOTH_SCROLLING (68//)
source: Smooth Scrolling
cs: Zapnout plynulé posouvání

# MSG_SMOOTH_SCROLLING_HELP (69//)
source: If enabled, smoothing scrolling will be used for NList objects. In addition, by using the 'smooth' slider in the normal MUI 'Listview' configuration page the speed of the smooth scrolling can be controled.
cs: Aktivuje plynulé posouvání obsahu objektů NList. Rychlost posouvání lze měnit šoupátkem "Plynulé" v konfiguraci MUI, v sekci Seznamy/Ovládání.

# MSG_MMB_FASTWHEEL (70//)
source: MMB Fast Wheel
cs: Zrychlit prostředním tlačítkem myši

# MSG_MMB_FASTWHEEL_HELP (71//)
source: If enabled, the middle mouse button can be used as a qualifier to perform a fast scroll wheel action. (See 'Keybindings' page as well for more wheel qualifiers)
cs: Aktivuje zrychlené posouvání při současně zmáčknutém prostředním tlačítku myši. Na panelu "Klávesové zkratky" najdete přehled všech přepínačů pro práci s kolečkem myši.

# MSG_WHEEL_STEP (72//)
source: Mouse Wheel Step
cs: Otočení kolečka o 1 krok

# MSG_WHEEL_STEP_HELP (73//)
source: Allows to specify the amount of lines that should be scrolled when using a wheel mouse.
cs: Definuje počet řádků, o které se posune obsah objektu NList, při otočení kolečka o jeden krok.

# MSG_WHEEL_FAST (74//)
source: Mouse Wheel Fast Step
cs: Otočení kolečka o 1 krok (při zrychlení)

# MSG_WHEEL_FAST_HELP (75//)
source: Allows to specify the amount of lines that should be scrolled when using a wheel mouse and when the fast wheel qualifier is pressed.
cs: Definuje počet řádků, o které se posune obsah objektu NList, při otočení kolečka o jeden krok a současně zmáčknutém prostředním tlačítku myši.

# MSG_LAYOUT (76//)
source: Layout
cs: Vzhled

# MSG_PARTIAL_COL_MARK (77//)
source: Partial column mark
cs: Indikovat zúžený sloupec

# MSG_PARTIAL_COL_MARK_HELP (78//)
source: If enabled, a special mark will be drawn at the right side of a column in case the text didn't completly fit into it.
cs: Aktivuje zobrazení indikátoru stavu, kdy je šířka sloupce menší než nejdelší položka, kterou obsahuje.

# MSG_PARTIAL_CHARS_DRAWN (79//)
source: Partial chars drawn
cs: Zapnout plné vykreslování znaků

# MSG_PARTIAL_CHARS_DRAWN_HELP (80//)
source: If enabled, characters that are not fully visible at the left and right corner of an NList object will not be drawn partially.
cs: Vypne částečné vykreslování znaků. To znamená, že je-li sloupec zúžený a nepojme tak celý text, zakryté znaky na rozhraní nejsou viditelné.

# MSG_VERT_CENTERED (81//)
source: Vertical centered lines
cs: Svisle vystředit řádky

# MSG_VERT_CENTERED_HELP (82//)
source: If activated, the text lines are centered vertically in a NList object.
cs: Aktivuje svislé středění textových řádků v rámci objektu NList.

# MSG_BALANCING_COLS (83//)
source: Balancing Columns
cs: Vyvážení šířky sloupců

# MSG_BALANCING_COLS_HELP (84//)
source: NList permits to change the column width via mouse dragging the column separator in the title bar. The moved bar can be visible either only in the title, throughout the whole lines or the column width changes can be made visible instantly.
cs: Definuje způsob zobrazení sloupců při změně šířky na požadovanou. Na výběr jsou tři možnosti: buď se dělicí linka vykreslí pouze v rámci textu záhlaví, nebo v rámci celého sloupce anebo se při posunutí zobrazí i obsah sloupců.

# MSG_COLWIDTHDRAG_TITLE (85//)
source: Title Bar
cs: Pouze v záhlaví

# MSG_COLWIDTHDRAG_FULLBAR (86//)
source: Full Bar
cs: Přes celý sloupec

# MSG_COLWIDTHDRAG_VISIBLE (87//)
source: Visible
cs: Vše včetně obsahu sloupců

# MSG_COLOR_OPTIONS (88//)
source: Options
cs: Možnosti

# MSG_FORCE_SELECT_PEN (89//)
source: Force select pen
cs: Vynutit definovat barvy

# MSG_FORCE_SELECT_PEN_HELP (90//)
source: If enabled, NList will make sure that the 'Selected', 'Cursor' and 'Unselected' color will be forced.
cs: Zajistí použití barev definovaných pro kurzor a označené i neoznačené položky.

# MSG_MULTISEL_MOVEACTIVE (91//)
source: Keyboard moves cursor
cs: Klávesnicí posouvat i kurzor

# MSG_MULTISEL_MOVEACTIVE_HELP (92//)
source: If enabled, a keyboard use in an NList object will move the active cursor rather than the unselected one.
cs: Způsobí, že při ovládání z klávesnice se bude posouvat i kurzor.

# MSG_GROUP_MISC (93//)
source: Miscellaneous
cs: Ostatní

# MSG_GROUP_EXAMPLE (94//)
source: Example
cs: Ukázka

# MSG_SERMOUSE_FIX (95//)
source: Serial Mouse Fix
cs: Opravit chyby myši přes sériový port

# MSG_SERMOUSE_FIX_HELP (96//)
source: If enabled, NList tries to fix common drag&drop issues that are related to using a serial mouse.
cs: Opravuje chyby myši připojené přes sériový port.

# MSG_SELECT_POINTER (97//)
source: Custom Select Pointer
cs: Použít vlastní ukazatel myši

# MSG_SELECT_POINTER_HELP (98//)
source: If enabled, and an NList object is in charwise selection mode a custom select pointer will be displayed instead of the default workbench mouse pointer image.
cs: Při posunutí myši na oblast určenou k změně šířky sloupců změní NList vzhled ukazatele myši.

# MSG_BAR_CONTEXTMENU (99//)
source: Context Menu
cs: Lokální menu

# MSG_DEFAULT_CONTEXT_MENU_HELP (100//)
source: NList permits to have its default context menu being disabled or enabled or only in case the mouse is at the top of the NList object.
cs: Definuje případy, za jakých okolností zobrazit lokální menu, nebo ho umožní i vypnout.

# MSG_SNOOP (101//)
source: Snoop
cs: Zachytit

# MSG_SNOOP_KEY (102//)
source: Start the grab of a hotkey.
cs: Zapne režim záznamu zmáčknutých kláves.

# MSG_BUTTON_INSERT (103//)
source: Insert
cs: Vložit

# MSG_BUTTON_INSERT_HELP (104//)
source: Allows to insert a new hotkey.
cs: Umožní zadat novou klávesovou zkratku.

# MSG_BUTTON_REMOVE (105//)
source: Remove
cs: Odebrat

# MSG_BUTTON_REMOVE_HELP (106//)
source: Allows to remove an existing hotkey.
cs: Umožní odstranit vybranou klávesovou zkratku.

# MSG_BUTTON_UPDATEKEYS (107//)
source: Update keys
cs: Aktualizovat

# MSG_BUTTON_UPDATEKEYS_HELP (108//)
source: Add the default hotkeys for the functions which are not currently in the list.
cs: Přidá výchozí klávesové zkratky těm funkcím, které nově přibyly.

# MSG_BUTTON_DEFAULTKEYS (109//)
source: Default keys
cs: Výchozí stav

# MSG_BUTTON_DEFAULTKEYS_HELP (110//)
source: Resets all hotkeys to default ones.
cs: Obnoví výchozí nastavení klávesových zkratek.

# MSG_FUNC_MULTISELQUAL (111//)
source: Multiselect/Block Qualifier
cs: Přepínač pro vícenásobný výběr

# MSG_FUNC_DRAGQUAL (112//)
source: Drag&Drop Qualifier
cs: Přepínač pro 'Táhnout a pustit'

# MSG_FUNC_BALANCEQUAL (113//)
source: Balance Qualifier
cs: Přepínač vyvážení šířky sloupců

# MSG_FUNC_COPYCLIP (114//)
source: Copy to clipboard
cs: Kopírování do achránky

# MSG_FUNC_DEFCOLWIDTH (115//)
source: Default width column
cs: Výchozí šířka sloupce

# MSG_FUNC_DEFALLCOLWIDTH (116//)
source: Default width all columns
cs: Výchozí šířka pro všechny sloupce

# MSG_FUNC_DEFORDERCOL (117//)
source: Default order column
cs: Výchozí řazení

# MSG_FUNC_DEFALLORDERCOL (118//)
source: Default order all columns
cs: Výchozí řazení pro všechny sloupce

# MSG_FUNC_SELECTTOP (119//)
source: Select to top
cs: Výběr od aktuální pozice po horní

# MSG_FUNC_SELECTBOTTOM (120//)
source: Select to bottom
cs: Výběr od aktuální pozice po dolní

# MSG_FUNC_SELECTPAGEUP (121//)
source: Select to page up
cs: Výběr jedné stránky směrem nahoru

# MSG_FUNC_SELECTPAGEDOWN (122//)
source: Select to page down
cs: Výběr jedné stránky směrem dolů

# MSG_FUNC_SELECTUP (123//)
source: Select up
cs: Výběr směrem nahoru

# MSG_FUNC_SELECTDOWN (124//)
source: Select down
cs: Výběr směrem dolů

# MSG_FUNC_TOGGLEACTIVE (125//)
source: Toggle active
cs: Aktivace dalšího

# MSG_FUNC_FASTWHEELQUAL (126//)
source: Fast MouseWheel Qualifier
cs: Přepínač zrychlení posouvání kolečkem

# MSG_FUNC_HORIZWHEELQUAL (127//)
source: Horiz MouseWheel Qualifier
cs: Přepínač posouvání kolečkem ve vodorovném směru

# MSG_FUNC_TITLECLICKQUAL (128//)
source: Title Click Qualifier
cs: Přepínač pro aktivaci lokálního menu

# MSG_VSB_ALWAYS (129//)
source: Always
cs: Zobrazit vždy

# MSG_VSB_AUTO (130//)
source: Auto
cs: Automaticky

# MSG_VSB_FULLAUTO (131//)
source: FullAuto
cs: Plně automaticky

# MSG_HSB_ALWAYS (132//)
source: Always
cs: Zobrazit vždy

# MSG_HSB_AUTO (133//)
source: Auto
cs: Automaticky

# MSG_HSB_FULLAUTO (134//)
source: FullAuto
cs: Plně automaticky

# MSG_HSB_NONE (135//)
source: None
cs: Nezobrazovat

# MSG_CMENU_ALWAYS (136//)
source: Always
cs: Kdekoli v rámci objektu

# MSG_CMENU_TOPONLY (137//)
source: TopOnly
cs: Pouze v záhlaví sloupce

# MSG_CMENU_NEVER (138//)
source: Never
cs: Vypnout

# MSG_HOTKEYS_KEY (139//)
source: Key
cs: Klávesa

# MSG_HOTKEYS_ACTION (140//)
source: Action
cs: Akce

# MSG_EXAMPLE_TEXT (141//)
source: If you have problems, try to increase the stack value, in the icon infos if you launch the program from icon, stack of CLI if you start it from CLI/Shell, and if you launch it from some utility read its docs to see how to increase it. A stack of 12Kb, 16Kb or 20Kb is most of time a good idea. If you still have problems, try to see if they happen with the Demo prog, then tell me. \033C Latest public release can be found on aminet (dev/mui). All releases are available on http://www.sourceforge.net/projects/nlist-classes/ \033C \033r\0333(C) 2001-2013 by NList Open Source Team \033r\0333(C) 1996-1998 by Gilles Masson \033r\0333http://www.sourceforge.net/projects/nlist-classes/ \033C \033cThis new list/listview custom class \033chandles its own configurable backgrounds, \033cpens, fonts, scrollbars, keys and qualifiers \033C \033cThe way used to handle cursor with multiselection \033cis not exactly as the listview one ! \033cDrag&Drop is supported, both scrollbars \033ccan be configured to disappear automatically \033cwhen not needed because all is visible. \033cJust try it... \033C \033cYou can horizontaly scroll with cursor keys, \033cor going on the right and left of the list \033cwhile selecting with the mouse. \033cTry just clicking on the left/right borders ! \033C \033cYou can change columns widths just dragging \033cthe vertical separator between columns titles \033c(try it using the balancing qualifier too). \033C \033cYou can change columns order just dragging \033cthe column titles. \033C \033cThere is builtin copy to clipboard stuff \033cand classic char selection capability. \033C \033cTry the Demo program to test all that... \033r\033bGive some feedback about it ! :-) \033C **************************************************************************************************
cs: Pokud zaznamenáte problémy týkající se této třídy MUI, jedním z možných řešení je zvětšení velikosti zásobníku. Tu lze definovat v ikoně programu (spouštíte-li program z prostředí Workbench) nebo v ikoně CLI (při spuštění z příkazového řádku). Doporučená velikost je 16 KB. Jestliže problémy neustanou, zkuste je zreprodukovat pomocí přiloženého demonstračního programu a teprve poté nahlašte chybu. Aktuální verzi najdete na Aminetu v adresáři dev/mui nebo na stránkách http://www.sourceforge.net/projects/nlist-classes/ \033r\033b(C) 2001-2008 NList Open Source Team \033r\033b(C) 1996-1998 Gilles Masson \033r\033bhttp://www.sourceforge.net/projects/nlist-classes/ Tato třída je koncipovaná jako náhrada tříd list a listview systému MUI, přičemž nabízí lepší funkce a větší možnosti konfigurace. Na rozdíl od standardního chování MUI je jinak řešen způsob práce s kurzorem při výběru více položek. Navíc je přidaná možnost 'táhnout a pustit', vodorovný i svislý posuvník lze nechat automaticky skrýt a jiné. Zkuste... Kurzorové šipky můžete využít k posunu obsahu seznamu ve vodorovném směru. Posouvat seznamem vpravo i vlevo lze i při výběru textu myší. Zkuste kliknout na levý nebo pravý okraj! Chcete změnit šířku sloupců? Žádný problém. Najeďte šipkou myši na dělicí linku mezi sloupci a přetáhněte v žádaném směru (a nezapomeňte na přepínač vyvážení šířky sloupců). A nechcete změnit pořadí sloupců? Ani to není problém. Dosáhnete toho způsobem podobným tomu, který je popsaný výše. Třída NList obsahuje i vlastní funkci pro kopírování textu do schránky a standardní způsob výběru textu. Vše si můžete vyzkoušet v přiloženém demonstračním programu. \033r\033bNapište nám! Nenechávejte si připomínky pro sebe :-) **************************************************************************************************
