Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlistviews_mcp/locale/danish.po
Languages: da

# MSG_FONTS (0//)
source: Fonts
da: Skriftsnit

# MSG_NORMAL_FONT (1//)
source: Normal Font:
da: Normalt skriftsnit:

# MSG_NORMAL_FONT_HELP (2//)
source: Choose the normal NList font.
da: Vælger NLists normale skriftsnit.

# MSG_NORMAL_FONT_ASL (3//)
source: Please select the normal font...
da: Vælg det normale skrfitsnit...

# MSG_SMALL_FONT (4//)
source: Small Font:
da: Lille skriftsnit:

# MSG_SMALL_FONT_HELP (5//)
source: Choose the small NList font.
da: Vælger NLists lille skriftsnit.

# MSG_SMALL_FONT_ASL (6//)
source: Please select a small font...
da: Vælg et lille skriftsnit...

# MSG_FIXED_FONT (7//)
source: Fixed Font:
da: Fastbredde-skriftsnit:

# MSG_FIXED_FONT_HELP (8//)
source: Choose the fixed NList font.
da: Vælger NLists fastbredde-skriftsnit.

# MSG_FIXED_FONT_ASL (9//)
source: Please select a fixed font...
da: Vælg et skriftsnit med fast bredde...

# MSG_FONT_MARGIN (10//)
source: Font Margin:
da: Skriftmargen:

# MSG_FONT_MARGIN_HELP (11//)
source: Allows to set a vertical margin which will be added to the font height and result in the default line height in an NList object.
da: Giver mulighed for at fastsætte en lodret margen som lægges til skriftsnittets højde for at give standard-rækkehøjden i et NList-objekt.

# MSG_COLORS (12//)
source: Colors
da: Farver

# MSG_TEXTCOLOR (13//)
source: Text Pen
da: Tekstpen

# MSG_BACKGROUNDCOLOR (14//)
source: Background
da: Baggrund

# MSG_TITLE_PEN_WIN (15//)
source: Title Pen
da: Overskriftspen

# MSG_TITLE_PEN_HELP (16//)
source: For adjusting the pen color of a title.
da: Til tilpasning af en kolonneoverskrifts pennefarve.

# MSG_PBG_TITLE (17//)
source: \033cTitle
da: \033cOverskrift

# MSG_TITLE_BG_WIN (18//)
source: Title Background
da: Overskriftsbaggrund

# MSG_TITLE_BG_HELP (19//)
source: For adjusting the background color of a title.
da: Til tilpasning af en kolonneoverskrifts baggrundsfarve.

# MSG_LIST_PEN_WIN (20//)
source: List Pen
da: Listepen

# MSG_LIST_PEN_HELP (21//)
source: For adjusting the pen color of a list.
da: Til tilpasning af en listes pennefarve.

# MSG_PBG_LIST (22//)
source: \033cList
da: \033cListe

# MSG_LIST_BG_WIN (23//)
source: List Background
da: Listebaggrund

# MSG_LIST_BG_HELP (24//)
source: For adjusting the background color of a list.
da: Til tilpasning af en listes baggrundsfarve.

# MSG_SELECT_PEN_WIN (25//)
source: Selected Entry
da: Markeret post

# MSG_SELECT_PEN_HELP (26//)
source: For adjusting the pen color of selected entries.
da: Til tilpasning af markerede posters pennefarve.

# MSG_PBG_SELECT (27//)
source: \033cSelected
da: \033cMarkeret

# MSG_SELECT_BG_WIN (28//)
source: Selected Entry
da: Markeret post

# MSG_SELECT_BG_HELP (29//)
source: For adjusting the background color of selected entries.
da: Til tilbasning af markerede posters baggrundsfarve.

# MSG_CURSOR_PEN_WIN (30//)
source: Selected Cursor
da: Markør i markering

# MSG_CURSOR_PEN_HELP (31//)
source: For adjusting the pen color of a selected cursor.
da: Til tilpasning af markørens pennefarve i markeret tekst.

# MSG_PBG_CURSOR (32//)
source: \033cCursor
da: \033cMarkør

# MSG_CURSOR_BG_WIN (33//)
source: Selected Cursor
da: Markør i markering

# MSG_CURSOR_BG_HELP (34//)
source: For adjusting the background color of a selected cursor.
da: Til tilpasning af markørens baggrundsfarve i markeret tekst.

# MSG_UNSEL_PEN_WIN (35//)
source: Unselected Cursor
da: Markør uden for markering

# MSG_UNSEL_PEN_HELP (36//)
source: For adjusting the pen color of an unselected cursor.
da: Til tilpasning af markørens pennefarve uden for markeret tekst.

# MSG_PBG_UNSEL (37//)
source: \033cUnselected
da: \033cUmarkeret

# MSG_UNSEL_BG_WIN (38//)
source: Unselected Cursor
da: Markør uden for markering

# MSG_UNSEL_BG_HELP (39//)
source: For adjusting the background color of an unselected cursor.
da: Til tilpasning af markørens baggrundsfarve uden for markeret tekst.

# MSG_INACT_PEN_WIN (40//)
source: Inactive Cursor
da: Markør uden fokus

# MSG_INACT_PEN_HELP (41//)
source: For adjusting the pen color of an inactive cursor.
da: Til tilpasning af markørens pennefarve når panelet ikke har fokus.

# MSG_PBG_INACT (42//)
source: \033cInactive
da: \033cUden fokus

# MSG_INACT_BG_WIN (43//)
source: Inactive Cursor
da: Markør uden fokus

# MSG_INACT_BG_HELP (44//)
source: For adjusting the background color of an inactive cursor.
da: Til tilpasning af markørens baggrundsfarve når panelet ikke har fokus.

# MSG_MULTISELECT (45//)
source: MultiSelection
da: Multimarkering

# MSG_MULTISELECT_QUAL (46//)
source: via Qualifier
da: Vha kvalifikatortast

# MSG_MULTISELECT_ALWAYS (47//)
source: Always
da: Altid

# MSG_MULTISELECT_HELP (48//)
source: Allows to specify the default multiselection mode.
da: Giver mulighed for at angive standardmetoden til multimarkering.

# MSG_MMB_MULTISEL (49//)
source: MMB multiselection
da: Multimarkering med midterste museknap

# MSG_MMB_MULTISEL_HELP (50//)
source: Set it if you want to use the middle mouse button (MMB) as a multiselection qualifier.
da: Dette vælges hvis man vil benytte den midterste museknap som kvalifikator til multimarkering.

# MSG_DRAGDROP (51//)
source: Drag&Drop
da: Træk & slip

# MSG_DRAGTYPE_IMMEDIATE (52//)
source: Immediate
da: Straks

# MSG_DRAGTYPE_BORDERS (53//)
source: at Borders
da: Ved kanter

# MSG_DRAGTYPE_QUALIFIER (54//)
source: via Qualifier
da: Vha kvalifikatortast

# MSG_DRAGTYPE_HELP (55//)
source: Set the drag mode. 'Immediate' will start drag&drop as soon as you drag an object. 'at Borders' for showing a drag operation as soon as you passed the left/right borders and 'via Qualifier' for only allowing to drag&drop via a qualifier key (see 'Keys'). 'Immediate' is used only when in no-multiselect mode.
da: Vælger trække-modus. 'Straks' betyder at træk & slip-funktionen starter så snart man trækker et objekt. 'Ved kanter' viser træk-handlingen så snart man har passeret den venstre eller højre kant, og 'Vha kvalifikatortast' tillader kun træk & slip ved brug af en kvalifikatortast (se 'Taster'). 'Straks' anvendes kun når man ikke er i multimarkerings-modus.

# MSG_DRAG_LINES (56//)
source: Visible lines
da: Synlige rækker

# MSG_DRAG_LINES_HELP (57//)
source: Give the max. number of lines which will be shown when doing drag&drop. If more lines are selected, you'll get a message similar to: 'Dragging xx Items...'.
da: Angiver det maksimale antal rækker der skal vises under træk & slip. Hvis der er markeret flere rækker, får man en meddelelse i stil med "Trækker xx emner...'.

# MSG_PAGE_FONTS (58//)
source: Fonts
da: Skriftsnit

# MSG_PAGE_COLORS (59//)
source: Colors
da: Farver

# MSG_PAGE_OPTIONS (60//)
source: Options
da: Tilvalg

# MSG_PAGE_SCROLLING (61//)
source: Scrolling
da: Rulning

# MSG_PAGE_KEYBINDINGS (62//)
source: Keybindings
da: Tastebindinger

# MSG_SB_HORIZONTAL (63//)
source: Horizontal Scrollbar
da: Vandret rulleskakt

# MSG_SB_HORIZONTAL_HELP (64//)
source: Set the default mode for the horizontal scrollbar. (may be overwritten by an application)
da: Angiver standardmodus for den vandrette rulleskakt (kan evt. blive overstyret fra en applikation).

# MSG_SB_VERTICAL (65//)
source: Vertical Scrollbar
da: Lodret rulleskakt

# MSG_SB_VERTICAL_HELP (66//)
source: Set the default mode for the vertical scrollbar. (may be overwritten by an application)
da: Angiver standardmodus for den lodrette rulleskakt (kan evt. blive overstyret fra en applikation).

# MSG_SCROLLCONTROL (67//)
source: Scrolling Control
da: Styring af rulning

# MSG_SMOOTH_SCROLLING (68//)
source: Smooth Scrolling
da: Blød rulning

# MSG_SMOOTH_SCROLLING_HELP (69//)
source: If enabled, smoothing scrolling will be used for NList objects. In addition, by using the 'smooth' slider in the normal MUI 'Listview' configuration page the speed of the smooth scrolling can be controled.
da: Ved hak her vil der blive anvendt blødere rulning for NList-objekter. Desuden kan hastigheden for den bløde rulning styres med skydeknappen 'blødhed' på den almindelige MUI indstillingsside 'Lister'.

# MSG_MMB_FASTWHEEL (70//)
source: MMB Fast Wheel
da: Hurtig hjulrulning med midterste museknap

# MSG_MMB_FASTWHEEL_HELP (71//)
source: If enabled, the middle mouse button can be used as a qualifier to perform a fast scroll wheel action. (See 'Keybindings' page as well for more wheel qualifiers)
da: Ved hak her vil den midterste museknap kunne benyttes som kvalifikator til at udføre hurtig rulning med musehjulet. (Se også 'Tastebindinger', hvor der er flere musehjuls-kvalifikatorer.)

# MSG_WHEEL_STEP (72//)
source: Mouse Wheel Step
da: Musehjulstrin

# MSG_WHEEL_STEP_HELP (73//)
source: Allows to specify the amount of lines that should be scrolled when using a wheel mouse.
da: Giver mulighed for at angive hvor mange rækker der skal rulles, når man benytter en hjul-mus.

# MSG_WHEEL_FAST (74//)
source: Mouse Wheel Fast Step
da: Hurtige musehjulstrin

# MSG_WHEEL_FAST_HELP (75//)
source: Allows to specify the amount of lines that should be scrolled when using a wheel mouse and when the fast wheel qualifier is pressed.
da: Giver mulighed for at angive hvor mange rækker der skal rulles, når man benytter en hjul-mus, og kvalifikatoren til hurtig rulning anvendes.

# MSG_LAYOUT (76//)
source: Layout
da: Udseende

# MSG_PARTIAL_COL_MARK (77//)
source: Partial column mark
da: Markering af afkortede kolonner

# MSG_PARTIAL_COL_MARK_HELP (78//)
source: If enabled, a special mark will be drawn at the right side of a column in case the text didn't completly fit into it.
da: Ved hak her vil der blive sat et specielt mærke i højre side af en kolonne hvis ikke hele dens tekst kunne være i den.

# MSG_PARTIAL_CHARS_DRAWN (79//)
source: Partial chars drawn
da: Tegning af delvise tegn

# MSG_PARTIAL_CHARS_DRAWN_HELP (80//)
source: If enabled, characters that are not fully visible at the left and right corner of an NList object will not be drawn partially.
da: Ved hak her vil tegn, der ikke er fuldt synlige ved venstre og højre kant af et NList-objekt, ikke blive delvist tegnet.

# MSG_VERT_CENTERED (81//)
source: Vertical centered lines
da: Lodret centrerede linjer

# MSG_VERT_CENTERED_HELP (82//)
source: If activated, the text lines are centered vertically in a NList object.
da: Ved hak her vil tekstlinjer blive centreret lodret i et NList-objekt.

# MSG_BALANCING_COLS (83//)
source: Balancing Columns
da: Kolonnebalancering

# MSG_BALANCING_COLS_HELP (84//)
source: NList permits to change the column width via mouse dragging the column separator in the title bar. The moved bar can be visible either only in the title, throughout the whole lines or the column width changes can be made visible instantly.
da: NList giver mulighed for at ændre kolonnebredden ved at trække med musen i kolonneadskillelsen i overskriftsbjælken. Ændringen kan visualiseres enten kun i overskriftsbjælken, ned gennem alle rækkerne, eller ved at kolonnens breddeændring vises straks.

# MSG_COLWIDTHDRAG_TITLE (85//)
source: Title Bar
da: Overskriftsbjælke

# MSG_COLWIDTHDRAG_FULLBAR (86//)
source: Full Bar
da: Alle rækker

# MSG_COLWIDTHDRAG_VISIBLE (87//)
source: Visible
da: Vise straks

# MSG_COLOR_OPTIONS (88//)
source: Options
da: Tilvalg

# MSG_FORCE_SELECT_PEN (89//)
source: Force select pen
da: Gennemtvinge pen til markeringer

# MSG_FORCE_SELECT_PEN_HELP (90//)
source: If enabled, NList will make sure that the 'Selected', 'Cursor' and 'Unselected' color will be forced.
da: Ved hak her vil NList sørge for at farverne til 'Markeret', 'Markør' og 'Umarkeret' bliver gennemtvunget.

# MSG_MULTISEL_MOVEACTIVE (91//)
source: Keyboard moves cursor
da: Tastatur flytter aktiv-markør

# MSG_MULTISEL_MOVEACTIVE_HELP (92//)
source: If enabled, a keyboard use in an NList object will move the active cursor rather than the unselected one.
da: Ved hak her vil brug af tastaturet i et NList-objekt flytte den aktive markør i stedet for den ikke markerede.

# MSG_GROUP_MISC (93//)
source: Miscellaneous
da: Diverse

# MSG_GROUP_EXAMPLE (94//)
source: Example
da: Eksempel

# MSG_SERMOUSE_FIX (95//)
source: Serial Mouse Fix
da: Løsning for seriel mus

# MSG_SERMOUSE_FIX_HELP (96//)
source: If enabled, NList tries to fix common drag&drop issues that are related to using a serial mouse.
da: Ved hak her forsøger NList at løse nogle ofte forekommende problemer med træk & slip som er knyttet til brug af en seriel mus.

# MSG_SELECT_POINTER (97//)
source: Custom Select Pointer
da: Speciel markerings-musepil

# MSG_SELECT_POINTER_HELP (98//)
source: If enabled, and an NList object is in charwise selection mode a custom select pointer will be displayed instead of the default workbench mouse pointer image.
da: Ved hak her vil der blive vist en speciel musepil til markering i stedet for den almindelige Workbench-musepil, når et NList-objekt er i tegnvis markeringsmodus.

# MSG_BAR_CONTEXTMENU (99//)
source: Context Menu
da: Kontekstmenu

# MSG_DEFAULT_CONTEXT_MENU_HELP (100//)
source: NList permits to have its default context menu being disabled or enabled or only in case the mouse is at the top of the NList object.
da: NList giver mulighed for at slå dens standard-kontekstmenu fra eller til, eller kun få den vist når musen er i toppen af NList-objektet.

# MSG_SNOOP (101//)
source: Snoop
da: Opfange

# MSG_SNOOP_KEY (102//)
source: Start the grab of a hotkey.
da: Starte fangstmodus for en handlingstast.

# MSG_BUTTON_INSERT (103//)
source: Insert
da: Indsætte

# MSG_BUTTON_INSERT_HELP (104//)
source: Allows to insert a new hotkey.
da: Giver mulighed for at indsætte en ny handlingstast.

# MSG_BUTTON_REMOVE (105//)
source: Remove
da: Fjerne

# MSG_BUTTON_REMOVE_HELP (106//)
source: Allows to remove an existing hotkey.
da: Giver mulighed for at fjerne en handlingstast.

# MSG_BUTTON_UPDATEKEYS (107//)
source: Update keys
da: Opdatere taster

# MSG_BUTTON_UPDATEKEYS_HELP (108//)
source: Add the default hotkeys for the functions which are not currently in the list.
da: Tilføjer standard-handlingtasterne for de funktioner som ikke er i listen i øjeblikket.

# MSG_BUTTON_DEFAULTKEYS (109//)
source: Default keys
da: Nulstille taster

# MSG_BUTTON_DEFAULTKEYS_HELP (110//)
source: Resets all hotkeys to default ones.
da: Nulstiller alle handlingstaster til standarddefinitionerne.

# MSG_FUNC_MULTISELQUAL (111//)
source: Multiselect/Block Qualifier
da: Multimarkerings-/blok-kvalifikator

# MSG_FUNC_DRAGQUAL (112//)
source: Drag&Drop Qualifier
da: Kvalifikator til træk & slip

# MSG_FUNC_BALANCEQUAL (113//)
source: Balance Qualifier
da: Balance-kvalifikator

# MSG_FUNC_COPYCLIP (114//)
source: Copy to clipboard
da: Kopiere til udklipsholder

# MSG_FUNC_DEFCOLWIDTH (115//)
source: Default width column
da: Sætte standardbredde på kolonne

# MSG_FUNC_DEFALLCOLWIDTH (116//)
source: Default width all columns
da: Sætte standardbredde på alle kolonner

# MSG_FUNC_DEFORDERCOL (117//)
source: Default order column
da: Sætte standardsortering på kolonne

# MSG_FUNC_DEFALLORDERCOL (118//)
source: Default order all columns
da: Sætte standardsortering på alle kolonner

# MSG_FUNC_SELECTTOP (119//)
source: Select to top
da: Markere til top

# MSG_FUNC_SELECTBOTTOM (120//)
source: Select to bottom
da: Markere til bund

# MSG_FUNC_SELECTPAGEUP (121//)
source: Select to page up
da: Markere en side op

# MSG_FUNC_SELECTPAGEDOWN (122//)
source: Select to page down
da: Markere en side ned

# MSG_FUNC_SELECTUP (123//)
source: Select up
da: Markere opad

# MSG_FUNC_SELECTDOWN (124//)
source: Select down
da: Markere nedad

# MSG_FUNC_TOGGLEACTIVE (125//)
source: Toggle active
da: Omskifte aktive

# MSG_FUNC_FASTWHEELQUAL (126//)
source: Fast MouseWheel Qualifier
da: Kvalifikator til hurtigt musehjul

# MSG_FUNC_HORIZWHEELQUAL (127//)
source: Horiz MouseWheel Qualifier
da: Kvalifikator til vandret musehjul

# MSG_FUNC_TITLECLICKQUAL (128//)
source: Title Click Qualifier
da: Kvalifikator til overskriftsklik

# MSG_VSB_ALWAYS (129//)
source: Always
da: Altid

# MSG_VSB_AUTO (130//)
source: Auto
da: Automatisk

# MSG_VSB_FULLAUTO (131//)
source: FullAuto
da: Fuldautomatisk

# MSG_HSB_ALWAYS (132//)
source: Always
da: Altid

# MSG_HSB_AUTO (133//)
source: Auto
da: Automatisk

# MSG_HSB_FULLAUTO (134//)
source: FullAuto
da: Fuldautomatisk

# MSG_HSB_NONE (135//)
source: None
da: Ingen

# MSG_CMENU_ALWAYS (136//)
source: Always
da: Altid

# MSG_CMENU_TOPONLY (137//)
source: TopOnly
da: Kun øverst

# MSG_CMENU_NEVER (138//)
source: Never
da: Aldrig

# MSG_HOTKEYS_KEY (139//)
source: Key
da: Tast

# MSG_HOTKEYS_ACTION (140//)
source: Action
da: Handling

# MSG_EXAMPLE_TEXT (141//)
source: If you have problems, try to increase the stack value, in the icon infos if you launch the program from icon, stack of CLI if you start it from CLI/Shell, and if you launch it from some utility read its docs to see how to increase it. A stack of 12Kb, 16Kb or 20Kb is most of time a good idea. If you still have problems, try to see if they happen with the Demo prog, then tell me. \033C Latest public release can be found on aminet (dev/mui). All releases are available on http://www.sourceforge.net/projects/nlist-classes/ \033C \033r\0333(C) 2001-2013 by NList Open Source Team \033r\0333(C) 1996-1998 by Gilles Masson \033r\0333http://www.sourceforge.net/projects/nlist-classes/ \033C \033cThis new list/listview custom class \033chandles its own configurable backgrounds, \033cpens, fonts, scrollbars, keys and qualifiers \033C \033cThe way used to handle cursor with multiselection \033cis not exactly as the listview one ! \033cDrag&Drop is supported, both scrollbars \033ccan be configured to disappear automatically \033cwhen not needed because all is visible. \033cJust try it... \033C \033cYou can horizontaly scroll with cursor keys, \033cor going on the right and left of the list \033cwhile selecting with the mouse. \033cTry just clicking on the left/right borders ! \033C \033cYou can change columns widths just dragging \033cthe vertical separator between columns titles \033c(try it using the balancing qualifier too). \033C \033cYou can change columns order just dragging \033cthe column titles. \033C \033cThere is builtin copy to clipboard stuff \033cand classic char selection capability. \033C \033cTry the Demo program to test all that... \033r\033bGive some feedback about it ! :-) \033C **************************************************************************************************
da: Hvis du får problemer, så prøv at øge stakstørrelsen. Det gør du i ikonets informationsvindue hvis du starter programmet fra et ikon, med CLI-stakkommandoen hvis du starter det fra CLI/Shell, og hvis du starter det fra et andet hjælpeprogram, må du læse dettes dokumentation for at finde ud af hvordan man øger stakken. En stak på 12 kB, 16 kB eller 20 kB er som regel en god idé. Hvis du stadig har problemer, så prøv at undersøge om de opstår med Demo-programmet, og i så fald fortæl mig om det. \033C Den seneste offentlige release kan findes på aminet (dev/mui). Alle releases kan findes på http://www.sourceforge.net/projects/nlist-classes/ \033C \033r\0333© 2001-2013 af NList Open Source Team \033r\0333© 1996-1998 af Gilles Masson \033r\0333http://www.sourceforge.net/projects/nlist-classes/ \033C \033cDenne nye tredjeparts-liste- og listevisningsklasse \033chåndterer selv sine indstillelige baggrunde, \033cpenne, skriftsnit, rulleskakter, taster og kvalifikatorer \033C \033cMåden som markøren håndteres på ved multimarkering, \033cer ikke ligesom for almindelige MUI-lister. \033cTræk & slip understøttes, begge rulleskakter \033ckan indstilles til at forsvinde automatisk når \033cde ikke er nødvendige fordi alt er er synligt. \033cBare prøv det ... \033C \033cMan kan rulle vandret med piletasterne, \033celler ved at bevæge sig til højre eller \033cvenstre for listen under markering med musen. \033cPrøv bare at klikke på venstre eller højre kant. \033C \033cMan kan ændre kolonnebredder ved blot at trække i \033cden lodrette adskillelse mellem kolonneoverskrifterne \033c(prøv det også sammen med balancekvalifikatoren). \033C \033cMan kan ændre kolonnerækkefølge ved blot at trække \033ci kolonneoverskrifterne. \033C \033cDer er indbygget kopiering til udklipsholder \033cog klassisk tegnmarkeringsmulighed. \033C \033cPrøv Demo-programmet for at afprøve alt dette... \033r\033bSend en tilbagemelding om det! :-) \033C **************************************************************************************************
