Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlistviews_mcp/locale/polish.po
Languages: pl

# MSG_FONTS (0//)
source: Fonts
pl: Czcionki

# MSG_NORMAL_FONT (1//)
source: Normal Font:
pl: Normalna:

# MSG_NORMAL_FONT_HELP (2//)
source: Choose the normal NList font.
pl: Wybiera normaln± czcionkê dla elementów NList.

# MSG_NORMAL_FONT_ASL (3//)
source: Please select the normal font...
pl: Proszê wybraæ normaln± czcionkê...

# MSG_SMALL_FONT (4//)
source: Small Font:
pl: Mała:

# MSG_SMALL_FONT_HELP (5//)
source: Choose the small NList font.
pl: Wybiera mał± czcionkê dla elementów NList.

# MSG_SMALL_FONT_ASL (6//)
source: Please select a small font...
pl: Proszê wybraæ mał± czcionkê...

# MSG_FIXED_FONT (7//)
source: Fixed Font:
pl: Nieproporcjonalna:

# MSG_FIXED_FONT_HELP (8//)
source: Choose the fixed NList font.
pl: Wybiera nieproporcjonaln± czcionkê dla elementów NList.

# MSG_FIXED_FONT_ASL (9//)
source: Please select a fixed font...
pl: Proszê wybraæ nieproporcjonaln± czcionkê...

# MSG_FONT_MARGIN (10//)
source: Font Margin:
pl: Odstêpy:

# MSG_FONT_MARGIN_HELP (11//)
source: Allows to set a vertical margin which will be added to the font height and result in the default line height in an NList object.
pl: Pozwala okre¶liæ pionowe odstêpy, które zostan± dodane do wysoko¶ci czcionki i w wyniku dadz± wysoko¶æ linii tekstu obiektó NList.

# MSG_COLORS (12//)
source: Colors
pl: Kolory

# MSG_TEXTCOLOR (13//)
source: Text Pen
pl: Pisak tekstu

# MSG_BACKGROUNDCOLOR (14//)
source: Background
pl: Tło

# MSG_TITLE_PEN_WIN (15//)
source: Title Pen
pl: Pisak tytułów

# MSG_TITLE_PEN_HELP (16//)
source: For adjusting the pen color of a title.
pl: Ustawia kolor pisaka tytułów.

# MSG_PBG_TITLE (17//)
source: \033cTitle
pl: \033cTytuł

# MSG_TITLE_BG_WIN (18//)
source: Title Background
pl: Tło tytułu

# MSG_TITLE_BG_HELP (19//)
source: For adjusting the background color of a title.
pl: Ustawia kolor tła tytułów.

# MSG_LIST_PEN_WIN (20//)
source: List Pen
pl: Pisak listy

# MSG_LIST_PEN_HELP (21//)
source: For adjusting the pen color of a list.
pl: Ustawia kolor pisaka listy.

# MSG_PBG_LIST (22//)
source: \033cList
pl: \033cLista

# MSG_LIST_BG_WIN (23//)
source: List Background
pl: Tło listy

# MSG_LIST_BG_HELP (24//)
source: For adjusting the background color of a list.
pl: Ustawia kolor tła listy.

# MSG_SELECT_PEN_WIN (25//)
source: Selected Entry
pl: Zaznaczony element

# MSG_SELECT_PEN_HELP (26//)
source: For adjusting the pen color of selected entries.
pl: Ustawia kolor pisaka zaznaczonych elementów.

# MSG_PBG_SELECT (27//)
source: \033cSelected
pl: \033cZaznaczony

# MSG_SELECT_BG_WIN (28//)
source: Selected Entry
pl: Zaznaczony element

# MSG_SELECT_BG_HELP (29//)
source: For adjusting the background color of selected entries.
pl: Ustawia kolor tła zaznaczonych elementów.

# MSG_CURSOR_PEN_WIN (30//)
source: Selected Cursor
pl: Zaznaczony kursor

# MSG_CURSOR_PEN_HELP (31//)
source: For adjusting the pen color of a selected cursor.
pl: Ustawia kolor pisaka zaznaczonego kursora.

# MSG_PBG_CURSOR (32//)
source: \033cCursor
pl: \033cKursor

# MSG_CURSOR_BG_WIN (33//)
source: Selected Cursor
pl: Zaznaczony kursor

# MSG_CURSOR_BG_HELP (34//)
source: For adjusting the background color of a selected cursor.
pl: Ustawia kolor tła zaznaczonego kursora.

# MSG_UNSEL_PEN_WIN (35//)
source: Unselected Cursor
pl: Odznaczony kursor

# MSG_UNSEL_PEN_HELP (36//)
source: For adjusting the pen color of an unselected cursor.
pl: Ustawia kolor pisaka odznaczonego kursora.

# MSG_PBG_UNSEL (37//)
source: \033cUnselected
pl: \033cOdznaczony

# MSG_UNSEL_BG_WIN (38//)
source: Unselected Cursor
pl: Odznaczony kursor

# MSG_UNSEL_BG_HELP (39//)
source: For adjusting the background color of an unselected cursor.
pl: Ustawia kolor tła odznaczonego kursora.

# MSG_INACT_PEN_WIN (40//)
source: Inactive Cursor
pl: Nieaktywny kursor

# MSG_INACT_PEN_HELP (41//)
source: For adjusting the pen color of an inactive cursor.
pl: Ustawia kolor pisaka nieaktywnego kursora.

# MSG_PBG_INACT (42//)
source: \033cInactive
pl: \033cNieaktywny

# MSG_INACT_BG_WIN (43//)
source: Inactive Cursor
pl: Nieaktywny kursor

# MSG_INACT_BG_HELP (44//)
source: For adjusting the background color of an inactive cursor.
pl: Ustawia kolor tła nieaktywnego kursora.

# MSG_MULTISELECT (45//)
source: MultiSelection
pl: Wybór wielu elementów

# MSG_MULTISELECT_QUAL (46//)
source: via Qualifier
pl: z klawiszem wywołuj±cym

# MSG_MULTISELECT_ALWAYS (47//)
source: Always
pl: zawsze

# MSG_MULTISELECT_HELP (48//)
source: Allows to specify the default multiselection mode.
pl: Pozwala na okre¶lenie domy¶lnego trybu zaznaczania wielu elementów.

# MSG_MMB_MULTISEL (49//)
source: MMB multiselection
pl: Zaznaczanie ŠPM

# MSG_MMB_MULTISEL_HELP (50//)
source: Set it if you want to use the middle mouse button (MMB) as a multiselection qualifier.
pl: Wł±cz tê opcjê je¶li chcesz używaæ ¶rodkowego przycisku myszki (ŠPM) jako klawisz wywołuj±cy zaznaczania wielu elementów.

# MSG_DRAGDROP (51//)
source: Drag&Drop
pl: Przeci±gnij i upu¶æ

# MSG_DRAGTYPE_IMMEDIATE (52//)
source: Immediate
pl: natychmiast

# MSG_DRAGTYPE_BORDERS (53//)
source: at Borders
pl: przy krawêdziach

# MSG_DRAGTYPE_QUALIFIER (54//)
source: via Qualifier
pl: z klawiszem wywołuj±cym

# MSG_DRAGTYPE_HELP (55//)
source: Set the drag mode. 'Immediate' will start drag&drop as soon as you drag an object. 'at Borders' for showing a drag operation as soon as you passed the left/right borders and 'via Qualifier' for only allowing to drag&drop via a qualifier key (see 'Keys'). 'Immediate' is used only when in no-multiselect mode.
pl: Ustawia tryb przeci±gania. "Natychmiast" powoduje rozpocz±ecie przeci±gania w momencie poci±gniêcia obiektu. "Przy krawêdziach" pokazuje operacjê przeci±gania w chwili przekroczenia lewej/prawej krawêdzi, a "z klawiszem wywołuj±cym" pozwala na przeci±ganie jedynie po użyciu klawisza wywołuj±cego (zobacz zakładkê "klawisze"). "Natychmiast" jest używane tylko w trybie pojedynczego zaznaczenia.

# MSG_DRAG_LINES (56//)
source: Visible lines
pl: Widoczne linie

# MSG_DRAG_LINES_HELP (57//)
source: Give the max. number of lines which will be shown when doing drag&drop. If more lines are selected, you'll get a message similar to: 'Dragging xx Items...'.
pl: Okre¶l maksymaln± liczbê linii, które bêd± wy¶wietlane podczas operacji przeci±gania. Je¶li zostanie zaznaczona wiêksza liczba linii ujrzysz komunikat podobny do: "Przeci±ganie xx elementów...".

# MSG_PAGE_FONTS (58//)
source: Fonts
pl: Czcionki

# MSG_PAGE_COLORS (59//)
source: Colors
pl: Kolory

# MSG_PAGE_OPTIONS (60//)
source: Options
pl: Opcje

# MSG_PAGE_SCROLLING (61//)
source: Scrolling
pl: Przewijanie

# MSG_PAGE_KEYBINDINGS (62//)
source: Keybindings
pl: Przypisanie klawiszy

# MSG_SB_HORIZONTAL (63//)
source: Horizontal Scrollbar
pl: Suwak poziomy

# MSG_SB_HORIZONTAL_HELP (64//)
source: Set the default mode for the horizontal scrollbar. (may be overwritten by an application)
pl: Ustawia domy¶ly tryb pracy suwaka poziomego. (ustawienie to może byæ zmienione przez aplikacje)

# MSG_SB_VERTICAL (65//)
source: Vertical Scrollbar
pl: Suwak pionowy

# MSG_SB_VERTICAL_HELP (66//)
source: Set the default mode for the vertical scrollbar. (may be overwritten by an application)
pl: Ustawia domy¶ly tryb pracy suwaka pionowego. (ustawienie to może byæ zmienione przez aplikacje)

# MSG_SCROLLCONTROL (67//)
source: Scrolling Control
pl: Kontrola przewijania

# MSG_SMOOTH_SCROLLING (68//)
source: Smooth Scrolling
pl: Płynne przewijanie

# MSG_SMOOTH_SCROLLING_HELP (69//)
source: If enabled, smoothing scrolling will be used for NList objects. In addition, by using the 'smooth' slider in the normal MUI 'Listview' configuration page the speed of the smooth scrolling can be controled.
pl: Je¶li ta opcja jest wł±czona, używane bêdzie płynne przewijanie obiektów klasy NList. Dodatkowo, używaj±c suwaka "płynno¶æ" na stronie ustawień "Listy wy¶wietlania" MUI można kontrolowaæ szybko¶æ płynnego przewijania.

# MSG_MMB_FASTWHEEL (70//)
source: MMB Fast Wheel
pl: Szybkie przewijanie z ŠPM

# MSG_MMB_FASTWHEEL_HELP (71//)
source: If enabled, the middle mouse button can be used as a qualifier to perform a fast scroll wheel action. (See 'Keybindings' page as well for more wheel qualifiers)
pl: Je¶li ta opcja jest wł±czona, ¶rodkowy przycisk myszki może byæ używany jako klawisz wywołuj±cy szybkie przewijanie zawarto¶ci kółkiem myszki. (Zobacz zakładkê "Przypisanie klawiszy" by zobaczyæ pozostałe klawisze wywołuj±ce)

# MSG_WHEEL_STEP (72//)
source: Mouse Wheel Step
pl: Krok przewijania kółkiem

# MSG_WHEEL_STEP_HELP (73//)
source: Allows to specify the amount of lines that should be scrolled when using a wheel mouse.
pl: Pozwala na okre¶lenie liczby linii przewijanych przy użyciu przewijania kółkiem myszki.

# MSG_WHEEL_FAST (74//)
source: Mouse Wheel Fast Step
pl: Szybki krok przewijania kółkiem

# MSG_WHEEL_FAST_HELP (75//)
source: Allows to specify the amount of lines that should be scrolled when using a wheel mouse and when the fast wheel qualifier is pressed.
pl: Pozwala na okre¶lenie liczby linii przewijanych przy użyciu przewijania kółkiem myszki z wci¶niêtym klawiszem wywołuj±cym szybkiego przewijania.

# MSG_LAYOUT (76//)
source: Layout
pl: Układ

# MSG_PARTIAL_COL_MARK (77//)
source: Partial column mark
pl: Znacznik czê¶ciowych kolumn

# MSG_PARTIAL_COL_MARK_HELP (78//)
source: If enabled, a special mark will be drawn at the right side of a column in case the text didn't completly fit into it.
pl: Je¶li ta opcja jest wł±czona, zpecjalny znacznik bêdzie rysowany po prawej stronie kolumny w przypadku, gdy tekst nie zmie¶ci siê w calo¶ci w kolumnie.

# MSG_PARTIAL_CHARS_DRAWN (79//)
source: Partial chars drawn
pl: Wy¶wietlaj czê¶ciowo znaki

# MSG_PARTIAL_CHARS_DRAWN_HELP (80//)
source: If enabled, characters that are not fully visible at the left and right corner of an NList object will not be drawn partially.
pl: Je¶li ta opcja jest wł±czona, znaki, które nie s± w pełni widoczne przy lewej i prawej krawêdzi obiektu NList, bêd± wy¶wietlane czê¶ciowo.

# MSG_VERT_CENTERED (81//)
source: Vertical centered lines
pl: Linie wycentrowane w pionie

# MSG_VERT_CENTERED_HELP (82//)
source: If activated, the text lines are centered vertically in a NList object.
pl: Je¶li ta opcja jest wł±czona, linie tekstowe bêd± centrowane w pionie w obiektach klasy NList.

# MSG_BALANCING_COLS (83//)
source: Balancing Columns
pl: Balans kolumn

# MSG_BALANCING_COLS_HELP (84//)
source: NList permits to change the column width via mouse dragging the column separator in the title bar. The moved bar can be visible either only in the title, throughout the whole lines or the column width changes can be made visible instantly.
pl: Klasa NList pozwala na zmianê szeroko¶ci kolumn przez przeci±ganie myszk± separatora kolum na belce tytułowej. Przeci±gana belka może byæ widoczna w belce tytułowej, jako linia widoczna na całej wysoko¶ci kolumny, lub też zmiany mog± byæ widoczne od razu.

# MSG_COLWIDTHDRAG_TITLE (85//)
source: Title Bar
pl: belka tytułowa

# MSG_COLWIDTHDRAG_FULLBAR (86//)
source: Full Bar
pl: kolumna

# MSG_COLWIDTHDRAG_VISIBLE (87//)
source: Visible
pl: widoczny

# MSG_COLOR_OPTIONS (88//)
source: Options
pl: Opcje

# MSG_FORCE_SELECT_PEN (89//)
source: Force select pen
pl: Wymu¶ wybrane pisaki

# MSG_FORCE_SELECT_PEN_HELP (90//)
source: If enabled, NList will make sure that the 'Selected', 'Cursor' and 'Unselected' color will be forced.
pl: Je¶li ta opcja jest wł±czona, klasa NList wymusi używania kolorów wybranych dla elementów: "zaznaczone", "kursor" i "odznaczone".

# MSG_MULTISEL_MOVEACTIVE (91//)
source: Keyboard moves cursor
pl: Klawisze przesuwaj± kursor

# MSG_MULTISEL_MOVEACTIVE_HELP (92//)
source: If enabled, a keyboard use in an NList object will move the active cursor rather than the unselected one.
pl: Je¶li ta opcja jest wł±czona, klawisze używane w obiekcie klasy NList bêd± przesuwały aktywny kursor zamiast odznaczonego.

# MSG_GROUP_MISC (93//)
source: Miscellaneous
pl: Różne

# MSG_GROUP_EXAMPLE (94//)
source: Example
pl: Przykład

# MSG_SERMOUSE_FIX (95//)
source: Serial Mouse Fix
pl: Poprawka na myszkê szeregow±

# MSG_SERMOUSE_FIX_HELP (96//)
source: If enabled, NList tries to fix common drag&drop issues that are related to using a serial mouse.
pl: Je¶li ta opcja jest wł±czona, klasa NList spróbuje obej¶æ najczêstsze problemy wystêpuj±ce podczas przeci±gania elementów zwi±zane z używaniem myszki szeregowej.

# MSG_SELECT_POINTER (97//)
source: Custom Select Pointer
pl: Własny kursor zaznaczania

# MSG_SELECT_POINTER_HELP (98//)
source: If enabled, and an NList object is in charwise selection mode a custom select pointer will be displayed instead of the default workbench mouse pointer image.
pl: Je¶li ta opcja jest wł±czona i obiekt klasy NList jest w trybie zaznaczania znaków, bêdzie używany własny kursor zaznaczania zamiast domy¶lnego, systemowego wskaŒnika myszki.

# MSG_BAR_CONTEXTMENU (99//)
source: Context Menu
pl: Menu kontekstowe

# MSG_DEFAULT_CONTEXT_MENU_HELP (100//)
source: NList permits to have its default context menu being disabled or enabled or only in case the mouse is at the top of the NList object.
pl: Klasa NList pozwala na wł±czenie lub wył±czenie jej domy¶lnego menu podrêcznego, lub wł±czenie go tylko w przypadku, gdy wskaŒnik myszki znajduje siê na górze obiektu NList.

# MSG_SNOOP (101//)
source: Snoop
pl: Przechwyæ

# MSG_SNOOP_KEY (102//)
source: Start the grab of a hotkey.
pl: Rozpoczyna przechwytywanie klawisza wywołuj±cego.

# MSG_BUTTON_INSERT (103//)
source: Insert
pl: Wstaw

# MSG_BUTTON_INSERT_HELP (104//)
source: Allows to insert a new hotkey.
pl: Pozwala na dodanie nowego klawisza wywołuj±cego.

# MSG_BUTTON_REMOVE (105//)
source: Remove
pl: Usuń

# MSG_BUTTON_REMOVE_HELP (106//)
source: Allows to remove an existing hotkey.
pl: Pozwala na usuniêcie istniej±cego klawisza wywołuj±cego.

# MSG_BUTTON_UPDATEKEYS (107//)
source: Update keys
pl: Aktualizuj klawisze

# MSG_BUTTON_UPDATEKEYS_HELP (108//)
source: Add the default hotkeys for the functions which are not currently in the list.
pl: Dodaje domy¶lne klawisze wywołuj±ce do funkcji, które obecnie nie znajduj± siê na li¶cie.

# MSG_BUTTON_DEFAULTKEYS (109//)
source: Default keys
pl: Klawisze domy¶lne

# MSG_BUTTON_DEFAULTKEYS_HELP (110//)
source: Resets all hotkeys to default ones.
pl: Przywraca ustawienia wszystich klawiszy wywołuj±cych do warto¶ci domy¶lnych.

# MSG_FUNC_MULTISELQUAL (111//)
source: Multiselect/Block Qualifier
pl: Klawisz wywołuj±cy zaznaczanie wielu/bloku

# MSG_FUNC_DRAGQUAL (112//)
source: Drag&Drop Qualifier
pl: Klawisz wywołuj±cy przeci±ganie

# MSG_FUNC_BALANCEQUAL (113//)
source: Balance Qualifier
pl: Klawisz wywołuj±cy balans obiektów

# MSG_FUNC_COPYCLIP (114//)
source: Copy to clipboard
pl: Skopiuj do schowka

# MSG_FUNC_DEFCOLWIDTH (115//)
source: Default width column
pl: Domy¶lna szeroko¶æ kolumny

# MSG_FUNC_DEFALLCOLWIDTH (116//)
source: Default width all columns
pl: Domy¶lna szeroko¶æ wszystkich kolumn

# MSG_FUNC_DEFORDERCOL (117//)
source: Default order column
pl: Domy¶lna kolejno¶æ kolumny

# MSG_FUNC_DEFALLORDERCOL (118//)
source: Default order all columns
pl: Domy¶lna kolejno¶æ wszystkich kolumn

# MSG_FUNC_SELECTTOP (119//)
source: Select to top
pl: Zaznacz do pocz±tku

# MSG_FUNC_SELECTBOTTOM (120//)
source: Select to bottom
pl: Zaznacz do końca

# MSG_FUNC_SELECTPAGEUP (121//)
source: Select to page up
pl: Zaznacz stronê w górê

# MSG_FUNC_SELECTPAGEDOWN (122//)
source: Select to page down
pl: Zaznacz stronê w dół

# MSG_FUNC_SELECTUP (123//)
source: Select up
pl: Zaznacz w górê

# MSG_FUNC_SELECTDOWN (124//)
source: Select down
pl: Zaznacz w dół

# MSG_FUNC_TOGGLEACTIVE (125//)
source: Toggle active
pl: Przeł±cz aktywny element

# MSG_FUNC_FASTWHEELQUAL (126//)
source: Fast MouseWheel Qualifier
pl: Klawisz wywołuj±cy szybkie przewijanie kółkiem

# MSG_FUNC_HORIZWHEELQUAL (127//)
source: Horiz MouseWheel Qualifier
pl: Klawisz wywołuj±cy przewijanie kółkiem w poziomie

# MSG_FUNC_TITLECLICKQUAL (128//)
source: Title Click Qualifier
pl: Klawisz wywołuj±cy wci¶niêcie tytułu

# MSG_VSB_ALWAYS (129//)
source: Always
pl: zawsze

# MSG_VSB_AUTO (130//)
source: Auto
pl: automatycznie

# MSG_VSB_FULLAUTO (131//)
source: FullAuto
pl: w pełni automatycznie

# MSG_HSB_ALWAYS (132//)
source: Always
pl: zawsze

# MSG_HSB_AUTO (133//)
source: Auto
pl: autmatycznie

# MSG_HSB_FULLAUTO (134//)
source: FullAuto
pl: w pełni automatycznie

# MSG_HSB_NONE (135//)
source: None
pl: brak

# MSG_CMENU_ALWAYS (136//)
source: Always
pl: zawsze

# MSG_CMENU_TOPONLY (137//)
source: TopOnly
pl: tylko górne

# MSG_CMENU_NEVER (138//)
source: Never
pl: nigdy

# MSG_HOTKEYS_KEY (139//)
source: Key
pl: Klawisz

# MSG_HOTKEYS_ACTION (140//)
source: Action
pl: Działanie

# MSG_EXAMPLE_TEXT (141//)
source: If you have problems, try to increase the stack value, in the icon infos if you launch the program from icon, stack of CLI if you start it from CLI/Shell, and if you launch it from some utility read its docs to see how to increase it. A stack of 12Kb, 16Kb or 20Kb is most of time a good idea. If you still have problems, try to see if they happen with the Demo prog, then tell me. \033C Latest public release can be found on aminet (dev/mui). All releases are available on http://www.sourceforge.net/projects/nlist-classes/ \033C \033r\0333(C) 2001-2013 by NList Open Source Team \033r\0333(C) 1996-1998 by Gilles Masson \033r\0333http://www.sourceforge.net/projects/nlist-classes/ \033C \033cThis new list/listview custom class \033chandles its own configurable backgrounds, \033cpens, fonts, scrollbars, keys and qualifiers \033C \033cThe way used to handle cursor with multiselection \033cis not exactly as the listview one ! \033cDrag&Drop is supported, both scrollbars \033ccan be configured to disappear automatically \033cwhen not needed because all is visible. \033cJust try it... \033C \033cYou can horizontaly scroll with cursor keys, \033cor going on the right and left of the list \033cwhile selecting with the mouse. \033cTry just clicking on the left/right borders ! \033C \033cYou can change columns widths just dragging \033cthe vertical separator between columns titles \033c(try it using the balancing qualifier too). \033C \033cYou can change columns order just dragging \033cthe column titles. \033C \033cThere is builtin copy to clipboard stuff \033cand classic char selection capability. \033C \033cTry the Demo program to test all that... \033r\033bGive some feedback about it ! :-) \033C **************************************************************************************************
pl: Je¶li masz jakie¶ problemy z działaniem klasy, spróbuj zwiêkszyæ wielko¶æ stosu w ikonce programu (w przypadku uruchamiania programu z ikonki) lub wielko¶æ stosu w linii poleceń (w przypadku uruchamiania programu z CLI/shella), je¶li za¶ uruchamiasz obiekty klasy NList z poziomu innego programu, przeczytaj jego dokumentacjê by dowiedzieæ siê jak zwiêkszyæ dla niegowielko¶æ stosu. Stos o wielko¶ci 12kb, 16kb lub 20kb w wiêkszo¶ci przypadków jest wystarczaj±cy. Je¶li nadal masz jakie¶ problemy, spróbuj sprawdziæ, czy wystêpuj± one z programami demonstracyjnymi, je¶li tak, zgło¶ je do mnie. \033C Najnowsz± publicznie dostêpn± wersjê można znaleŒæ na Aminecie (dev/mui). Wszystkie udostêpnione wersje dostêpne s± pod adresem: http://www.sourceforge.net/projects/nlist-classes/ \033C \033r\0333(C) 2001-2013 by NList Open Source Team \033r\0333(C) 1996-1998 by Gilles Masson \033r\0333http://www.sourceforge.net/projects/nlist-classes/ \033C \033cTa nowa klasa własna MUI list/list wy¶wietlania \033cobsługuje własne konfigurowalne tła, pisaki, \033cczcionki, suwaki, klawisze i klawisze wywołuj±ce \033C \033cSposób obsługi kursora w trybie zaznaczania wielu \033celementów nie jest dokładnie taki sam jak w li¶cie wy¶wietlania! \033cObsługiwane jest przeci±ganie i upuszczanie elementów, oba suwaki \033cmog± zostaæ skonfigurowane do automatycznego znikania \033cgdy nie s± potrzebne, gdyż cały wy¶wietlany tekst jest widoczy. \033cPo prostu wypróbuj nowe funkcje... \033C \033cMożesz przewijaæ tekst w poziomie przy użyciu klawiszy kursora, \033club przesuwaj±c myszkê w lewo i prawo w trakcie zaznaczania myszk±. \033cSpróbuj po prostu klikn±æ na lewej/prawej krawêdzi! \033C \033cMożesz zmieniaæ szeroko¶æ kolumn po prostu przeci±gaj±c \033cpionowy separator pomiêdzy tytułami kolum \033c(spróbuj też użyæ klawiszy wywołuj±cych balans obiektów). \033C \033cMożesz zmieniaæ kolejno¶æ kolumn przeci±gaj±c nazwy kolumn. \033C \033cWbudowana jest także obsługa kopiowania tekstu do schowka \033coraz możliwo¶æ klasycznego zaznaczania znaków. \033C \033cWypróbuj programy demonstracyjne, by poznaæ wszystkie możliwo¶ci... \033r\033bDaj nam znaæ je¶li co¶ jest nie tak! :-) \033C **************************************************************************************************
