Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlistviews_mcp/locale/swedish.po
Languages: sv

# MSG_FONTS (0//)
source: Fonts
sv: Typsnitt

# MSG_NORMAL_FONT (1//)
source: Normal Font:
sv: Normalt typsnitt:

# MSG_NORMAL_FONT_HELP (2//)
source: Choose the normal NList font.
sv: Välj normalt NList typsnitt.

# MSG_NORMAL_FONT_ASL (3//)
source: Please select the normal font...
sv: Var god välj normalt typsnitt...

# MSG_SMALL_FONT (4//)
source: Small Font:
sv: Litet typsnitt:

# MSG_SMALL_FONT_HELP (5//)
source: Choose the small NList font.
sv: Välj litet NList typsnitt.

# MSG_SMALL_FONT_ASL (6//)
source: Please select a small font...
sv: Var god välj litet typsnitt...

# MSG_FIXED_FONT (7//)
source: Fixed Font:
sv: Fast typsnitt:

# MSG_FIXED_FONT_HELP (8//)
source: Choose the fixed NList font.
sv: Välj fast NList typsnitt.

# MSG_FIXED_FONT_ASL (9//)
source: Please select a fixed font...
sv: Var god välj ett fast typsnitt...

# MSG_FONT_MARGIN (10//)
source: Font Margin:
sv: Typsnittsmarginal:

# MSG_FONT_MARGIN_HELP (11//)
source: Allows to set a vertical margin which will be added to the font height and result in the default line height in an NList object.
sv: Tillåter att sätta en vertikal marginal som läggs till på typsnittshöjden och resulterar i den förvalda linjehöjden i ett NList objekt.

# MSG_COLORS (12//)
source: Colors
sv: Färger

# MSG_TEXTCOLOR (13//)
source: Text Pen
sv: Text penna

# MSG_BACKGROUNDCOLOR (14//)
source: Background
sv: Bakgrund

# MSG_TITLE_PEN_WIN (15//)
source: Title Pen
sv: Titel penna

# MSG_TITLE_PEN_HELP (16//)
source: For adjusting the pen color of a title.
sv: För justering av pennfärgen för en titel.

# MSG_PBG_TITLE (17//)
source: \033cTitle
sv: \033cTitel

# MSG_TITLE_BG_WIN (18//)
source: Title Background
sv: Titelbakgrund

# MSG_TITLE_BG_HELP (19//)
source: For adjusting the background color of a title.
sv: För justering av bakgrundsfärgen för en titel.

# MSG_LIST_PEN_WIN (20//)
source: List Pen
sv: List penna

# MSG_LIST_PEN_HELP (21//)
source: For adjusting the pen color of a list.
sv: För justering av pennfärgen för en lista.

# MSG_PBG_LIST (22//)
source: \033cList
sv: \033cLista

# MSG_LIST_BG_WIN (23//)
source: List Background
sv: Listbakgrund

# MSG_LIST_BG_HELP (24//)
source: For adjusting the background color of a list.
sv: För justering av bakgrundsfärgen för en lista.

# MSG_SELECT_PEN_WIN (25//)
source: Selected Entry
sv: Vald post

# MSG_SELECT_PEN_HELP (26//)
source: For adjusting the pen color of selected entries.
sv: För justering av pennfärgen för valda poster.

# MSG_PBG_SELECT (27//)
source: \033cSelected
sv: \033cVald

# MSG_SELECT_BG_WIN (28//)
source: Selected Entry
sv: Vald post

# MSG_SELECT_BG_HELP (29//)
source: For adjusting the background color of selected entries.
sv: För justering av bakgrundsfärgen för valda poster.

# MSG_CURSOR_PEN_WIN (30//)
source: Selected Cursor
sv: Vald markör

# MSG_CURSOR_PEN_HELP (31//)
source: For adjusting the pen color of a selected cursor.
sv: För justering av pennfärgen för vald markör.

# MSG_PBG_CURSOR (32//)
source: \033cCursor
sv: \033cMarkör

# MSG_CURSOR_BG_WIN (33//)
source: Selected Cursor
sv: Vald markör

# MSG_CURSOR_BG_HELP (34//)
source: For adjusting the background color of a selected cursor.
sv: För justering av bakgrundsfärgen för vald markör.

# MSG_UNSEL_PEN_WIN (35//)
source: Unselected Cursor
sv: Ovald markör

# MSG_UNSEL_PEN_HELP (36//)
source: For adjusting the pen color of an unselected cursor.
sv: För justering av pennfärgen för en ovald markör.

# MSG_PBG_UNSEL (37//)
source: \033cUnselected
sv: \033cOvald

# MSG_UNSEL_BG_WIN (38//)
source: Unselected Cursor
sv: Ovald markör

# MSG_UNSEL_BG_HELP (39//)
source: For adjusting the background color of an unselected cursor.
sv: För justering av bakgrundsfärgen för en ovald markör.

# MSG_INACT_PEN_WIN (40//)
source: Inactive Cursor
sv: Inaktiv markör

# MSG_INACT_PEN_HELP (41//)
source: For adjusting the pen color of an inactive cursor.
sv: För justering av pennfärgen för en inaktiv markör.

# MSG_PBG_INACT (42//)
source: \033cInactive
sv: \033cInaktiv

# MSG_INACT_BG_WIN (43//)
source: Inactive Cursor
sv: Inaktiv markör

# MSG_INACT_BG_HELP (44//)
source: For adjusting the background color of an inactive cursor.
sv: För justering av bakgrundsfärgen för en inaktiv markör.

# MSG_MULTISELECT (45//)
source: MultiSelection
sv: Flerval

# MSG_MULTISELECT_QUAL (46//)
source: via Qualifier
sv: via kvalificering

# MSG_MULTISELECT_ALWAYS (47//)
source: Always
sv: Alltid

# MSG_MULTISELECT_HELP (48//)
source: Allows to specify the default multiselection mode.
sv: Tillåter att specifiera förvalt flervalsläge.

# MSG_MMB_MULTISEL (49//)
source: MMB multiselection
sv: MMK flerval

# MSG_MMB_MULTISEL_HELP (50//)
source: Set it if you want to use the middle mouse button (MMB) as a multiselection qualifier.
sv: Välj om du vill använda mittenmusknappen (MMK) som flervalskvalificerare.

# MSG_DRAGDROP (51//)
source: Drag&Drop
sv: Dra&släpp

# MSG_DRAGTYPE_IMMEDIATE (52//)
source: Immediate
sv: Omeddelbar

# MSG_DRAGTYPE_BORDERS (53//)
source: at Borders
sv: vid kanter

# MSG_DRAGTYPE_QUALIFIER (54//)
source: via Qualifier
sv: via kvalificerare

# MSG_DRAGTYPE_HELP (55//)
source: Set the drag mode. 'Immediate' will start drag&drop as soon as you drag an object. 'at Borders' for showing a drag operation as soon as you passed the left/right borders and 'via Qualifier' for only allowing to drag&drop via a qualifier key (see 'Keys'). 'Immediate' is used only when in no-multiselect mode.
sv: Välj dragläge. 'Omeddelbar' startar dra&släpp så fort du drar ett objekt. 'vid kanter' för att visa en drag operation så snart du passerat vänster/höger kanter och 'via kvalificerare' för att endast tillåta dra&släpp via en kvalificeringstangent (se 'Tangenter'). 'Omeddelbar' används endast i icke-flervalsläge.

# MSG_DRAG_LINES (56//)
source: Visible lines
sv: Synliga linjer

# MSG_DRAG_LINES_HELP (57//)
source: Give the max. number of lines which will be shown when doing drag&drop. If more lines are selected, you'll get a message similar to: 'Dragging xx Items...'.
sv: Ange max antal linjer som kommer att visas vid dra&släpp. Om fler linjer är valda, kommer du att se ett meddelande liknande: 'Drar xx objekt...'.

# MSG_PAGE_FONTS (58//)
source: Fonts
sv: Typsnitt

# MSG_PAGE_COLORS (59//)
source: Colors
sv: Färger

# MSG_PAGE_OPTIONS (60//)
source: Options
sv: Alternativ

# MSG_PAGE_SCROLLING (61//)
source: Scrolling
sv: Skrollning

# MSG_PAGE_KEYBINDINGS (62//)
source: Keybindings
sv: Tangentbindningar

# MSG_SB_HORIZONTAL (63//)
source: Horizontal Scrollbar
sv: Horisontellt dragreglage

# MSG_SB_HORIZONTAL_HELP (64//)
source: Set the default mode for the horizontal scrollbar. (may be overwritten by an application)
sv: Välj förvalt läge för horisontellt dragreglage. (kan ändras av ett program)

# MSG_SB_VERTICAL (65//)
source: Vertical Scrollbar
sv: Vertikalt dragreglage

# MSG_SB_VERTICAL_HELP (66//)
source: Set the default mode for the vertical scrollbar. (may be overwritten by an application)
sv: Välj förvalt läge för vertikalt dragreglage. (kan ändras av ett program)

# MSG_SCROLLCONTROL (67//)
source: Scrolling Control
sv: Skrollkontroll

# MSG_SMOOTH_SCROLLING (68//)
source: Smooth Scrolling
sv: Mjuk skrollning

# MSG_SMOOTH_SCROLLING_HELP (69//)
source: If enabled, smoothing scrolling will be used for NList objects. In addition, by using the 'smooth' slider in the normal MUI 'Listview' configuration page the speed of the smooth scrolling can be controled.
sv: Om vald, kommer mjuk skrollning att användas för NList objekt. Som tillägg, vid användning av 'mjuk' reglaget i normala MUI 'Listview' konfigurationssidan kan hastigheten kontrolleras.

# MSG_MMB_FASTWHEEL (70//)
source: MMB Fast Wheel
sv: MMK Snabbhjul

# MSG_MMB_FASTWHEEL_HELP (71//)
source: If enabled, the middle mouse button can be used as a qualifier to perform a fast scroll wheel action. (See 'Keybindings' page as well for more wheel qualifiers)
sv: Om vald, kommer mittenmusknappen att användas som en kvalificerare för att utföra en snabb hjulskroll. (Se 'tangentbindningar' sidan också för fler hjulkvalificerare)

# MSG_WHEEL_STEP (72//)
source: Mouse Wheel Step
sv: Mushjul steg

# MSG_WHEEL_STEP_HELP (73//)
source: Allows to specify the amount of lines that should be scrolled when using a wheel mouse.
sv: Tillåter att specifiera antal linjer som skrollas vid användning av en mus med skrollhjul.

# MSG_WHEEL_FAST (74//)
source: Mouse Wheel Fast Step
sv: Mushjul snabbsteg

# MSG_WHEEL_FAST_HELP (75//)
source: Allows to specify the amount of lines that should be scrolled when using a wheel mouse and when the fast wheel qualifier is pressed.
sv: Tillåter att specifiera antal linjer som skrollas vid användning av en mus med skrollhjul och när snabbhjulskvalificeraren är nedtryckt.

# MSG_PARTIAL_COL_MARK (77//)
source: Partial column mark
sv: Delvis kolumnmarkering

# MSG_PARTIAL_COL_MARK_HELP (78//)
source: If enabled, a special mark will be drawn at the right side of a column in case the text didn't completly fit into it.
sv: Om vald, kommer en speciell markering att visas på höger sida av en kolumn, ifall texten inte ryms.

# MSG_PARTIAL_CHARS_DRAWN (79//)
source: Partial chars drawn
sv: Tecken delvis ritade

# MSG_PARTIAL_CHARS_DRAWN_HELP (80//)
source: If enabled, characters that are not fully visible at the left and right corner of an NList object will not be drawn partially.
sv: Om vald, så kommer tecken som inte är fullt synliga vid vänster och höger hörn av ett NList objekt att inte ritas delvis.

# MSG_VERT_CENTERED (81//)
source: Vertical centered lines
sv: Vertikalt centrerade linjer

# MSG_VERT_CENTERED_HELP (82//)
source: If activated, the text lines are centered vertically in a NList object.
sv: Om aktiverat, så kommer textlinjer att centreras vertikalt i ett NList objekt.

# MSG_BALANCING_COLS (83//)
source: Balancing Columns
sv: Balancerade kolumner

# MSG_BALANCING_COLS_HELP (84//)
source: NList permits to change the column width via mouse dragging the column separator in the title bar. The moved bar can be visible either only in the title, throughout the whole lines or the column width changes can be made visible instantly.
sv: NList tillåter att ändra kolumnbredden via mus, genom att dra i kolumnseparatorn i titelraden. Den flyttade raden kan visas antingen endast i titeln, genom hela linjer eller så kan ändringarna visas direkt.

# MSG_COLWIDTHDRAG_TITLE (85//)
source: Title Bar
sv: Titelrad

# MSG_COLWIDTHDRAG_FULLBAR (86//)
source: Full Bar
sv: Full rad

# MSG_COLWIDTHDRAG_VISIBLE (87//)
source: Visible
sv: Synlig

# MSG_COLOR_OPTIONS (88//)
source: Options
sv: Alternativ

# MSG_FORCE_SELECT_PEN (89//)
source: Force select pen
sv: Tvinga vald penna

# MSG_FORCE_SELECT_PEN_HELP (90//)
source: If enabled, NList will make sure that the 'Selected', 'Cursor' and 'Unselected' color will be forced.
sv: Om vald, kommer NList att kontrollera att 'vald', 'markör' och 'ovald' färg tvingas.

# MSG_MULTISEL_MOVEACTIVE (91//)
source: Keyboard moves cursor
sv: Tangentbord flyttar markör

# MSG_MULTISEL_MOVEACTIVE_HELP (92//)
source: If enabled, a keyboard use in an NList object will move the active cursor rather than the unselected one.
sv: Om vald, kommer tangentbordet som används i ett NList objekt att flytta den aktiva markören, istället för den ovalda.

# MSG_GROUP_MISC (93//)
source: Miscellaneous
sv: Övrigt

# MSG_GROUP_EXAMPLE (94//)
source: Example
sv: Exempel

# MSG_SERMOUSE_FIX (95//)
source: Serial Mouse Fix
sv: Seriell musfix

# MSG_SERMOUSE_FIX_HELP (96//)
source: If enabled, NList tries to fix common drag&drop issues that are related to using a serial mouse.
sv: Om vald, försöker NList att fixa vanliga dra&släpp problem som är vanligt vid användning av en seriell mus.

# MSG_SELECT_POINTER (97//)
source: Custom Select Pointer
sv: Specialpekare för val

# MSG_SELECT_POINTER_HELP (98//)
source: If enabled, and an NList object is in charwise selection mode a custom select pointer will be displayed instead of the default workbench mouse pointer image.
sv: Om vald och ett NList objekt är i teckenvist väljläge, kommer en speciell pekare för val att visas, istället för workbench standard pekare.

# MSG_BAR_CONTEXTMENU (99//)
source: Context Menu
sv: Kontextmeny

# MSG_DEFAULT_CONTEXT_MENU_HELP (100//)
source: NList permits to have its default context menu being disabled or enabled or only in case the mouse is at the top of the NList object.
sv: NList tillåter att dess förvalda kontextmeny, slås av eller på, eller endast när muspekaren är vid toppen av NList objektet.

# MSG_SNOOP (101//)
source: Snoop
sv: Läs av

# MSG_SNOOP_KEY (102//)
source: Start the grab of a hotkey.
sv: Börja avläsning av snabbtangent.

# MSG_BUTTON_INSERT (103//)
source: Insert
sv: Sätt in

# MSG_BUTTON_INSERT_HELP (104//)
source: Allows to insert a new hotkey.
sv: Tillåter insättning av en ny snabbtangent.

# MSG_BUTTON_REMOVE (105//)
source: Remove
sv: Ta bort

# MSG_BUTTON_REMOVE_HELP (106//)
source: Allows to remove an existing hotkey.
sv: Tillåter borttagning av en existerande snabbtangent.

# MSG_BUTTON_UPDATEKEYS (107//)
source: Update keys
sv: Uppdatera tangenter

# MSG_BUTTON_UPDATEKEYS_HELP (108//)
source: Add the default hotkeys for the functions which are not currently in the list.
sv: Lägg till förvalda snabbtangenter för de funktioner som förnärvarande inte finns i listan.

# MSG_BUTTON_DEFAULTKEYS (109//)
source: Default keys
sv: Förvalda tangenter

# MSG_BUTTON_DEFAULTKEYS_HELP (110//)
source: Resets all hotkeys to default ones.
sv: Återställer alla snabbtangenter till de förvalda.

# MSG_FUNC_MULTISELQUAL (111//)
source: Multiselect/Block Qualifier
sv: Flerval/block kvalificerare

# MSG_FUNC_DRAGQUAL (112//)
source: Drag&Drop Qualifier
sv: Dra&släpp kvalificerare

# MSG_FUNC_BALANCEQUAL (113//)
source: Balance Qualifier
sv: Balans kvalificerare

# MSG_FUNC_COPYCLIP (114//)
source: Copy to clipboard
sv: Kopiera till klippbordet

# MSG_FUNC_DEFCOLWIDTH (115//)
source: Default width column
sv: Förvald kolumnbredd

# MSG_FUNC_DEFALLCOLWIDTH (116//)
source: Default width all columns
sv: Förvald bredd alla kolumner

# MSG_FUNC_DEFORDERCOL (117//)
source: Default order column
sv: Förvald kolumnordning

# MSG_FUNC_DEFALLORDERCOL (118//)
source: Default order all columns
sv: Förvald ordning alla kolumner

# MSG_FUNC_SELECTTOP (119//)
source: Select to top
sv: Välj för överst

# MSG_FUNC_SELECTBOTTOM (120//)
source: Select to bottom
sv: Välj för nederst

# MSG_FUNC_SELECTPAGEUP (121//)
source: Select to page up
sv: Välj för sida upp

# MSG_FUNC_SELECTPAGEDOWN (122//)
source: Select to page down
sv: Välj för sida ned

# MSG_FUNC_SELECTUP (123//)
source: Select up
sv: Välj upp

# MSG_FUNC_SELECTDOWN (124//)
source: Select down
sv: Välj ned

# MSG_FUNC_TOGGLEACTIVE (125//)
source: Toggle active
sv: Växla aktiv

# MSG_FUNC_FASTWHEELQUAL (126//)
source: Fast MouseWheel Qualifier
sv: Snabb mushjulkvalificerare

# MSG_FUNC_HORIZWHEELQUAL (127//)
source: Horiz MouseWheel Qualifier
sv: Horisontell mushjulkvalificerare

# MSG_FUNC_TITLECLICKQUAL (128//)
source: Title Click Qualifier
sv: Titelklick kvalificerare

# MSG_VSB_ALWAYS (129//)
source: Always
sv: Alltid

# MSG_HSB_ALWAYS (132//)
source: Always
sv: Alltid

# MSG_HSB_NONE (135//)
source: None
sv: Ingen

# MSG_CMENU_ALWAYS (136//)
source: Always
sv: Alltid

# MSG_CMENU_TOPONLY (137//)
source: TopOnly
sv: Endast topp

# MSG_CMENU_NEVER (138//)
source: Never
sv: Aldrig

# MSG_HOTKEYS_KEY (139//)
source: Key
sv: Tangent

# MSG_HOTKEYS_ACTION (140//)
source: Action
sv: Händelse

# MSG_EXAMPLE_TEXT (141//)
source: If you have problems, try to increase the stack value, in the icon infos if you launch the program from icon, stack of CLI if you start it from CLI/Shell, and if you launch it from some utility read its docs to see how to increase it. A stack of 12Kb, 16Kb or 20Kb is most of time a good idea. If you still have problems, try to see if they happen with the Demo prog, then tell me. \033C Latest public release can be found on aminet (dev/mui). All releases are available on http://www.sourceforge.net/projects/nlist-classes/ \033C \033r\0333(C) 2001-2013 by NList Open Source Team \033r\0333(C) 1996-1998 by Gilles Masson \033r\0333http://www.sourceforge.net/projects/nlist-classes/ \033C \033cThis new list/listview custom class \033chandles its own configurable backgrounds, \033cpens, fonts, scrollbars, keys and qualifiers \033C \033cThe way used to handle cursor with multiselection \033cis not exactly as the listview one ! \033cDrag&Drop is supported, both scrollbars \033ccan be configured to disappear automatically \033cwhen not needed because all is visible. \033cJust try it... \033C \033cYou can horizontaly scroll with cursor keys, \033cor going on the right and left of the list \033cwhile selecting with the mouse. \033cTry just clicking on the left/right borders ! \033C \033cYou can change columns widths just dragging \033cthe vertical separator between columns titles \033c(try it using the balancing qualifier too). \033C \033cYou can change columns order just dragging \033cthe column titles. \033C \033cThere is builtin copy to clipboard stuff \033cand classic char selection capability. \033C \033cTry the Demo program to test all that... \033r\033bGive some feedback about it ! :-) \033C **************************************************************************************************
sv: Om du har problem, försök öka stackvärdet i ikon informationen om du startar programmet via ikonen. Stacken för CLI om du startar det från CLI Shell och om du startar det från något annat verktyg, läs dess dokumentation hur du ökar stackstorleken. En stack på 12kb, 16kb eller 20kb räcker vanligtvis. Om du fortfarande har problem, se om det händer med demo programmet, kontakta mig sedan. \033C Senaste release kan hittas på Aminet (dev/mui). Alla releaser finns på http://www.sourceforge.net/projects/nlist-classes/ \033C \033r\0333(C) 2001-2012 av NList Open Source Team \033r\0333(C) 1996-1998 av Gilles Masson \033r\0333http://www.sourceforge.net/projects/nlist-classes/ \033C \033cDenna nya list/listvy specialklass \033chanterar sina egna konfigurerbara bakgrunder, \033cpennor, typsnitt, rullister, tangenter och kvalificerare. \033C \033cTidigare sätt att hantera markör med flerval \033cär inte exakt samma som listvyn ! \033cDra&släpp stöds, båda rullisterna kan konfigureras \033catt försvinna automatiskt när de inte behövs, \033ceftersom allt är synligt. Prova det... \033C \033cDu kan rulla horisontellt med tangenterna \033celler gå till höger och vänster om listen \033coch samtidigt välja med musen. \033cProva klicka på vänster/höger ramar ! \033C \033cDu kan ändra kolumnernas bredd genom att dra i \033cden vertikala separatorn mellan kolumntitlarna \033c(prova med att använda balanskvalificeraren också). \033C \033cDu kan ändra kolumnernas ordning genom att dra i kolumntitlarna. \033C \033cDet finns inbyggd kopiera till klippbordet \033coch klassiskt teckenval kapacitet. \033C \033cProva demo programmet för att pröva allt detta... \033r\033bGe feedback om det ! :-) \033C **************************************************************************************************
