Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/nlist/nlistviews_mcp/locale/turkish.po
Languages: tr

# MSG_FONTS (0//)
source: Fonts
tr: Yazıtipi

# MSG_NORMAL_FONT (1//)
source: Normal Font:
tr: Normal Yazıtipi:

# MSG_NORMAL_FONT_HELP (2//)
source: Choose the normal NList font.
tr: Normal NList yazıtipini seçin.

# MSG_NORMAL_FONT_ASL (3//)
source: Please select the normal font...
tr: Normal yazıtipini seçin...

# MSG_SMALL_FONT (4//)
source: Small Font:
tr: Küçük Yazıtipi:

# MSG_SMALL_FONT_HELP (5//)
source: Choose the small NList font.
tr: Küçük NList yazıtipini seçin.

# MSG_SMALL_FONT_ASL (6//)
source: Please select a small font...
tr: Lütfen küçük yazıtipi seçiniz...

# MSG_FIXED_FONT (7//)
source: Fixed Font:
tr: Sabit genişlikli:

# MSG_FIXED_FONT_HELP (8//)
source: Choose the fixed NList font.
tr: Sabit genişlikli NList yazıtipini seçin.

# MSG_FIXED_FONT_ASL (9//)
source: Please select a fixed font...
tr: Lütfen sabit genişlikli bir yazıtipi seçin...

# MSG_FONT_MARGIN (10//)
source: Font Margin:
tr: Yazıtipi sınırı:

# MSG_FONT_MARGIN_HELP (11//)
source: Allows to set a vertical margin which will be added to the font height and result in the default line height in an NList object.
tr: Gireceğiniz değere yazıtipinin yüksekliği de eklenir ve NList nesnelerinin varsayılan satır yüksekliğini olarak kullanılır.

# MSG_COLORS (12//)
source: Colors
tr: Renkler

# MSG_TEXTCOLOR (13//)
source: Text Pen
tr: Metin Rengi

# MSG_BACKGROUNDCOLOR (14//)
source: Background
tr: Art alan

# MSG_TITLE_PEN_WIN (15//)
source: Title Pen
tr: Başlık Rengi

# MSG_TITLE_PEN_HELP (16//)
source: For adjusting the pen color of a title.
tr: Başlıkların yazılacağı rengi ayarlamak için kullanılır.

# MSG_PBG_TITLE (17//)
source: \033cTitle
tr: \033cBaşlık

# MSG_TITLE_BG_WIN (18//)
source: Title Background
tr: Başlık Art Alanı

# MSG_TITLE_BG_HELP (19//)
source: For adjusting the background color of a title.
tr: Başlıkların art alan rengini ayarlamak için kullanılır.

# MSG_LIST_PEN_WIN (20//)
source: List Pen
tr: Liste Rengi

# MSG_LIST_PEN_HELP (21//)
source: For adjusting the pen color of a list.
tr: Bir listelerin yazılacağı rengi ayarlamak için kullanılır.

# MSG_PBG_LIST (22//)
source: \033cList
tr: \033cListe

# MSG_LIST_BG_WIN (23//)
source: List Background
tr: Liste Art Alanı

# MSG_LIST_BG_HELP (24//)
source: For adjusting the background color of a list.
tr: Bir listenin art alan rengini ayarlamak için kullanılır.

# MSG_SELECT_PEN_WIN (25//)
source: Selected Entry
tr: Seçilmiş Girdi

# MSG_SELECT_PEN_HELP (26//)
source: For adjusting the pen color of selected entries.
tr: Seçilmiş girdilerin rengini ayarlamak için kullanılır.

# MSG_PBG_SELECT (27//)
source: \033cSelected
tr: \033cSeçilmiş

# MSG_SELECT_BG_WIN (28//)
source: Selected Entry
tr: Seçilmiş Girdi

# MSG_SELECT_BG_HELP (29//)
source: For adjusting the background color of selected entries.
tr: Seçilmiş girdilerin art alan rengini ayarlamak için kullanılır.

# MSG_CURSOR_PEN_WIN (30//)
source: Selected Cursor
tr: Seçilmiş İmleç

# MSG_CURSOR_PEN_HELP (31//)
source: For adjusting the pen color of a selected cursor.
tr: Seçilmiş bir imlecin renginin ayarlanması için kullanılır.

# MSG_PBG_CURSOR (32//)
source: \033cCursor
tr: \033cİmleç

# MSG_CURSOR_BG_WIN (33//)
source: Selected Cursor
tr: Seçilmiş İmleç

# MSG_CURSOR_BG_HELP (34//)
source: For adjusting the background color of a selected cursor.
tr: Seçilmiş bir imlecin art alan rengini ayarlamak için kullanılır.

# MSG_UNSEL_PEN_WIN (35//)
source: Unselected Cursor
tr: Seçilmemiş İmleç

# MSG_UNSEL_PEN_HELP (36//)
source: For adjusting the pen color of an unselected cursor.
tr: Seçilmemiş bir imlecin rengini ayarlamak için kullanılır.

# MSG_PBG_UNSEL (37//)
source: \033cUnselected
tr: \033cSeçilmemiş

# MSG_UNSEL_BG_WIN (38//)
source: Unselected Cursor
tr: Seçilmemiş İmleç

# MSG_UNSEL_BG_HELP (39//)
source: For adjusting the background color of an unselected cursor.
tr: Seçilmemiş bir imlecin art alan rengini ayarlamak için kullanılır.

# MSG_INACT_PEN_WIN (40//)
source: Inactive Cursor
tr: Etkin Olmayan İmleç

# MSG_INACT_PEN_HELP (41//)
source: For adjusting the pen color of an inactive cursor.
tr: Etkin olmayan bir imlecin rengini ayarlamak için kullanılır.

# MSG_PBG_INACT (42//)
source: \033cInactive
tr: \033cEtkin olmayan

# MSG_INACT_BG_WIN (43//)
source: Inactive Cursor
tr: Etkin Olmayan İmleç

# MSG_INACT_BG_HELP (44//)
source: For adjusting the background color of an inactive cursor.
tr: Etkin olmayan bir imlecin art alan rengini ayarlamak için kullanılır.

# MSG_MULTISELECT (45//)
source: MultiSelection
tr: Çoklu seçim

# MSG_MULTISELECT_QUAL (46//)
source: via Qualifier
tr: Kısıtlayıcı ile

# MSG_MULTISELECT_ALWAYS (47//)
source: Always
tr: Her zaman

# MSG_MULTISELECT_HELP (48//)
source: Allows to specify the default multiselection mode.
tr: Varsayılan çoklu seçim kipini seçmeyi sağlar.

# MSG_MMB_MULTISEL (49//)
source: MMB multiselection
tr: OFT çoklu seçim

# MSG_MMB_MULTISEL_HELP (50//)
source: Set it if you want to use the middle mouse button (MMB) as a multiselection qualifier.
tr: Çoklu seçim kısıtlayıcısı olarak Orta Fare Tuşu (OFT) kullanmak istiyorsanız etkinleştiriniz.

# MSG_DRAGDROP (51//)
source: Drag&Drop
tr: Sürükle&Bırak

# MSG_DRAGTYPE_IMMEDIATE (52//)
source: Immediate
tr: Anında

# MSG_DRAGTYPE_BORDERS (53//)
source: at Borders
tr: Kenarlarda

# MSG_DRAGTYPE_QUALIFIER (54//)
source: via Qualifier
tr: Kısıtlayıcı ile

# MSG_DRAGTYPE_HELP (55//)
source: Set the drag mode. 'Immediate' will start drag&drop as soon as you drag an object. 'at Borders' for showing a drag operation as soon as you passed the left/right borders and 'via Qualifier' for only allowing to drag&drop via a qualifier key (see 'Keys'). 'Immediate' is used only when in no-multiselect mode.
tr: 'Anında' kipi, sürükle&bırak eylemini, bir nesneyi sürüklediğiniz anda başlatacaktır. 'Kenarlarda' kipi nesneyi liste kenarlıklarından öteye sürüklediğinizde başlatacaktır. 'Kısıtlayıcı ile' kipi ise yalnızca kısıtlayıcı tuş basıldığında başlatacaktır. 'Anında' yalnızca çoklu seçimin etkin olmadığı listelerde kullanılabilir.

# MSG_DRAG_LINES (56//)
source: Visible lines
tr: Görünen satırlar

# MSG_DRAG_LINES_HELP (57//)
source: Give the max. number of lines which will be shown when doing drag&drop. If more lines are selected, you'll get a message similar to: 'Dragging xx Items...'.
tr: Sürükle&bırak eylemi sırasında görüntülenecek satırların azami sayısını giriniz. Eğer bundan daha fazla satır seçili ise 'xx nesne sürükleniyor' şeklinde bir ileti görüntülenecektir.

# MSG_PAGE_FONTS (58//)
source: Fonts
tr: Yazıtipleri

# MSG_PAGE_COLORS (59//)
source: Colors
tr: Renkler

# MSG_PAGE_OPTIONS (60//)
source: Options
tr: Seçenekler

# MSG_PAGE_SCROLLING (61//)
source: Scrolling
tr: Kaydırma

# MSG_PAGE_KEYBINDINGS (62//)
source: Keybindings
tr: Kısayol tuşları

# MSG_SB_HORIZONTAL (63//)
source: Horizontal Scrollbar
tr: Yatay Kaydırma Çubuğu

# MSG_SB_HORIZONTAL_HELP (64//)
source: Set the default mode for the horizontal scrollbar. (may be overwritten by an application)
tr: Yatay kaydırma çubuğu için varsayılan kipi seçiniz. (uygulama tarafından geçersiz kılınabilir)

# MSG_SB_VERTICAL (65//)
source: Vertical Scrollbar
tr: Dikey Kaydırma Çubuğu

# MSG_SB_VERTICAL_HELP (66//)
source: Set the default mode for the vertical scrollbar. (may be overwritten by an application)
tr: Dikey kaydırma çubuğu için varsayılan kipi seçiniz. (uygulama tarafından geçersiz kılınabilir)

# MSG_SCROLLCONTROL (67//)
source: Scrolling Control
tr: Kaydırma Yöntemi

# MSG_SMOOTH_SCROLLING (68//)
source: Smooth Scrolling
tr: Akıcı Kaydırma

# MSG_SMOOTH_SCROLLING_HELP (69//)
source: If enabled, smoothing scrolling will be used for NList objects. In addition, by using the 'smooth' slider in the normal MUI 'Listview' configuration page the speed of the smooth scrolling can be controled.
tr: Etkinleştirildiğinde, NList nesneleri için akıcı kaydırma kullanılacaktır. Akıcı kaydırma hızı, normal MUI 'Listeler' ayarlarındaki sürgü ile ayarlanabilir.

# MSG_MMB_FASTWHEEL (70//)
source: MMB Fast Wheel
tr: OFT Hızlı Kaydırma

# MSG_MMB_FASTWHEEL_HELP (71//)
source: If enabled, the middle mouse button can be used as a qualifier to perform a fast scroll wheel action. (See 'Keybindings' page as well for more wheel qualifiers)
tr: Etkinleştirildiğinde, orta fare tuşu hızlı kaydırma eylemi için bir kısıtlayıcı tuş olarak kullanılabilir. (Diğer kaydırma kısıtlayıcıları için 'Kısayol Tuşları' sayfasına bakınız)

# MSG_WHEEL_STEP (72//)
source: Mouse Wheel Step
tr: Fare Tekerlek Adımı

# MSG_WHEEL_STEP_HELP (73//)
source: Allows to specify the amount of lines that should be scrolled when using a wheel mouse.
tr: Fare tekerleği ile kaydırma yapıldığında her defada kaç satır kaydırılacağını belirler.

# MSG_WHEEL_FAST (74//)
source: Mouse Wheel Fast Step
tr: Fare Hızlı Tekerlek Adımı

# MSG_WHEEL_FAST_HELP (75//)
source: Allows to specify the amount of lines that should be scrolled when using a wheel mouse and when the fast wheel qualifier is pressed.
tr: Hızlı Kaydırma Kısıtlayıcı tuşu ve fare tekerleği ile kaydırma yapıldığında her defada kaç satır kaydırılacağını belirler.

# MSG_LAYOUT (76//)
source: Layout
tr: Dizilim

# MSG_PARTIAL_COL_MARK (77//)
source: Partial column mark
tr: Sığmayan sütun imi

# MSG_PARTIAL_COL_MARK_HELP (78//)
source: If enabled, a special mark will be drawn at the right side of a column in case the text didn't completly fit into it.
tr: Etkinleştirildiğinde, metin sütuna tam olarak sığmadığında sütunun sağ tarafına bir belirteç çizilir.

# MSG_PARTIAL_CHARS_DRAWN (79//)
source: Partial chars drawn
tr: Sığmayan harfleri çizme

# MSG_PARTIAL_CHARS_DRAWN_HELP (80//)
source: If enabled, characters that are not fully visible at the left and right corner of an NList object will not be drawn partially.
tr: Etkinleştirildiğinde, NList nesnesinin sağ ve sol kenarlarına bütün olarak sığmayan harflerin, görünen kısımları da çizilmez.

# MSG_VERT_CENTERED (81//)
source: Vertical centered lines
tr: Dikey ortalanmış satırlar

# MSG_VERT_CENTERED_HELP (82//)
source: If activated, the text lines are centered vertically in a NList object.
tr: Etkinleştirildiğinde, metin satırları NList nesnesi içinde dikey ortalanır.

# MSG_BALANCING_COLS (83//)
source: Balancing Columns
tr: Boyutlandırılabilir Sütunlar

# MSG_BALANCING_COLS_HELP (84//)
source: NList permits to change the column width via mouse dragging the column separator in the title bar. The moved bar can be visible either only in the title, throughout the whole lines or the column width changes can be made visible instantly.
tr: NList, sütun genişliklerini, başlık çubuğundaki sütun ayıraçlarından fare ile çekiştirerek değiştirmeye izin verir. Boyutlandırma sırasında değişiklikler, çubuğun yalnızca başlık kısmına, tüm çizgilere veya listenin bütününe eş zamanlı olarak uygulanabilir.

# MSG_COLWIDTHDRAG_TITLE (85//)
source: Title Bar
tr: Başlık Çubuğu

# MSG_COLWIDTHDRAG_FULLBAR (86//)
source: Full Bar
tr: Tüm Çizgiler

# MSG_COLWIDTHDRAG_VISIBLE (87//)
source: Visible
tr: Tüm Liste

# MSG_COLOR_OPTIONS (88//)
source: Options
tr: Seçenekler

# MSG_FORCE_SELECT_PEN (89//)
source: Force select pen
tr: Seçim rengine zorla

# MSG_FORCE_SELECT_PEN_HELP (90//)
source: If enabled, NList will make sure that the 'Selected', 'Cursor' and 'Unselected' color will be forced.
tr: Etkinleştirildiğinde, NList uygulamayı ayarlanmış 'Seçilmiş', 'İmleç' ve 'Seçilmemiş' renklerine zorlar.

# MSG_MULTISEL_MOVEACTIVE (91//)
source: Keyboard moves cursor
tr: Klavye imleci hareket ettirir

# MSG_MULTISEL_MOVEACTIVE_HELP (92//)
source: If enabled, a keyboard use in an NList object will move the active cursor rather than the unselected one.
tr: Etkinleştirildiğinde, bir NList nesnesinde yapılan klavye hareketleri, seçilmemiş yerine, etkin imleci hareket ettirecektir.

# MSG_GROUP_MISC (93//)
source: Miscellaneous
tr: Çeşitli

# MSG_GROUP_EXAMPLE (94//)
source: Example
tr: Örnek

# MSG_SERMOUSE_FIX (95//)
source: Serial Mouse Fix
tr: Seri Fare Yaması

# MSG_SERMOUSE_FIX_HELP (96//)
source: If enabled, NList tries to fix common drag&drop issues that are related to using a serial mouse.
tr: Etkinleştirildiğinde, NList, seri fare kullanıldığında ortaya çıktığı bilinen sürükle&bırak sorunlarını gidermeye çalışır.

# MSG_SELECT_POINTER (97//)
source: Custom Select Pointer
tr: Özel Seçim İşaretçisi

# MSG_SELECT_POINTER_HELP (98//)
source: If enabled, and an NList object is in charwise selection mode a custom select pointer will be displayed instead of the default workbench mouse pointer image.
tr: Etkinleştirilirse, ve bir NList nesnesi harf seçim kipinde olduğunda, Workbench'in varsayılan fare işaretçisi yerine özel bir seçim işaretçisi görüntülenecektir.

# MSG_BAR_CONTEXTMENU (99//)
source: Context Menu
tr: İçerik Menüsü

# MSG_DEFAULT_CONTEXT_MENU_HELP (100//)
source: NList permits to have its default context menu being disabled or enabled or only in case the mouse is at the top of the NList object.
tr: NList varsayılan içerik menüsünün devre dışı bırakılabilmesini, etkinleştirilebilmesini veya yalnızca fare NList nesnesinin en yukarısında olduğunda etkin olmasını sağlar.

# MSG_SNOOP (101//)
source: Snoop
tr: Algıla

# MSG_SNOOP_KEY (102//)
source: Start the grab of a hotkey.
tr: Kısa yol tuşu algılamayı başlatır.

# MSG_BUTTON_INSERT (103//)
source: Insert
tr: Ekle

# MSG_BUTTON_INSERT_HELP (104//)
source: Allows to insert a new hotkey.
tr: Listeye yeni kısayol tuşu ekler.

# MSG_BUTTON_REMOVE (105//)
source: Remove
tr: Sil

# MSG_BUTTON_REMOVE_HELP (106//)
source: Allows to remove an existing hotkey.
tr: Varolan bir kısayolu kaldırır.

# MSG_BUTTON_UPDATEKEYS (107//)
source: Update keys
tr: Tuşları güncelle

# MSG_BUTTON_UPDATEKEYS_HELP (108//)
source: Add the default hotkeys for the functions which are not currently in the list.
tr: Listede bulunmayan fonksiyonları, varsayılan kısayol tuşları ile ekler.

# MSG_BUTTON_DEFAULTKEYS (109//)
source: Default keys
tr: Varsayılan tuşlar

# MSG_BUTTON_DEFAULTKEYS_HELP (110//)
source: Resets all hotkeys to default ones.
tr: Tüm kısayolları varsayılanlarına döndürür.

# MSG_FUNC_MULTISELQUAL (111//)
source: Multiselect/Block Qualifier
tr: Çoklu/Blok Seçim Kısıtlayıcısı

# MSG_FUNC_DRAGQUAL (112//)
source: Drag&Drop Qualifier
tr: Sürükle&Bırak Kısıtlayıcısı

# MSG_FUNC_BALANCEQUAL (113//)
source: Balance Qualifier
tr: Boyutlandırma Kısıtlayıcısı

# MSG_FUNC_COPYCLIP (114//)
source: Copy to clipboard
tr: Panoya kopyala

# MSG_FUNC_DEFCOLWIDTH (115//)
source: Default width column
tr: Varsayılan sütun genişliği

# MSG_FUNC_DEFALLCOLWIDTH (116//)
source: Default width all columns
tr: Tüm sütunlarda varsayılan genişlik

# MSG_FUNC_DEFORDERCOL (117//)
source: Default order column
tr: Sütunda varsayılan sıralama

# MSG_FUNC_DEFALLORDERCOL (118//)
source: Default order all columns
tr: Tüm sütunlarda varsayılan sıralama

# MSG_FUNC_SELECTTOP (119//)
source: Select to top
tr: En üste kadar seç

# MSG_FUNC_SELECTBOTTOM (120//)
source: Select to bottom
tr: En alta kadar seç

# MSG_FUNC_SELECTPAGEUP (121//)
source: Select to page up
tr: Sayfa başına kadar seç

# MSG_FUNC_SELECTPAGEDOWN (122//)
source: Select to page down
tr: Sayfa sonuna kadar seç

# MSG_FUNC_SELECTUP (123//)
source: Select up
tr: Yukarı seç

# MSG_FUNC_SELECTDOWN (124//)
source: Select down
tr: Aşağı seç

# MSG_FUNC_TOGGLEACTIVE (125//)
source: Toggle active
tr: Etkinleştir

# MSG_FUNC_FASTWHEELQUAL (126//)
source: Fast MouseWheel Qualifier
tr: Hızlı FareTekerleği Kısıtlayıcısı

# MSG_FUNC_HORIZWHEELQUAL (127//)
source: Horiz MouseWheel Qualifier
tr: Yatay FareTekerleği Kısıtlayıcısı

# MSG_FUNC_TITLECLICKQUAL (128//)
source: Title Click Qualifier
tr: Başlık Tıklama Kısıtlayıcısı

# MSG_VSB_ALWAYS (129//)
source: Always
tr: Her zaman

# MSG_VSB_AUTO (130//)
source: Auto
tr: Otomatik

# MSG_VSB_FULLAUTO (131//)
source: FullAuto
tr: TamOtomatik

# MSG_HSB_ALWAYS (132//)
source: Always
tr: Her zaman

# MSG_HSB_AUTO (133//)
source: Auto
tr: Otomatik

# MSG_HSB_FULLAUTO (134//)
source: FullAuto
tr: TamOtomatik

# MSG_HSB_NONE (135//)
source: None
tr: Yok

# MSG_CMENU_ALWAYS (136//)
source: Always
tr: Her zaman

# MSG_CMENU_TOPONLY (137//)
source: TopOnly
tr: Yalnızca En Yukarıda

# MSG_CMENU_NEVER (138//)
source: Never
tr: Hiçbir zaman

# MSG_HOTKEYS_KEY (139//)
source: Key
tr: Tuş

# MSG_HOTKEYS_ACTION (140//)
source: Action
tr: Eylem

# MSG_EXAMPLE_TEXT (141//)
source: If you have problems, try to increase the stack value, in the icon infos if you launch the program from icon, stack of CLI if you start it from CLI/Shell, and if you launch it from some utility read its docs to see how to increase it. A stack of 12Kb, 16Kb or 20Kb is most of time a good idea. If you still have problems, try to see if they happen with the Demo prog, then tell me. \033C Latest public release can be found on aminet (dev/mui). All releases are available on http://www.sourceforge.net/projects/nlist-classes/ \033C \033r\0333(C) 2001-2013 by NList Open Source Team \033r\0333(C) 1996-1998 by Gilles Masson \033r\0333http://www.sourceforge.net/projects/nlist-classes/ \033C \033cThis new list/listview custom class \033chandles its own configurable backgrounds, \033cpens, fonts, scrollbars, keys and qualifiers \033C \033cThe way used to handle cursor with multiselection \033cis not exactly as the listview one ! \033cDrag&Drop is supported, both scrollbars \033ccan be configured to disappear automatically \033cwhen not needed because all is visible. \033cJust try it... \033C \033cYou can horizontaly scroll with cursor keys, \033cor going on the right and left of the list \033cwhile selecting with the mouse. \033cTry just clicking on the left/right borders ! \033C \033cYou can change columns widths just dragging \033cthe vertical separator between columns titles \033c(try it using the balancing qualifier too). \033C \033cYou can change columns order just dragging \033cthe column titles. \033C \033cThere is builtin copy to clipboard stuff \033cand classic char selection capability. \033C \033cTry the Demo program to test all that... \033r\033bGive some feedback about it ! :-) \033C **************************************************************************************************
tr: Eğer sorunlarla karşılaşırsanız, simge bilgisinden yığın boyutunu arttırmayı deneyin. Eğer programı komut satırından çağırıyorsanız CLI yığın değerini arttırın. Eğer başka bir uygulama ile çağırıyorsanız, yığın boyutunu arttırmak için uygulamanın dökümanlarına başvurun. 12Kb, 16Kb veya 20Kb'lık yığınlar çoğu zaman işe yarar. Hala sorunlar yaşıyorsanız, bu sorunların Demo uygulamasında da ortaya çıkıp çıkmadığını deneyin ve sonucu bana bildirin. \033C En güncel halka açık sürüm Aminet (dev/mui)'den temin edilebilir. Tüm sürümler için: http://www.sourceforge.net/projects/nlist-classes/ \033C \033r\0333(C) 2001-2010 NList Açık Kaynak Takımı \033r\0333(C) 1996-1998 Gilles Masson \033r\0333http://www.sourceforge.net/projects/nlist-classes/ \033C \033cBu yeni liste/liste görünümü özel sınıfı \033ckendi ayarlanabilir art alan, renk, yazıtipi, \033ckaydırma çubukları, kısayol ve kısıtlayıcı \033ctuşlarına sahiptir. \033C \033cİmleç ile çoklu seçim için kullanılan yöntem, \033clistegörünümü şeklinde olanla tamamen aynı değildir! \033cSürükle&Bırak desteklenmekte ve her iki kaydırma \033cçubuğu da gerekli olmadıklarında otomatik olarak \033ckaybolacak şekilde ayarlanabilmektedir. \033cLütfen deneyin... \033C \033cFare ile seçim yaparken, yön tuşları ile yatay kaydırma \033cyapabilir ya da listede sağa/sola hareket edebilirsiniz. \033cSağ/Sol kenarlıklara tıklamayı deneyiniz! \033C \033cSütün başlıkları arasındaki dikey ayıraçları çekiştirerek \033csütun genişliklerini değiştirebilirsiniz \033c(boyutlandırma kısıtlayıcısını da deneyiniz). \033C \033cSütun başlıklarını sürükleyerek sütun \033csıralamalarını da değiştirebilirsiniz. \033C \033cPanoya kopyalama ve klasik harf harf seçim \033cyapabilme özellikleri dahili olarak desteklenir. \033C \033cTümünü sınamak için Demo uygulamasını deneyin... \033r\033bYorumlarınızı bekliyorum! :-) \033C **************************************************************************************************
