Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/texteditor/mcp/locale/*.po
Languages: french, german, italian

# MSG_HelpBubble_BlockQual (0//)
source: Move the cursor key and hold down the qualifier that you set here to mark text.
french: Déplacer le curseur en maintenant appuyée la touche définie ici vous permet de marquer le texte.
german: Wird diese Taste beim Bewegen des Cursors gedrückt, so wird der Text markiert.
italian: Muovi il tasto cursore tenendo premuto un tasto qualificatore in modo da selezionare il testo.

# MSG_HelpBubble_CheckWord (1//)
source: If enabled, then the editor will lookup the word, and only show suggestions if the word is misspelled.
french: Cette option active, l'éditeur cherchera le mot et affichera des suggestions s'il est mal orthographié.
german: Es wird nur dann ein Wort vorgeschlagen, falls es falsch geschrieben ist.
italian: Se selezionato l'editor di testo andrà alla ricerca della parola corretta e in caso di errore mostrerà un comodo suggerimento in tempo reale.

# MSG_HelpBubble_Smooth (2//)
source: This enables pixel smooth scrolling.
french: Activer le défilement fluide du texte.
german: Pixelgenaues Scrolling ermöglichen.
italian: Attiva lo scorrimento smooth del pixel.

# MSG_HelpBubble_TypeNSpell (3//)
source: Enable this to let the editor lookup the words while you type them.
french: Activer la recherche des mots en cours de frappe.
german: Die Wörter werden bereits während des Schreibens geprüft.
italian: Attiva questa opzione in modo da parmettere la ricerca automatica delle parole mentre stai scrivendo.

# MSG_HelpBubble_UndoLevel (4//)
source: Each undo level eats up 10 bytes of memory. Cut and copy will take a little more, depending on the size of the block you are cutting or copying.
french: Chaque option « annuler » utilise 10 octets de mémoire. Les options « couper » et « copier » prennent un peu plus, selon la taille du bloc !
german: Jeder Rückschritt benötigt 10 Byte Speicher. Ausschneiden und Kopieren benötigen etwas mehr, je nach Größe des Blockes.
italian: Ogni livello di ripristino utilizza almeno 10 byte di memoria mentre le funzionalità di taglia e copia possono richiederne di più, questo ovviamente in base alle dimensioni reali del blocco di testo che si desidera tagliare o copiare.

# MSG_Button_DefaultKeys (5//)
source: Default _keys
french: _Touches par défaut
german: Standardtasten
italian: _Tasti predefiniti

# MSG_Button_Delete (6//)
source: _Delete
french: _Effacer
german: _Löschen
italian: _Cancella

# MSG_Button_Insert (7//)
source: _Insert
french: _Insérer
german: _Einfügen
italian: _Inserisci

# MSG_ConfigMenu_CheckWord (8//)
source: Check word
french: Vérifier le mot
german: Wort prüfen
italian: Verifica parola

# MSG_ConfigMenu_TypeNSpell (9//)
source: Type'n'spell
french: Orthographe temps réel
german: Beim Schreiben prüfen
italian: Correttore automatico

# MSG_CycleItem_Ctrl (11//)
source: Control
french: Contrôle

# MSG_CycleItem_Mouse (12//)
source: (mouse only)
french: (souris uniquement)
german: (nur Maus)
italian: (solo mouse)

# MSG_Function_BOL (16//)
source: Beginning of line
french: Début de ligne
german: Zeilenanfang
italian: Inizio della linea

# MSG_Function_Backspace (17//)
source: Backspace
french: Retour arrière

# MSG_Function_Bottom (18//)
source: Bottom
french: Fin du texte
german: Letzte Zeile
italian: Fine

# MSG_Function_Copy (19//)
source: Copy
french: Copier
german: Kopieren
italian: Copia

# MSG_Function_Cut (20//)
source: Cut
french: Couper
german: Ausschneiden
italian: Taglia

# MSG_Function_DelBOL (21//)
source: Delete to BOL
french: Effacer jusqu'au début de la ligne
german: Löschen bis Zeilenanfang
italian: Cancella su BOL

# MSG_Function_DelBOW (22//)
source: Delete to BOW
french: Effacer jusqu'au début du mot
german: Löschen bis Wortanfang
italian: Cancella su BOW

# MSG_Function_DelEOL (23//)
source: Delete to EOL
french: Effacer jusqu'à la fin de la ligne
german: Löschen bis Zeilenende
italian: Cancella su EOL

# MSG_Function_DelEOW (24//)
source: Delete to EOW
french: Effacer jusqu'à la fin du mot
german: Löschen bis Wortende
italian: Cancella su EOW

# MSG_Function_Delete (25//)
source: Delete
french: Effacer
german: Löschen
italian: Cancella

# MSG_Function_Down (26//)
source: Down
french: Bas
german: Cursor runter
italian: Giù

# MSG_Function_EOL (27//)
source: End of line
french: Fin de ligne
german: Zeilenende
italian: Fine della linea

# MSG_Function_Left (28//)
source: Left
french: Gauche
german: Cursor Links
italian: Sinistra

# MSG_Function_NextGadget (29//)
source: Next gadget
french: Gadget suivant
german: Nächstes Gadget
italian: Gadget successivo

# MSG_Function_NxtPage (30//)
source: Next page
french: Page suivante
german: Nächste Seite
italian: Pagina successiva

# MSG_Function_NxtPara (31//)
source: Next paragraph
french: Paragraphe suivant
german: Nächster Absatz
italian: Paragrafo successivo

# MSG_Function_NxtSent (32//)
source: Next sentence
french: Phrase suivante
german: Nächster Satz
italian: Prossima frase

# MSG_Function_NxtWord (33//)
source: Next word
french: Mot suivant
german: Nächstes Wort
italian: Parola successiva

# MSG_Function_Paste (34//)
source: Paste
french: Coller
german: Einfügen
italian: Incolla

# MSG_Function_PrvPage (35//)
source: Prev page
french: Page précédente
german: Vorherige Seite
italian: Pagina precedente

# MSG_Function_PrvPara (36//)
source: Prev paragraph
french: Paragraphe précédent
german: Vorheriger Absatz
italian: Paragrafo precedente

# MSG_Function_PrvSent (37//)
source: Prev sentence
french: Phrase précédente
german: Vorheriger Satz
italian: Frase precedente

# MSG_Function_PrvWord (38//)
source: Prev word
french: Mot précédent
german: Vorheriges Wort
italian: Parola precedente

# MSG_Function_Redo (39//)
source: Redo
french: Rétablir
german: Wiederholen
italian: Annulla

# MSG_Function_Return (40//)
source: Return
french: Retour chariot
italian: Invio

# MSG_Function_Right (41//)
source: Right
french: Droite
german: Cursor rechts
italian: Destra

# MSG_Function_SuggestSpelling (42//)
source: Suggest spelling
french: Suggérer une orthographe
german: Schreibweise vorschlagen
italian: Suggerisci ortografia

# MSG_Function_Tab (43//)
source: Tab
french: Tabulation

# MSG_Function_Top (44//)
source: Top
french: Début du texte
german: Erste Zeile
italian: Inizio

# MSG_Function_Undo (45//)
source: Undo
french: Annuler
german: Rückgängig
italian: Ripristina

# MSG_Function_Up (46//)
source: Up
french: Haut
german: Cursor hoch
italian: Su

# MSG_GroupTitle_Control (47//)
source: Control
french: Contrôle
german: Steuerung
italian: Controlli

# MSG_GroupTitle_Cursor (48//)
source: Cursor
french: Curseur
italian: Cursore

# MSG_GroupTitle_Design (49//)
source: Design
french: Apparence
italian: Stile

# MSG_GroupTitle_Fonts (50//)
source: Fonts
french: Polices
german: Schriftarten
italian: Font

# MSG_GroupTitle_Separator (51//)
source: Separator
french: Séparateur
german: Trennlinie
italian: Separatore

# MSG_HelpTxt_SpellChecker (52//)
source: \33u Intro \33n The TextEditor gadget allows for easy integration of external spell checkers, making it possible to have both type'n'spell and also normal word guessing. \33u Lookup command \33n For the type'n'spell you'll have to set the lookup command to a script that will lookup the word and set the environment variable "Found" to either 0 (for not found) or 1 (for a match). This matches the default behaviour of AlphaSpell. You write %s where you want the word. If you use AlphaSpell, then you can use: \33bARexx:\33n "Options Results;Address ALPHASPELL Search For '%s' Path 'T:' Danish.ald" You \33bmust\33n remember the quotes, this will let ARexx execute it as a command instead of a script. \33u Suggest command \33n If you press <HELP> over a word, then the editor will launch this command, again with %s substituted with the current word. Your script should produce a file in T: named "Matches". This file is then read by the gadget, and the contents are listed in a popup listview, from where you can choose a word which will replace the misspelled one. Again, AlphaSpell users can use: \33bARexx:\33n "Options Results;Address ALPHASPELL Match '%s' To 'T:Matches' Path 'T:' Danish.ald" If you use the methods described above, then you must start AlphaSpell with the "ARexx" switch. It is advised to keep your dictionary in RAM if you enable the type'n'spell feature.
french: \33u Introduction \33n La classe TextEditor permet l'intégration d'un correcteur orthographique externe, qui permet de corriger votre texte lors de la frappe ou en mode suggestion. \33uCommande pour vérification \33n Pour utiliser la correction automatique, vous devez inscrire dans le champ : Commande pour vérification, le nom d'un script qui sera en mesure de vérifier un mot et d'inscrire dans la variable d'environnement "Found", soit la valeur 0 (lorsque le mot est inconnu) ou la valeur 1 (lorsque mot a été trouvé). Ce schéma a été retenu car c'est le comportement par défaut du logiciel AlphaSpell. Vous inscrivez %s là ou vous souhaitez insérer le mot. Les utilisateurs d'AlphaSpell doivent inscrire ici: \33bARexx :\33n "Options Results;Address ALPHASPELL Search For '%s' Path 'T:' French.ald" Vous \33bdevez\33n ajouter les guillemets, qui permettent à ARexx d'exécuter le champ entier comme une commande plutôt qu'un script. \33u Commande pour suggestion \33n Si vous pressez la touche Help sur un mot, l'éditeur démarre cette commande, avec %s substitué au mot sous le curseur. Ce script doit produire un fichier dans T: nommé "Matches". Ce fichier est alors lu par le gadget, et son contenu sera affiché dans une liste contextuelle, à partir de laquelle vous pourrez choisir un mot qui remplacera le mot mal orthographié. Les utilisateurs d'AlphaSpell doivent inscrire ici: \33bARexx :\33n "Options Results;Address ALPHASPELL Match '%s' To 'T:Matches' Path 'T:' French.ald" Si vous utilisez les méthodes décrites ci-dessus, vous devez démarrer AlphaSpell avec le paramètre "ARexx". Il est aussi préférable de conserver votre dictionnaire en mémoire si vous souhaitez activer l'option de correction automatique.
german: \33u Einführung \33n Das TextEditor Gadget ermöglicht das einfache Einbinden von externen Programmen zur Rechtschreibprüfung bzw als Wörterbuch. \33u Rechtschreibprüfung \33n Für die Prüfung muss die Suchfunktion die Umgebungsvariable "Found" auf entweder 0 (nicht gefunden) oder 1 (gefunden) setzen. Ich habe diesen Weg gewählt, weil er dem von AlphaSpell entspricht. Ein %s wird durch das zu suchende Wort ersetzt. Für AlphaSpell kann man folgendes benutzen: \33bARexx:\33n "Options Results;Address ALPHASPELL Search For '%s' Path 'T:' German.ald" Wichtig sind die Anführungszeichen, damit ARexx den Text als Befehl ausführt und nicht als Skript. \33u Vorschlagen \33n Wird HELP über einem Wort gedrückt, startet der Editor diesen Befehl, wobei wiederum %s durch das Wort ersetzt wird. Die Funktion sollte eine Datei in T: namens "Matches" erzeugen. Der Inhalt dieser Datei wird dann vom Editor gelesen und in einer Liste angezeigt. Das Wort, das dann ausgewählt wird, ersetzt das alte. Für AlphaSpell: \33bARexx:\33n "Options Results;Address ALPHASPELL Match '%s' To 'T:Matches' Path 'T:' German.ald" Wird AlphaSpell auf die oben beschrieben Art und Weise benutzt, muss "ARexx" ausgewählt sein. Es wird empfohlen das Wörterbuch im Speicher zu halten!
italian: \33u Introduzione \33n Il gadget TextEditor permette la facile intregrazione di un spell checkers rendendo possibile sia l'utilizzo del classico correttore ortografico che dei comodi suggerimenti automatici durante la digitazione. \33u Comandi di ricerca \33n Per quanto riguarda il correttore ortografico è necessario impostare il comando con uno script che vada poi a ricercare la parola esatta impostandola all'interno di una variabile d'ambiente di tipo "Found" o "0" nel caso questa non fosse trovata, oppure "1" nel caso la corrispondenza della parola vada a buon fine. Questo sistema ad esempio corrisponde al funzionamento di AlphaSpell dove potresti scrivere '%s' dove desideri inserire una parola, ad esempio sempre utilizzando AlphaSpell potresti usare: \33bARexx:\33n "Options Results;Address ALPHASPELL Search For '%s' Path 'T:' Danish.ald" Ricorda, è \33bassolutamente necessario\33n ricordarsi le virgolette in modo che ARexx lo possa eseguire come fosse comando anzichè uno script. \33u Suggerimento sui comandi \33n Premendo il tasto <HELP> (nel momento in cui il cursore è sopra una parola) l'editor di testo avvierà il comando %s sostituendolo con la parola ad esso attribuita. Lo script potrebbe creare un file in T: chiamato ad esempio "Matches", questo poi verrà letto dal gadget ed il contenuto verrà listato in un apposito gadget popup dove sarà poi eventualmente possibile scegliere qualsiasi altra parola in sostituzione a quelle attuali. Ancora, gli utenti di AlphaSpell possono usare anche: \33bARexx:\33n "Options Results;Address ALPHASPELL Match '%s' To 'T:Matches' Path 'T:' Italian.ald" Se stai usando i metodi descritti sopra allora è necessario avviare AlphaSpell con lo switch "ARexx". Infine è consigliato mantenere il proprio dizionario in RAM: durante l'attivazione del correttore ortografico.

# MSG_LVLabel_Key (54//)
source: \33c\0333Key:
french: \33c\0333Touche :
german: \33c\0333Hotkey:
italian: \33c\0333Tasto:

# MSG_Label_Background (55//)
source: Background
french: Arrière-plan
german: Hintergrund
italian: Sfondo

# MSG_Label_BlinkSpeed (56//)
source: Blinkspeed
french: Vitesse de clignotement
german: Blinktakt
italian: Lampeggio

# MSG_Label_BlkQual (57//)
source: Block qualifier
french: Touche de sélection
german: Blocktaste
italian: Qualificatore blocco

# MSG_Label_Cursor (58//)
source: Normal
french: Curseur
german: Cursor
italian: Normale

# MSG_Label_Fixed (59//)
source: Fixed
french: Fixe
german: Fest
italian: Fisso

# MSG_Label_Frame (60//)
source: Frame
french: Cadre
german: Rahmen
italian: Contorno

# MSG_Label_Highlight (61//)
source: Highlight
french: Surlignage
german: Hervorgehoben

# MSG_Label_LookupCmd (62//)
source: Lookup command
french: Commande de vérification
german: Prüf-Kommando
italian: Comando Lookup

# MSG_Label_LookupWords (63//)
source: Lookup word before suggesting?
french: Vérification du mot avant de suggérer ?
german: Worte vor dem Vorschlagen prüfen?
italian: Cerca la parola prima di suggerirla

# MSG_Label_Selected (65//)
source: Selected
french: Sélectionné
german: Ausgewählt
italian: Selezionato

# MSG_Label_SeparatorShadow (66//)
source: Shadow
french: Ombre
german: Dunkle Kante
italian: Ombra

# MSG_Label_SeparatorShine (67//)
source: Shine
french: Brillant
german: Helle Kante

# MSG_Label_Smooth (68//)
source: Smooth
french: Défilement fluide
german: Weiches Rollen

# MSG_Label_SpellNType (69//)
source: Spell check as you type?
french: Vérification de l'orthographe lors de la frappe ?
german: Beim Schreiben prüfen?
italian: Verifica ortografia in tempo reale

# MSG_Label_SuggestCmd (70//)
source: Suggest command
french: Commande pour suggestion
german: Vorschlag-Kommando
italian: Suggerisci comando

# MSG_Label_TabSize (71//)
source: Tab size
french: Taille tabulation
german: Tab-Schritte
italian: Dimensione Tab

# MSG_Label_Text (72//)
source: Text
french: Texte
italian: Testo

# MSG_Label_UndoLevel (73//)
source: Undo levels
french: Niveaux d'annulation
german: Anzahl Rückschritte
italian: Livelli di ripristino

# MSG_Label_Width (74//)
source: Width
french: Largeur
german: Breite
italian: Larghezza

# MSG_MenuItem_Background (75//)
source: Background
french: Arrière-plan
german: Hintergrund
italian: Sfondo

# MSG_MenuItem_Bold (76//)
source: Bold
french: Gras
german: Fett
italian: Grassetto

# MSG_MenuItem_Center (77//)
source: Center
french: Centré
german: Zentriert
italian: Centrato

# MSG_MenuItem_Copy (78//)
source: Copy
french: Copie
german: Kopieren
italian: Copia

# MSG_MenuItem_Cut (79//)
source: Cut
french: Couper
german: Ausschneiden
italian: Taglia

# MSG_MenuItem_Delete (80//)
source: Delete
french: Effacer
german: Löschen
italian: Cancella

# MSG_MenuItem_Fill (81//)
source: Fill
french: Remplissage
german: Füllen
italian: Riempi

# MSG_MenuItem_Halfshadow (82//)
source: Halfshadow
french: Semi-ombrée
german: Halbdunkel

# MSG_MenuItem_Halfshine (83//)
source: Halfshine
french: Semi-brillant
german: Halbhervorgehoben

# MSG_MenuItem_Italic (84//)
source: Italic
french: Italique
german: Kursiv
italian: Corsivo

# MSG_MenuItem_Left (85//)
source: Left
french: Gauche
german: Linksbündig
italian: Sinistra

# MSG_MenuItem_Mark (86//)
source: Mark
french: Sélection
german: Markieren
italian: Selezione

# MSG_MenuItem_Paste (88//)
source: Paste
french: Coller
german: Einfügen
italian: Incolla

# MSG_MenuItem_Redo (89//)
source: Redo
french: Rétablir
german: Wiederherstellen
italian: Annulla

# MSG_MenuItem_Right (90//)
source: Right
french: Droite
german: Rechtsbündig
italian: Destra

# MSG_MenuItem_Shadow (91//)
source: Shadow
french: Ombrée
german: Dunkel
italian: Ombra

# MSG_MenuItem_Shine (92//)
source: Shine
french: Brillante
german: Hervorgehoben

# MSG_MenuItem_Text (93//)
source: Text
french: Texte
german: Textfarbe
italian: Testo

# MSG_MenuItem_Underline (94//)
source: Underline
french: Souligné
german: Unterstrichen
italian: Sottolineato

# MSG_MenuItem_Undo (95//)
source: Undo
french: Annuler
german: Rückgängig
italian: Ripristina

# MSG_MenuSubTitle_Alignment (96//)
source: Alignment
french: Justification
german: Ausrichtung
italian: Allineamento

# MSG_MenuSubTitle_Color (97//)
source: Color
french: Couleur
german: Farbe
italian: Colore

# MSG_MenuTitle_Edit (98//)
source: Edit
french: Éditer
german: Ändern
italian: Modifica

# MSG_Page_Keybindings (99//)
source: Keybindings
french: Touches
german: Tastenbelegung
italian: Scorciatoie

# MSG_Page_Sample (100//)
source: Sample
french: Exemple
german: Beispiel
italian: Esempio

# MSG_Page_Settings (101//)
source: Settings
french: Réglages
german: Einstellungen
italian: Impostazioni

# MSG_Page_SpellChecker (102//)
source: Spell checker
french: Correcteur
german: Rechtschreibprüfung
italian: Correttore ortografico

# MSG_PopWinTitle_Background (103//)
source: Select background
french: Choisir arrière-plan
german: Hintergrund auswählen
italian: Seleziona sfondo

# MSG_PopWinTitle_Cursor (104//)
source: Select cursor color
french: Choisir la couleur du curseur
german: Cursorfarbe auswählen
italian: Seleziona colore del cursore

# MSG_PopWinTitle_Frame (105//)
source: Adjust frame
french: Choisir un cadre
german: Rahmen auswählen
italian: Modifica contorno

# MSG_PopWinTitle_Highlight (106//)
source: Select highlight color
french: Choisir la couleur de surlignage
german: Hervorgehobene Farbe auswählen
italian: Seleziona colore highlight

# MSG_PopWinTitle_Selected (107//)
source: Select block color
french: Choisir la couleur de sélection
german: Blockfarbe auswählen
italian: Seleziona blocco di colore

# MSG_PopWinTitle_SeparatorShadow (108//)
source: Select separators shadow color
french: Choisir la couleur d'ombre pour le séparateur
german: Farbe der dunklen Kanten auswählen
italian: Seleziona separatori ombra dei colori

# MSG_PopWinTitle_SeparatorShine (109//)
source: Select separators shine color
french: Choisir la couleur brillante pour le séparateur
german: Farbe der hellen Kanten auswählen
italian: Seleziona separatori del colore shine

# MSG_PopWinTitle_Text (110//)
source: Select text color
french: Choisir la couleur du texte
german: Textfarbe auswählen
italian: Seleziona colore del testo

# MSG_SliderText_MaxWidth (111//)
source: Same as char
french: Même que caractère
german: wie Zeichen
italian: Come per i caratteri

# MSG_SliderText_MinSpeed (112//)
source: Off
french: Aucun
german: aus
italian: Disattivo

# MSG_SliderText_TabSize (116//)
source: %ld spaces
french: %ld espaces
german: %ld Leerzeichen
italian: %ld spazi

# MSG_Function_GotoBookmark1 (117//)
source: Goto bookmark 1
french: Aller au signet 1
german: Gehe zu Markierung 1
italian: Vai al segnalibro 1

# MSG_Function_GotoBookmark2 (118//)
source: Goto bookmark 2
french: Aller au signet 2
german: Gehe zu Markierung 2
italian: Vai al segnalibro 2

# MSG_Function_GotoBookmark3 (119//)
source: Goto bookmark 3
french: Aller au signet 3
german: Gehe zu Markierung 3
italian: Vai al segnalibro 3

# MSG_Function_SetBookmark1 (120//)
source: Set bookmark 1
french: Marquer le signet 1
german: Setze Markierung 1
italian: Imposta segnalibro 1

# MSG_Function_SetBookmark2 (121//)
source: Set bookmark 2
french: Marquer le signet 2
german: Setze Markierung 2
italian: Imposta segnalibro 2

# MSG_Function_SetBookmark3 (122//)
source: Set bookmark 3
french: Marquer le signet 3
german: Setze Markierung 3
italian: Imposta segnalibro 3

# MSG_Button_Snoop (123//)
source: Snoop
french: Apprendre

# MSG_Function_DelLine (124//)
source: Delete line
french: Effacer la ligne
german: Zeile löschen
italian: Cancella linea

# MSG_Function_SelectAll (125//)
source: Select all
french: Tout sélectionner
german: Alles markieren
italian: Seleziona tutto

# MSG_Function_SelectNone (126//)
source: Select none
french: Tout déselectionner
german: Nichts markieren
italian: Annulla selezione

# MSG_WarnConfigVersion_Title (127//)
source: TextEditor.mcp warning
french: Avertissement TextEditor.mcp
german: TextEditor.mcp Warnung
italian: Avviso di TextEditor.mcp

# MSG_WarnConfigVersion (128//)
source: Your currently saved keybindings setup is incompatible with the version of TextEditor.mcc you have installed. It is suggested that you reset the current keybindings to their defaults and edit them manually afterwards.
french: Votre configuration de touches actuelle est incompatible avec la version de TextEditor.mcc que vous possédez. Il est recommandé de réinitialiser cette configuration de touches à leur valeurs initiales et de les éditer manuellement ultérieurement.
german: Ihre aktuelle gespeicherte Tastenbelegung ist inkompatibel mit der installierten Version von TextEditor.mcc. Es wird empfohlen die aktuelle Tastenbelegung auf Standard- werte zurückzusetzen und sie anschließend von Hand zu ändern.
italian: Le attuali scorciatoie da tastiera salvate sono incompatibili con la versione di TextEditor.mcc attualmente installata. Si consiglia di ritornare alle impostazioni predefinite editandole poi manualmente.

# MSG_ResetAbort (129//)
source: Reset|Abort
french: Réinitialiser|Annuler
german: Zurücksetzen|Abbruch
italian: Resetta|Annulla

# MSG_WarnHotkeyString_Title (130//)
source: TextEditor.mcp warning
french: Avertissement TextEditor.mcp
german: TextEditor.mcp Warnung
italian: Avviso di TextEditor.mcp

# MSG_WarnHotkeyString (131//)
source: TextEditor.mcp couldn't open the minimum required version of the HotkeyString.mcc custom class and therefore failed during initialization. Please make sure you have the latest Hotkeystring.mcc class from http://www.sf.net/projects/bstring-mcc/ installed and try again.
french: TextEditor.mcpo ne peut pas ouvrir la version minimale requise de la classe MUI HotkeyString.mcc et n'a donc pas pu se lancer. Veuillez vous assurer que vous disposez bien de la dernière version de la classe Hotkeystring.mcc disponible depuis le site http://www.sf.net/projects/bstring-mcc/.
german: TextEditor.mcp konnte the mindestens benötigte Version der Klasse HotkeyString.mcc nicht öffnen! Dadurch konnte TextEditor.mcp nicht initialisiert werden! Bitte stellen Sie sicher, dass Sie die neueste Version von HotkeyString.mcc von http://www.sf.net/projects/bstring-mcc/ installiert haben.
italian: TextEditor.mcp non è stato in grado di aprire la versione minima richiesta di HotkeyString.mcc Per favore assicurati di aver installato l'ultima versione di HotkeyString.mcc da http://www.sf.net/projects/bstring-mcc/

# MSG_Label_InactiveCursor (133//)
source: Inactive cursor
french: Curseur inactif
german: Inaktiver Cursor
italian: Disattiva cursore
