Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/texteditor/mcp/locale/*.po
Languages: french, german, italian

# MSG_HELP_InactiveCursor (134//)
source: If enabled, a custom cursor will be used whenever the editor doesn't have the focus.
french: Si activé, un curseur personalisé sera utilisé lorsque l'éditeur n'aura pas le focus.
german: Wenn ausgewählt wird ein spezieller inaktiver Cursor dargestellt falls der gesamte TextEditor inaktiv wird.
italian: Se attivato verrà usato un cursore personalizzato qualora l'editor non avesse il focus.

# MSG_Label_SelectPointer (135//)
source: Selection pointer
french: Pointer de sélection
german: Auswahl-Mauszeiger
italian: Seleziona puntatore

# MSG_HELP_SelectPointer (136//)
source: If enabled, a custom selection pointer will appear when the mouse pointer is above the texteditor gadget.
french: Si activé, un pointer de sélection personalisé apparaîtra lorsque la souris sera au-dessus d'un objet TextEditor.
german: Wenn ausgewählt wird ein spezieller Mauszeiger dargestellt der das selektieren von Zeichen vereinfachen soll.
italian: Se attivato verrà mostrato un puntatore di selezione personalizzato qualora il puntatore del mouse sia al di sopra di un gadget texteditor.

# MSG_Label_InactiveColor (137//)
source: Inactive
french: Inactif
german: Inaktiv
italian: Disattivo

# MSG_PopWinTitle_InactiveColor (138//)
source: Select inactive color
french: Choisir la couleur lorsque l'objet est inactif
german: Inaktiv-Farbe auswählen
italian: Seleziona colore disattivo

# MSG_HELP_TABSIZE (139//)
source: How many spaces hitting the <TAB> key will jump.
french: Espaces insérés lors de l'utilisation de la touche <TAB>.
german: Anzahl Leerzeichen, die beim Drücken von <TAB> eingefügt werden.
italian: Quanti spazi utilizzare alla pressione del tasto <TAB>

# MSG_HELP_DESIGN_FRAME (140//)
source: This is a button to adjust a frame. Click it to open an adjust window or use the drag&drop facilities to copy from or to another frame adjust button.
french: Bouton servant à ajuster un cadre. Cliquez dessus pour ouvrir une fenêtre d'ajustement ou utilisez les fonctions de glisser-déposer pour copier d'un bouton à l'autre.
german: Mit diesem Schalter wird der Rahmen eingestellt. Durch einen Klick kann das Einstellungsfenster geöffnet werden, oder benutzen Sie Drag'n'Drop, um die Einstellungen von oder zu einem anderen Rahmen zu kopieren.
italian: Questo pulsante regola i vari contorni. Fai click su di esso per aprire le impostazioni o usa il drag&drop in modo da copiare da o verso un altro pulsante di gestione contorni.

# MSG_HELP_DESIGN_BACKGROUND (141//)
source: This is a button to adjust a background color or pattern. Click it to open an adjust window or use the drag&drop facilities to copy from or to another background adjust button.
french: Bouton servant à ajuster la couleur ou la trame d'un arrière plan. Cliquez dessus pour ouvrir une fenêtre d'ajustement ou utilisez les fonctions de glisser-déposer pour copier d'un bouton à l'autre.
german: Mit diesem Schalter wird die Hintergrundfarbe eingestellt. Durch einen Klick kann das Einstellungsfenster geöffnet werden, oder benutzen Sie Drag'n'Drop, um die Einstellungen von oder zu einem anderen Hintergrund zu kopieren.
italian: Questo pulsante regola e modifica lo sfondo, un colore oppure un motivo, fai click su di esso per aprire le impostazioni o usa il drag&drop in modo da copiare da o verso un altro pulsante di sfondo.

# MSG_HELP_DESIGN_TEXT (142//)
source: This is the color used to print the text.
french: Couleur utilisée pour afficher le texte.
german: Dies ist die Farbe, die für normalen Text verwendet wird.
italian: Questo è il colore usato per il testo.

# MSG_HELP_DESIGN_HIGHLIGHT (143//)
source: This is the color used to print highlighted text.
french: Couleur utilisée pour afficher le texte sélectionné.
german: Dies ist die Farbe, die für hervorgehobenen Text verwendet wird.
italian: Questo è il colore usato per visualizzare il testo illuminato.

# MSG_HELP_SEPARATOR_SHINE (144//)
source: This is the color used to print separator bars.
french: Couleur utilisée pour afficher les barres de séparations.
german: Dies ist die Farbe, die für die Trennlinie verwendet wird.
italian: Questo è il colore usato per visualizzare le barre separatrici.

# MSG_HELP_SEPARATOR_SHADOW (145//)
source: This is the color used to print separator bars in shadow mode.
french: Couleur utilisée pour afficher les barres de séparations ombrées.
german: Dies ist die Farbe, die für den Schatten der Trennlinie verwendet wird.
italian: Questo è il colore usato per visualizzare le barre separatrici in modalità ombra.

# MSG_HELP_FONTS_NORMAL (146//)
source: Default font to be used by the editor.
french: Police de caractère utilisée par l'éditeur.
german: Die Standardschriftart für den Editor.
italian: Font predefinito da usare nell'editor.

# MSG_HELP_FONTS_FIXED (147//)
source: Default font to be used by the editor whenever a fixed width font is requested.
french: Police de caractère utilisée par l'éditeur lorsqu'une police de caractères fixes est nécessaire.
german: Die Standardschriftart für den Editor, falls eine Schriftart mit fester Breite benötigt wird.
italian: Font predefinito da utilizzare nell'editor qualora venga richiesto un carattere a larghezza fissa.

# MSG_HELP_CURSOR_NORMAL (148//)
source: Default color to be used for the cursor.
french: Couleur utilisée pour afficher le curseur.
german: Dies ist die Farbe, die für den Cursor verwendet wird.
italian: Colore predefinito usato per il cursore.

# MSG_HELP_CURSOR_SELECTED (149//)
source: Color to be used for the cursor in selected text.
french: Couleur utilisée pour afficher le curseur dans un texte sélectionné.
german: Dies ist die Farbe, die für markierten Text verwendet wird.
italian: Colore da usare per il cursore in modalità selezione testo.

# MSG_HELP_CURSOR_INACTIVE (150//)
source: Color to use to print selected text when the editor doesn't have the focus.
french: Couleur utilisée pour afficher le texte sélectionné lorsque l'éditeur ne possède pas le focus.
german: Dies ist die Farbe, die verwendet wird, wenn der Editor inaktiv ist.
italian: Colore da usare per il testo selezionato qualora l'editor non avesse il focus.

# MSG_HELP_CURSOR_WIDTH (151//)
source: This is the width the cursor should have.
french: Largeur idéal du curseur.
german: Dies ist die Breite des Cursors.
italian: Questa è la dimensione che il cursore dovrebbe avere.

# MSG_HELP_CURSOR_BLINKSPEED (152//)
source: You may want the cursor to blink to make it easier to find. Select 'Off' to disable this feature.
french: Utiliser un curseur clignotant permet de le localiser plus facilement. Sélectionner 'Aucun' pour désactiver cette possibilité.
german: Sie können den Cursor blinken lassen, um ihn leichter zu finden. Wählen Sie 'aus', um einen nicht blinkenden Cursor zu bekommen.
italian: Potresti aver bisogno di un cursore lampeggiante in modo da trovarlo più facilmente all'interno di un blocco testo oppure puoi disattivare questo effetto impostandolo su "Disattivo"

# MSG_HELP_BUTTON_DEFAULTKEYS (153//)
source: Restore all keybindings to the built-in defaults.
french: Restaurer tous les raccourcis clavier à leurs valeurs originelles.
german: Alle Tastenbelegungen auf die Standardbelegung zurücksetzen.
italian: Ripristina tutte le scorciatoie da tastiera predefinite.

# MSG_HELP_BUTTON_SNOOP (154//)
source: Use this field to set a keybinding for this action. You can either edit the string gadget directly or press the 'Snoop' button to make the gadget monitor keypresses until you press it again to confirm.
french: Ce champ permet de définir un raccourci clavier pour cette action. Vous pouvez directement éditer le contenu de l'objet ou bien presser le bouton 'Apprendre' afin de permettre à l'objet d'enregistrer les pressions des touches du clavier jusqu'a ce que vous utilisiez le bouton une nouvelle fois pour valider la saisie.
german: Benutzen Sie dieses Feld, um eine Tastenkombination für die Aktion festzulegen. Sie können entweder die Belegung von Hand eingeben, oder klicken Sie auf den 'Snoop'-Schalter, um die Tastenkombination automatisch bis zum wiederholten Klicken ermitteln zu lassen.
italian: Utilizza questo campo in modo da impostare una scorciatoia da tastiera per questa specifica azione. Ricorda che è possibile modificare direttamente la stringa del gadget o usare il tasto Snoop per mantenere la pressione del tasto fino a quando lo si preme di nuovo per la conferma.

# MSG_HELP_BUTTON_INSERT (155//)
source: Add a new keybinding to the list.
french: Ajouter un nouveau raccourci clavier à la liste.
german: Neue Tastenbelegung in die Liste einfügen.
italian: Aggiungi alla lista una nuova scorciatoia.

# MSG_HELP_BUTTON_DELETE (156//)
source: Delete this keybinding from the list.
french: Retirer ce raccourci de la liste.
german: Diese Tastenbelegung aus der Liste löschen.
italian: Cancella questa scorciatoia dalla lista.

# MSG_HELP_SPELLCHECKER_LOOKUP_CMD (157//)
source: Specify here the lookup command you want to use, or leave this empty to disable the type'n'spell feature.
french: Spécifiez ici le script de commande que vous désirez utiliser ou bien laisser ce champ vide afin de désactiver l'option 'type'n'spell'.
german: Geben Sie hier das Kommando ein, das zum Prüfen der Rechtschreibung verwendet werden soll, oder lassen Sie das Feld leer, um die Prüfung zu deaktivieren.
italian: Specifica qui la ricerca del comando che si desidera utilizzare oppure lascialo vuoto in modo da disattivare il correttore ortografico.

# MSG_HELP_SPELLCHECKER_SUGGEST_CMD (158//)
source: Specify here the command that will be used to suggest an alternate word. As explained above, usually you should specify a script here.
french: Spécifiez ici le script de commande que vous désirez utiliser afin de suggérer une alternative au mot.
german: Geben Sie hier das Kommando ein, um ein alternatives Wort vorschlagen zu lassen. Wie oben beschrieben, sollte hier üblicherweise ein Skript angegeben werden.
italian: Specifica qui il comando che verrà utilizzato per i suggerimenti automatici o per le parole alternative. Generalmente potresti specificarlo con un particolare script.

# MSG_LVLabel_Action (53//)
source: \33c\0333Action:
german: \33c\0333Aktion:
italian: \33c\0333Azione:

# MSG_SliderText_StdWidth (115//)
source: %ld pixels
german: %ld Pixel
italian: %ld pixel

# MSG_Label_Normal (64//)
source: Normal
italian: Normale

# MSG_MenuItem_Normal (87//)
source: Normal
italian: Normale
