Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/texteditor/mcp/locale/czech.po
Languages: cs

# MSG_Button_DefaultKeys (5//)
source: Default _keys
cs: Výchozí _klávesy

# MSG_Button_Delete (6//)
source: _Delete
cs: Odeb_rat

# MSG_Button_Insert (7//)
source: _Insert
cs: Přid_at

# MSG_ConfigMenu_CheckWord (8//)
source: Check word
cs: Kontrola textu

# MSG_ConfigMenu_TypeNSpell (9//)
source: Type'n'spell
cs: Kontrola při psaní

# MSG_CycleItem_Mouse (12//)
source: (mouse only)
cs: (jen myší)

# MSG_Function_BOL (16//)
source: Beginning of line
cs: Začátek řádku

# MSG_Function_Bottom (18//)
source: Bottom
cs: Na konec

# MSG_Function_Copy (19//)
source: Copy
cs: Zkopírovat

# MSG_Function_Cut (20//)
source: Cut
cs: Vyjmout

# MSG_Function_DelBOL (21//)
source: Delete to BOL
cs: Smazat do začátku řádku

# MSG_Function_DelBOW (22//)
source: Delete to BOW
cs: Smazat do začátku slova

# MSG_Function_DelEOL (23//)
source: Delete to EOL
cs: Smazat do konce řádku

# MSG_Function_DelEOW (24//)
source: Delete to EOW
cs: Smazat do konce slova

# MSG_Function_Delete (25//)
source: Delete
cs: Smazat

# MSG_Function_Down (26//)
source: Down
cs: Dolů

# MSG_Function_EOL (27//)
source: End of line
cs: Konec řádku

# MSG_Function_Left (28//)
source: Left
cs: Doleva

# MSG_Function_NextGadget (29//)
source: Next gadget
cs: Další tlačítko

# MSG_Function_NxtPage (30//)
source: Next page
cs: Další strana

# MSG_Function_NxtPara (31//)
source: Next paragraph
cs: Další odstavec

# MSG_Function_NxtSent (32//)
source: Next sentence
cs: Další věta

# MSG_Function_NxtWord (33//)
source: Next word
cs: Další slovo

# MSG_Function_Paste (34//)
source: Paste
cs: Vložit

# MSG_Function_PrvPage (35//)
source: Prev page
cs: Předchozí strana

# MSG_Function_PrvPara (36//)
source: Prev paragraph
cs: Předchozí odstavec

# MSG_Function_PrvSent (37//)
source: Prev sentence
cs: Předchozí věta

# MSG_Function_PrvWord (38//)
source: Prev word
cs: Předchozí slovo

# MSG_Function_Redo (39//)
source: Redo
cs: Odvolat zpět

# MSG_Function_Return (40//)
source: Return
cs: Enter

# MSG_Function_Right (41//)
source: Right
cs: Doprava

# MSG_Function_SuggestSpelling (42//)
source: Suggest spelling
cs: Návrh na opravu slova

# MSG_Function_Tab (43//)
source: Tab
cs: Tabulátor

# MSG_Function_Top (44//)
source: Top
cs: Na začátek

# MSG_Function_Undo (45//)
source: Undo
cs: Vrátit zpět

# MSG_Function_Up (46//)
source: Up
cs: Nahoru

# MSG_GroupTitle_Control (47//)
source: Control
cs: Základní funkce

# MSG_GroupTitle_Cursor (48//)
source: Cursor
cs: Barvy kurzoru a textu

# MSG_GroupTitle_Design (49//)
source: Design
cs: Vzhled textového pole

# MSG_GroupTitle_Fonts (50//)
source: Fonts
cs: Písma pro text

# MSG_GroupTitle_Separator (51//)
source: Separator
cs: Dělicí linka

# MSG_HelpTxt_SpellChecker (52//)
source: \33u Intro \33n The TextEditor gadget allows for easy integration of external spell checkers, making it possible to have both type'n'spell and also normal word guessing. \33u Lookup command \33n For the type'n'spell you'll have to set the lookup command to a script that will lookup the word and set the environment variable "Found" to either 0 (for not found) or 1 (for a match). This matches the default behaviour of AlphaSpell. You write %s where you want the word. If you use AlphaSpell, then you can use: \33bARexx:\33n "Options Results;Address ALPHASPELL Search For '%s' Path 'T:' Danish.ald" You \33bmust\33n remember the quotes, this will let ARexx execute it as a command instead of a script. \33u Suggest command \33n If you press <HELP> over a word, then the editor will launch this command, again with %s substituted with the current word. Your script should produce a file in T: named "Matches". This file is then read by the gadget, and the contents are listed in a popup listview, from where you can choose a word which will replace the misspelled one. Again, AlphaSpell users can use: \33bARexx:\33n "Options Results;Address ALPHASPELL Match '%s' To 'T:Matches' Path 'T:' Danish.ald" If you use the methods described above, then you must start AlphaSpell with the "ARexx" switch. It is advised to keep your dictionary in RAM if you enable the type'n'spell feature.
cs: \33u Stručný popis \33n Prvek TextEditor lze snadno provázat s externími programy pro kontrolu pravopisu. Nabízí možnost sledování správnosti textu při psaní a zároveň i návrhy na opravu napsaných slov. \33u Kontrola textu při psaní \33n Nejprve je nutné nainstalovat některý z programů pro kontrolu pravopisu a poté zadat odpovídající příkaz do pole 'Kontrola při psaní'. Je třeba, aby daný příkaz nebo skript po detekci slova nastavil proměnnou prostředí "Found" na 0 (nenalezeno ve slovníku) nebo 1 (nalezeno). Tento způsob používá program AlphaSpell. Namísto slova napište proměnnou %s. Pokud tedy použijete AlphaSpell, bude příkaz vypadat následovně: \33bARexx:\33n "Options Results;Address ALPHASPELL Search For '%s' Path 'T:' Czech.ald" Pozn.: \33bNezapomeňte\33n na uvozovky! Bez nich to nebude fungovat. \33u Návrh na opravu napsaných slov \33n Umístěte kurzor na některé ze slov v textu, stiskněte klávesu HELP (nebo jinou, kterou jste si nadefinovali) a editor spustí příkaz definovaný v poli 'Návrh opravy slova' s vybraným slovem uvedeným namísto parametru %s. V rámci tohoto procesu se vytvoří soubor nazvaný "Matches" v adresáři T:. Tento soubor poté načte prvek TextEditor a zobrazí jeho obsah v rolovacím seznamu, ze kterého si vyberete požadované slovo. V případě programu AlphaSpell stačí napsat: \33bARexx:\33n "Options Results;Address ALPHASPELL Match '%s' To 'T:Matches' Path 'T:' Czech.ald" Pozn.: Vyberete-li si z nabízených možností kontrolu textu při psaní, doporučujeme zkopírovat slovník do paměti. Vhodný je např. "Ram Disk:" nebo podobný disk.

# MSG_LVLabel_Action (53//)
source: \33c\0333Action:
cs: \33c\0333Akce:

# MSG_LVLabel_Key (54//)
source: \33c\0333Key:
cs: \33c\0333Klávesa:

# MSG_Label_Background (55//)
source: Background
cs: Pozadí

# MSG_Label_BlinkSpeed (56//)
source: Blinkspeed
cs: Rychlost blikání

# MSG_Label_BlkQual (57//)
source: Block qualifier
cs: Označení bloku textu

# MSG_Label_Cursor (58//)
source: Normal
cs: Normální

# MSG_Label_Fixed (59//)
source: Fixed
cs: Fixní

# MSG_Label_Frame (60//)
source: Frame
cs: Rámeček

# MSG_Label_Highlight (61//)
source: Highlight
cs: Zvýraznění

# MSG_Label_LookupCmd (62//)
source: Lookup command
cs: Kontrola při psaní

# MSG_Label_LookupWords (63//)
source: Lookup word before suggesting?
cs: Kontrolovat slova před návrhem

# MSG_Label_Normal (64//)
source: Normal
cs: Normální

# MSG_Label_Selected (65//)
source: Selected
cs: Vybraný

# MSG_Label_SeparatorShadow (66//)
source: Shadow
cs: Tmavá hrana

# MSG_Label_SeparatorShine (67//)
source: Shine
cs: Světlá hrana

# MSG_Label_Smooth (68//)
source: Smooth
cs: Plynule posouvat text

# MSG_Label_SpellNType (69//)
source: Spell check as you type?
cs: Kontrolovat přímo při psaní

# MSG_Label_SuggestCmd (70//)
source: Suggest command
cs: Návrh opravy slova

# MSG_Label_TabSize (71//)
source: Tab size
cs: Velikost tabulátoru

# MSG_Label_UndoLevel (73//)
source: Undo levels
cs: Počet kroků zpět

# MSG_Label_Width (74//)
source: Width
cs: Šířka

# MSG_MenuItem_Background (75//)
source: Background
cs: Pozadí

# MSG_MenuItem_Bold (76//)
source: Bold
cs: Tučné

# MSG_MenuItem_Center (77//)
source: Center
cs: Na střed

# MSG_MenuItem_Copy (78//)
source: Copy
cs: Zkopírovat

# MSG_MenuItem_Cut (79//)
source: Cut
cs: Vyjmout

# MSG_MenuItem_Delete (80//)
source: Delete
cs: Odstranit

# MSG_MenuItem_Fill (81//)
source: Fill
cs: Vyplňovací

# MSG_MenuItem_Halfshadow (82//)
source: Halfshadow
cs: Polotmavá

# MSG_MenuItem_Halfshine (83//)
source: Halfshine
cs: Polosvětlá

# MSG_MenuItem_Italic (84//)
source: Italic
cs: Kurzíva

# MSG_MenuItem_Left (85//)
source: Left
cs: Vlevo

# MSG_MenuItem_Mark (86//)
source: Mark
cs: Pro výběr

# MSG_MenuItem_Normal (87//)
source: Normal
cs: Normální

# MSG_MenuItem_Paste (88//)
source: Paste
cs: Vložit

# MSG_MenuItem_Redo (89//)
source: Redo
cs: Odvolat zpět

# MSG_MenuItem_Right (90//)
source: Right
cs: Vpravo

# MSG_MenuItem_Shadow (91//)
source: Shadow
cs: Tmavá

# MSG_MenuItem_Shine (92//)
source: Shine
cs: Světlá

# MSG_MenuItem_Underline (94//)
source: Underline
cs: Podtržené

# MSG_MenuItem_Undo (95//)
source: Undo
cs: Zpět

# MSG_MenuSubTitle_Alignment (96//)
source: Alignment
cs: Zarovnat

# MSG_MenuSubTitle_Color (97//)
source: Color
cs: Barva

# MSG_MenuTitle_Edit (98//)
source: Edit
cs: Upravit

# MSG_Page_Keybindings (99//)
source: Keybindings
cs: Klávesy

# MSG_Page_Sample (100//)
source: Sample
cs: Ukázka

# MSG_Page_Settings (101//)
source: Settings
cs: Možnosti

# MSG_Page_SpellChecker (102//)
source: Spell checker
cs: Kontrola pravopisu

# MSG_PopWinTitle_Background (103//)
source: Select background
cs: Vyberte pozadí

# MSG_PopWinTitle_Cursor (104//)
source: Select cursor color
cs: Vyberte barvu kurzoru

# MSG_PopWinTitle_Frame (105//)
source: Adjust frame
cs: Vyberte druh rámečku pro textové pole

# MSG_PopWinTitle_Highlight (106//)
source: Select highlight color
cs: Vyberte barvu pro zvýrazněný text

# MSG_PopWinTitle_Selected (107//)
source: Select block color
cs: Vyberte barvu pro vybraný blok textu

# MSG_PopWinTitle_SeparatorShadow (108//)
source: Select separators shadow color
cs: Vyberte tmavou barvu dělicí linky

# MSG_PopWinTitle_SeparatorShine (109//)
source: Select separators shine color
cs: Vyberte světlou barvu dělicí linky

# MSG_PopWinTitle_Text (110//)
source: Select text color
cs: Vyberte barvu textu

# MSG_SliderText_MaxWidth (111//)
source: Same as char
cs: Podle znaku

# MSG_SliderText_MinSpeed (112//)
source: Off
cs: -vyp-

# MSG_SliderText_MinWidth (113//)
source: 1 pixel
cs: 1 b.

# MSG_SliderText_StdWidth (115//)
source: %ld pixels
cs: %ld b.

# MSG_SliderText_TabSize (116//)
source: %ld spaces
cs: %ld mez.

# MSG_Function_GotoBookmark1 (117//)
source: Goto bookmark 1
cs: Přejít na záložku č.1

# MSG_Function_GotoBookmark2 (118//)
source: Goto bookmark 2
cs: Přejít na záložku č.2

# MSG_Function_GotoBookmark3 (119//)
source: Goto bookmark 3
cs: Přejít na záložku č.3

# MSG_Function_SetBookmark1 (120//)
source: Set bookmark 1
cs: Vytvořit záložku č.1

# MSG_Function_SetBookmark2 (121//)
source: Set bookmark 2
cs: Vytvořit záložku č.2

# MSG_Function_SetBookmark3 (122//)
source: Set bookmark 3
cs: Vytvořit záložku č.3

# MSG_Button_Snoop (123//)
source: Snoop
cs: Zachytit

# MSG_Function_DelLine (124//)
source: Delete line
cs: Smazat řádek

# MSG_Function_SelectAll (125//)
source: Select all
cs: Vybrat vše

# MSG_Function_SelectNone (126//)
source: Select none
cs: Zrušit výběr

# MSG_WarnConfigVersion_Title (127//)
source: TextEditor.mcp warning
cs: TextEditor.mcp :: Upozornění

# MSG_WarnConfigVersion (128//)
source: Your currently saved keybindings setup is incompatible with the version of TextEditor.mcc you have installed. It is suggested that you reset the current keybindings to their defaults and edit them manually afterwards.
cs: Uložená konfigurace klávesnice není kompatibilní s nainstalovanou verzí prvku TextEditor.mcc. Doporučujeme vám obnovit výchozí stav konfigurace a následně doplnit předchozí úpravy.

# MSG_ResetAbort (129//)
source: Reset|Abort
cs: Resetovat|Přerušit

# MSG_WarnHotkeyString_Title (130//)
source: TextEditor.mcp warning
cs: TextEditor.mcp :: Upozornění

# MSG_WarnHotkeyString (131//)
source: TextEditor.mcp couldn't open the minimum required version of the HotkeyString.mcc custom class and therefore failed during initialization. Please make sure you have the latest Hotkeystring.mcc class from http://www.sf.net/projects/bstring-mcc/ installed and try again.
cs: TextEditor.mcp vyžaduje prvek HotkeyString.mcc, který je buď zastaralý nebo úplně chybí. Přejděte prosím na http://www.sf.net/projects/bstring-mcc/, stáhněte aktuální verzi tohoto programu, nainstalujte ho a požadovaný programu spusťte znovu.

# MSG_Label_InactiveCursor (133//)
source: Inactive cursor
cs: Neaktivní kurzor

# MSG_HELP_InactiveCursor (134//)
source: If enabled, a custom cursor will be used whenever the editor doesn't have the focus.
cs: Tímto zapnete zobrazení speciálního druhu kurzoru v případě, že textové pole není aktivní.

# MSG_Label_SelectPointer (135//)
source: Selection pointer
cs: Změnit šipku na kurzor

# MSG_HELP_SelectPointer (136//)
source: If enabled, a custom selection pointer will appear when the mouse pointer is above the texteditor gadget.
cs: Tímto zapnete automatickou změnu vzhledu šipky myši na kurzor po přesunutí na textové pole.

# MSG_Label_InactiveColor (137//)
source: Inactive
cs: Neaktivní

# MSG_PopWinTitle_InactiveColor (138//)
source: Select inactive color
cs: Vyberte barvu neaktivního kurzoru

# MSG_HELP_TABSIZE (139//)
source: How many spaces hitting the <TAB> key will jump.
cs: Definuje počet mezer vložených do textu po stisknutí klávesy TAB.

# MSG_HELP_DESIGN_FRAME (140//)
source: This is a button to adjust a frame. Click it to open an adjust window or use the drag&drop facilities to copy from or to another frame adjust button.
cs: Definuje vzhled rámečku textového pole.

# MSG_HELP_DESIGN_BACKGROUND (141//)
source: This is a button to adjust a background color or pattern. Click it to open an adjust window or use the drag&drop facilities to copy from or to another background adjust button.
cs: Definuje barvu nebo obrázek pozadí textu.

# MSG_HELP_DESIGN_TEXT (142//)
source: This is the color used to print the text.
cs: Definuje barvu standardního textu.

# MSG_HELP_DESIGN_HIGHLIGHT (143//)
source: This is the color used to print highlighted text.
cs: Definuje barvu zvýrazněného textu.

# MSG_HELP_SEPARATOR_SHINE (144//)
source: This is the color used to print separator bars.
cs: Definuje světlou složku dělicí linky.

# MSG_HELP_SEPARATOR_SHADOW (145//)
source: This is the color used to print separator bars in shadow mode.
cs: Definuje tmavou složku dělicí linky.

# MSG_HELP_FONTS_NORMAL (146//)
source: Default font to be used by the editor.
cs: Definuje výchozí písmo pro text.

# MSG_HELP_FONTS_FIXED (147//)
source: Default font to be used by the editor whenever a fixed width font is requested.
cs: Definuje výchozí fixní písmo pro text.

# MSG_HELP_CURSOR_NORMAL (148//)
source: Default color to be used for the cursor.
cs: Definuje výchozí barvu kurzoru.

# MSG_HELP_CURSOR_SELECTED (149//)
source: Color to be used for the cursor in selected text.
cs: Definuje barvu pro vybraný text.

# MSG_HELP_CURSOR_INACTIVE (150//)
source: Color to use to print selected text when the editor doesn't have the focus.
cs: Definuje barvu pro vybraný, ale neaktivní text.

# MSG_HELP_CURSOR_WIDTH (151//)
source: This is the width the cursor should have.
cs: Definuje šířku kurzoru.

# MSG_HELP_CURSOR_BLINKSPEED (152//)
source: You may want the cursor to blink to make it easier to find. Select 'Off' to disable this feature.
cs: Definuje zda a jak rychle má kurzor blikat.

# MSG_HELP_BUTTON_DEFAULTKEYS (153//)
source: Restore all keybindings to the built-in defaults.
cs: Umožní obnovit výchozí klávesové zkratky.

# MSG_HELP_BUTTON_SNOOP (154//)
source: Use this field to set a keybinding for this action. You can either edit the string gadget directly or press the 'Snoop' button to make the gadget monitor keypresses until you press it again to confirm.
cs: Do tohoto pole buď přímo zadejte požadovanou klávesovou zkratku anebo využijte tlačítko 'Zachytit' a nechte si potřebné údaje doplnit automaticky. Postup je snadný: Levým tlačítkem myši klikněte na tlačítko Zachytit, zmáčkněte potřebnou kombinaci kláves a volbu potvrďte druhým kliknutím.

# MSG_HELP_BUTTON_INSERT (155//)
source: Add a new keybinding to the list.
cs: Umožní přidat novou klávesovou zkratku.

# MSG_HELP_BUTTON_DELETE (156//)
source: Delete this keybinding from the list.
cs: Umožní odstranit vybranou klávesovou zkratku.

# MSG_HELP_SPELLCHECKER_LOOKUP_CMD (157//)
source: Specify here the lookup command you want to use, or leave this empty to disable the type'n'spell feature.
cs: Definuje příkaz pro kontrolu textu přímo během psaní.

# MSG_HELP_SPELLCHECKER_SUGGEST_CMD (158//)
source: Specify here the command that will be used to suggest an alternate word. As explained above, usually you should specify a script here.
cs: Definuje příkaz pro návrh variant napsaného slova.
