Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/texteditor/mcp/locale/danish.po
Languages: da

# MSG_HelpBubble_BlockQual (0//)
source: Move the cursor key and hold down the qualifier that you set here to mark text.
da: Angiver hvilken tast du kan holde nede for at markere tekst med piletasterne.

# MSG_HelpBubble_CheckWord (1//)
source: If enabled, then the editor will lookup the word, and only show suggestions if the word is misspelled.
da: Angiver om ordet skal tjekkes, og staveforslag fremvises hvis det er stavet forkert.

# MSG_HelpBubble_Smooth (2//)
source: This enables pixel smooth scrolling.
da: Giver en mere glidende rulning af teksten.

# MSG_HelpBubble_TypeNSpell (3//)
source: Enable this to let the editor lookup the words while you type them.
da: Angiver om der skal tjekkes for retstavning mens du skriver.

# MSG_HelpBubble_UndoLevel (4//)
source: Each undo level eats up 10 bytes of memory. Cut and copy will take a little more, depending on the size of the block you are cutting or copying.
da: Hver mulig fortrydelse koster 10 bytes hukommelse. Det koster lidt mere at klippe og kopiere, afhængigt af størrelsen på det der klippes eller kopieres.

# MSG_Button_DefaultKeys (5//)
source: Default _keys
da: _Nulstille taster

# MSG_Button_Delete (6//)
source: _Delete
da: _Slette

# MSG_Button_Insert (7//)
source: _Insert
da: _Tilføje

# MSG_ConfigMenu_CheckWord (8//)
source: Check word
da: Tjekke ord

# MSG_ConfigMenu_TypeNSpell (9//)
source: Type'n'spell
da: Skriv-og-ret

# MSG_CycleItem_Ctrl (11//)
source: Control
da: Ctrl

# MSG_CycleItem_Mouse (12//)
source: (mouse only)
da: (kun via mus)

# MSG_CycleItem_Shift (13//)
source: Shift
da: Skift

# MSG_Function_BOL (16//)
source: Beginning of line
da: Start af linje

# MSG_Function_Backspace (17//)
source: Backspace
da: Slette bogstav til venstre

# MSG_Function_Bottom (18//)
source: Bottom
da: Gå til bunden

# MSG_Function_Copy (19//)
source: Copy
da: Kopiere

# MSG_Function_Cut (20//)
source: Cut
da: Klippe

# MSG_Function_DelBOL (21//)
source: Delete to BOL
da: Slette til start af linje

# MSG_Function_DelBOW (22//)
source: Delete to BOW
da: Slette til start af ord

# MSG_Function_DelEOL (23//)
source: Delete to EOL
da: Slette til slutning af linje

# MSG_Function_DelEOW (24//)
source: Delete to EOW
da: Slette til næste ord

# MSG_Function_Delete (25//)
source: Delete
da: Slette bogstav til højre

# MSG_Function_Down (26//)
source: Down
da: Gå ned

# MSG_Function_EOL (27//)
source: End of line
da: Slutning af linje

# MSG_Function_Left (28//)
source: Left
da: Venstre

# MSG_Function_NextGadget (29//)
source: Next gadget
da: Gå til næste knap

# MSG_Function_NxtPage (30//)
source: Next page
da: Næste side

# MSG_Function_NxtPara (31//)
source: Next paragraph
da: Næste afsnit

# MSG_Function_NxtSent (32//)
source: Next sentence
da: Næste sætning

# MSG_Function_NxtWord (33//)
source: Next word
da: Næste ord

# MSG_Function_Paste (34//)
source: Paste
da: Sætte ind

# MSG_Function_PrvPage (35//)
source: Prev page
da: Forrige side

# MSG_Function_PrvPara (36//)
source: Prev paragraph
da: Forrige afsnit

# MSG_Function_PrvSent (37//)
source: Prev sentence
da: Forrige sætning

# MSG_Function_PrvWord (38//)
source: Prev word
da: Forrige ord

# MSG_Function_Redo (39//)
source: Redo
da: Gendanne

# MSG_Function_Return (40//)
source: Return
da: Linjeskift

# MSG_Function_Right (41//)
source: Right
da: Højre

# MSG_Function_SuggestSpelling (42//)
source: Suggest spelling
da: Foreslå stavning

# MSG_Function_Tab (43//)
source: Tab
da: Tabulator

# MSG_Function_Top (44//)
source: Top
da: Gå til toppen

# MSG_Function_Undo (45//)
source: Undo
da: Fortryde

# MSG_Function_Up (46//)
source: Up
da: Gå op

# MSG_GroupTitle_Control (47//)
source: Control
da: Styring

# MSG_GroupTitle_Cursor (48//)
source: Cursor
da: Markør

# MSG_GroupTitle_Design (49//)
source: Design
da: Udseende

# MSG_GroupTitle_Fonts (50//)
source: Fonts
da: Skrifttyper

# MSG_GroupTitle_Separator (51//)
source: Separator
da: Skillelinje

# MSG_HelpTxt_SpellChecker (52//)
source: \33u Intro \33n The TextEditor gadget allows for easy integration of external spell checkers, making it possible to have both type'n'spell and also normal word guessing. \33u Lookup command \33n For the type'n'spell you'll have to set the lookup command to a script that will lookup the word and set the environment variable "Found" to either 0 (for not found) or 1 (for a match). This matches the default behaviour of AlphaSpell. You write %s where you want the word. If you use AlphaSpell, then you can use: \33bARexx:\33n "Options Results;Address ALPHASPELL Search For '%s' Path 'T:' Danish.ald" You \33bmust\33n remember the quotes, this will let ARexx execute it as a command instead of a script. \33u Suggest command \33n If you press <HELP> over a word, then the editor will launch this command, again with %s substituted with the current word. Your script should produce a file in T: named "Matches". This file is then read by the gadget, and the contents are listed in a popup listview, from where you can choose a word which will replace the misspelled one. Again, AlphaSpell users can use: \33bARexx:\33n "Options Results;Address ALPHASPELL Match '%s' To 'T:Matches' Path 'T:' Danish.ald" If you use the methods described above, then you must start AlphaSpell with the "ARexx" switch. It is advised to keep your dictionary in RAM if you enable the type'n'spell feature.
da: \033u Forklaring \033n "TextEditor.mcc" giver dig mulighed for nemt at integrere en ekstern stavekontrol. Dette giver dig mulighed for at have "skriv og ret" samt normal ordgætning. \033u Opslagskommando \033n For "skriv og ret" skal du sætte opslagskommandoen til en kommando der slår ordet op og sætter variablen "Found" til enten 0 (hvis ordet er stavet forkert) eller 1 (hvis ordet er stavet rigtigt). Jeg har valgt denne adfærd da den passer til AlphaSpell. Du skriver et %s hvor du ønsker ordet indsat. Hvis du bruger AlphaSpell, kan du skrive: \033bARexx:\033n "Options Results;Address ALPHASPELL Search For '%s' Path 'T:' Danish.ald" Du skal huske anførselstegnene da disse fortæller ARexx at det er en kommando og ikke et program. \033u Forslagskommando \033n Hvis du trykker HELP over et ord, vil redigeringspanelet starte forslagskommandoen, igen med %s erstattet af det ord markøren er over. Din kommando skal producere en fil i T: med navnet "Matches". Denne fil bliver så indlæst af redigeringspanelet, og indholdet bliver vist i en liste hvorfra man kan vælge det ord som skal erstatte det fejlstavede. Igen kan AlphaSpell-brugere skrive: \033bARexx:\033n "Options Results;Address ALPHASPELL Match '%s' To 'T:Matches' Path 'T:' Danish.ald" Hvis du bruger metoderne som er beskrevet ovenfor, skal du have startet AlphaSpell med "ARexx" som argument. Det anbefales at have sine ordbøger liggende i RAM: hvis man gør brug af "skriv og ret".

# MSG_LVLabel_Action (53//)
source: \33c\0333Action:
da: \033c\0333Handling:

# MSG_LVLabel_Key (54//)
source: \33c\0333Key:
da: \033c\0333Tastekombination:

# MSG_Label_Background (55//)
source: Background
da: Baggrund

# MSG_Label_BlinkSpeed (56//)
source: Blinkspeed
da: Blink

# MSG_Label_BlkQual (57//)
source: Block qualifier
da: Afmærkningstast

# MSG_Label_Cursor (58//)
source: Normal
da: Markør

# MSG_Label_Fixed (59//)
source: Fixed
da: Fast bredde

# MSG_Label_Frame (60//)
source: Frame
da: Ramme

# MSG_Label_Highlight (61//)
source: Highlight
da: Oplyst

# MSG_Label_LookupCmd (62//)
source: Lookup command
da: Opslagskommando

# MSG_Label_LookupWords (63//)
source: Lookup word before suggesting?
da: Slå ord op før forslag

# MSG_Label_Selected (65//)
source: Selected
da: Markeret

# MSG_Label_SeparatorShadow (66//)
source: Shadow
da: Skygge

# MSG_Label_SeparatorShine (67//)
source: Shine
da: Højlys

# MSG_Label_Smooth (68//)
source: Smooth
da: Jævn rulning

# MSG_Label_SpellNType (69//)
source: Spell check as you type?
da: Tjekke stavning mens du skriver

# MSG_Label_SuggestCmd (70//)
source: Suggest command
da: Forslagskommando

# MSG_Label_TabSize (71//)
source: Tab size
da: Tabulatorlgd.

# MSG_Label_Text (72//)
source: Text
da: Tekst

# MSG_Label_UndoLevel (73//)
source: Undo levels
da: Fortrydelseslag

# MSG_Label_Width (74//)
source: Width
da: Bredde

# MSG_MenuItem_Background (75//)
source: Background
da: Baggrund

# MSG_MenuItem_Bold (76//)
source: Bold
da: Fed

# MSG_MenuItem_Center (77//)
source: Center
da: Centreret

# MSG_MenuItem_Copy (78//)
source: Copy
da: Kopiere

# MSG_MenuItem_Cut (79//)
source: Cut
da: Klippe

# MSG_MenuItem_Delete (80//)
source: Delete
da: Slette alt

# MSG_MenuItem_Fill (81//)
source: Fill
da: Udfyldning

# MSG_MenuItem_Halfshadow (82//)
source: Halfshadow
da: Halvmørk

# MSG_MenuItem_Halfshine (83//)
source: Halfshine
da: Halvlys

# MSG_MenuItem_Italic (84//)
source: Italic
da: Kursiv

# MSG_MenuItem_Left (85//)
source: Left
da: Venstre

# MSG_MenuItem_Mark (86//)
source: Mark
da: Markering

# MSG_MenuItem_Paste (88//)
source: Paste
da: Sætte ind

# MSG_MenuItem_Redo (89//)
source: Redo
da: Gendanne

# MSG_MenuItem_Right (90//)
source: Right
da: Højre

# MSG_MenuItem_Shadow (91//)
source: Shadow
da: Skygge

# MSG_MenuItem_Shine (92//)
source: Shine
da: Højlys

# MSG_MenuItem_Text (93//)
source: Text
da: Tekst

# MSG_MenuItem_Underline (94//)
source: Underline
da: Understreget

# MSG_MenuItem_Undo (95//)
source: Undo
da: Fortryde

# MSG_MenuSubTitle_Alignment (96//)
source: Alignment
da: Udslutning

# MSG_MenuSubTitle_Color (97//)
source: Color
da: Farve

# MSG_MenuTitle_Edit (98//)
source: Edit
da: Redigering

# MSG_Page_Keybindings (99//)
source: Keybindings
da: Tastebindinger

# MSG_Page_Sample (100//)
source: Sample
da: Eksempel

# MSG_Page_Settings (101//)
source: Settings
da: Indstillinger

# MSG_Page_SpellChecker (102//)
source: Spell checker
da: Stavekontrol

# MSG_PopWinTitle_Background (103//)
source: Select background
da: Vælg baggrund

# MSG_PopWinTitle_Cursor (104//)
source: Select cursor color
da: Vælg markørens farve

# MSG_PopWinTitle_Frame (105//)
source: Adjust frame
da: Vælg ramme

# MSG_PopWinTitle_Highlight (106//)
source: Select highlight color
da: Vælg oplyst farve

# MSG_PopWinTitle_Selected (107//)
source: Select block color
da: Vælg markeringsfarve

# MSG_PopWinTitle_SeparatorShadow (108//)
source: Select separators shadow color
da: Vælg skillelinjens skyggefarve

# MSG_PopWinTitle_SeparatorShine (109//)
source: Select separators shine color
da: Vælg skillelinjens højlys-farve

# MSG_PopWinTitle_Text (110//)
source: Select text color
da: Vælg tekstfarve

# MSG_SliderText_MaxWidth (111//)
source: Same as char
da: Samme som tegn

# MSG_SliderText_MinSpeed (112//)
source: Off
da: Ingen

# MSG_SliderText_TabSize (116//)
source: %ld spaces
da: %ld mellemrum

# MSG_Function_GotoBookmark1 (117//)
source: Goto bookmark 1
da: Hoppe til bogmærke 1

# MSG_Function_GotoBookmark2 (118//)
source: Goto bookmark 2
da: Hoppe til bogmærke 2

# MSG_Function_GotoBookmark3 (119//)
source: Goto bookmark 3
da: Hoppe til bogmærke 3

# MSG_Function_SetBookmark1 (120//)
source: Set bookmark 1
da: Anbringe bogmærke 1

# MSG_Function_SetBookmark2 (121//)
source: Set bookmark 2
da: Anbringe bogmærke 2

# MSG_Function_SetBookmark3 (122//)
source: Set bookmark 3
da: Anbringe bogmærke 3

# MSG_Button_Snoop (123//)
source: Snoop
da: Opsnappe

# MSG_Function_DelLine (124//)
source: Delete line
da: Slette linje

# MSG_Function_SelectAll (125//)
source: Select all
da: Markere alt

# MSG_Function_SelectNone (126//)
source: Select none
da: Afmarkere alt

# MSG_WarnConfigVersion_Title (127//)
source: TextEditor.mcp warning
da: Advarsel fra TextEditor.mcp

# MSG_WarnConfigVersion (128//)
source: Your currently saved keybindings setup is incompatible with the version of TextEditor.mcc you have installed. It is suggested that you reset the current keybindings to their defaults and edit them manually afterwards.
da: Den tidligere gemte opsætning af tastebindinger er ikke kompatibel med den nu installerede version af TextEditor.mcc. Det anbefales at nulstille de aktuelle tastebindinger og redigere dem manuelt igen bagefter.

# MSG_ResetAbort (129//)
source: Reset|Abort
da: Nulstille|Afbryde

# MSG_WarnHotkeyString_Title (130//)
source: TextEditor.mcp warning
da: Advarsel fra TextEditor.mcp

# MSG_WarnHotkeyString (131//)
source: TextEditor.mcp couldn't open the minimum required version of the HotkeyString.mcc custom class and therefore failed during initialization. Please make sure you have the latest Hotkeystring.mcc class from http://www.sf.net/projects/bstring-mcc/ installed and try again.
da: TextEditor.mcp kunne ikke åbne den krævede eller højere version af specialklassen HotkeyString.mcc og måtte derfor opgive initialisering. Tjek at du har den seneste HotkeyString.mcc-klasse fra http://www.sf.net/projects/bstring-mcc/ installeret og prøv igen.

# MSG_Label_InactiveCursor (133//)
source: Inactive cursor
da: Musepil ved inaktivitet

# MSG_HELP_InactiveCursor (134//)
source: If enabled, a custom cursor will be used whenever the editor doesn't have the focus.
da: Ved hak her vil en speciel musepil blive anvendt når fokus ikke er på redigeringspanelet.

# MSG_Label_SelectPointer (135//)
source: Selection pointer
da: Musepil over panelet

# MSG_HELP_SelectPointer (136//)
source: If enabled, a custom selection pointer will appear when the mouse pointer is above the texteditor gadget.
da: Ved hak her vil en speciel musepil blive vist når musen er over redigeringspanelet.

# MSG_Label_InactiveColor (137//)
source: Inactive
da: Inaktiv

# MSG_PopWinTitle_InactiveColor (138//)
source: Select inactive color
da: Vælg farven for inaktivitet

# MSG_HELP_TABSIZE (139//)
source: How many spaces hitting the <TAB> key will jump.
da: Antal tegn der flyttes ved brug af <TAB>-tasten.

# MSG_HELP_DESIGN_FRAME (140//)
source: This is a button to adjust a frame. Click it to open an adjust window or use the drag&drop facilities to copy from or to another frame adjust button.
da: Denne knap anvendes til indstilling af en ramme. Ved klik på den åbnes et vindue til indstilling. Man kan også bruge træk & slip til at kopiere fra og til en anden rammeindstillingsknap.

# MSG_HELP_DESIGN_BACKGROUND (141//)
source: This is a button to adjust a background color or pattern. Click it to open an adjust window or use the drag&drop facilities to copy from or to another background adjust button.
da: Denne knap anvendes til indstilling af en baggrundsfarve eller et baggrundsmønster. Ved klik på den åbner et indstillingsvindue. Man kan også bruge træk & slip til at kopiere fra og til en anden baggrundsindstillingsknap.

# MSG_HELP_DESIGN_TEXT (142//)
source: This is the color used to print the text.
da: Denne farve benyttes til at skrive teksten.

# MSG_HELP_DESIGN_HIGHLIGHT (143//)
source: This is the color used to print highlighted text.
da: Denne farve benyttes til at skrive fremhævet tekt.

# MSG_HELP_SEPARATOR_SHINE (144//)
source: This is the color used to print separator bars.
da: Denne farve benyttes til at tegne skillelinjers højlys.

# MSG_HELP_SEPARATOR_SHADOW (145//)
source: This is the color used to print separator bars in shadow mode.
da: Denne farve benyttes til at tegne skillelinjers skygger.

# MSG_HELP_FONTS_NORMAL (146//)
source: Default font to be used by the editor.
da: Skriftsnittet som benyttes som standard i redigeringspanelet.

# MSG_HELP_FONTS_FIXED (147//)
source: Default font to be used by the editor whenever a fixed width font is requested.
da: Skriftsnittet som benyttes i redigeringspanelet når der kræves et skriftsnit med fast bredde.

# MSG_HELP_CURSOR_NORMAL (148//)
source: Default color to be used for the cursor.
da: Farven som benyttes som standard til markøren.

# MSG_HELP_CURSOR_SELECTED (149//)
source: Color to be used for the cursor in selected text.
da: Farven som benyttes til markøren i markeret tekst.

# MSG_HELP_CURSOR_INACTIVE (150//)
source: Color to use to print selected text when the editor doesn't have the focus.
da: Farven som benyttes til at skrive markeret tekst når fokus ikke er på redigeringspanelet.

# MSG_HELP_CURSOR_WIDTH (151//)
source: This is the width the cursor should have.
da: Bredden som markøren skal have.

# MSG_HELP_CURSOR_BLINKSPEED (152//)
source: You may want the cursor to blink to make it easier to find. Select 'Off' to disable this feature.
da: Måske foretrækker du at markøren blinker for at gøre den lettere at få øje på. Man slår blinket fra ved at vælge 'Ingen'.

# MSG_HELP_BUTTON_DEFAULTKEYS (153//)
source: Restore all keybindings to the built-in defaults.
da: Nulstiller alle tastebindinger til de indbyggede standardbindinger.

# MSG_HELP_BUTTON_SNOOP (154//)
source: Use this field to set a keybinding for this action. You can either edit the string gadget directly or press the 'Snoop' button to make the gadget monitor keypresses until you press it again to confirm.
da: Dette felt benyttes til at opsætte en tastebinding for den tilhørende handling. Man kan enten redigere teksten i feltet direkte, eller man kan klikke på knappen 'Opsnappe' og få optaget sine tastetryk indtil man bekræfter ved at klikke på knappen igen.

# MSG_HELP_BUTTON_INSERT (155//)
source: Add a new keybinding to the list.
da: Tilføjer en ny tastebinding til listen.

# MSG_HELP_BUTTON_DELETE (156//)
source: Delete this keybinding from the list.
da: Sletter den aktuelle tastebinding fra listen.

# MSG_HELP_SPELLCHECKER_LOOKUP_CMD (157//)
source: Specify here the lookup command you want to use, or leave this empty to disable the type'n'spell feature.
da: Her angiver man den opslagskommando man vil anvende, eller lader feltet står tomt hvis man vil slå "skriv og ret" funktionen fra.

# MSG_HELP_SPELLCHECKER_SUGGEST_CMD (158//)
source: Specify here the command that will be used to suggest an alternate word. As explained above, usually you should specify a script here.
da: Her angiver man den kommando som skal benyttes til at foreslå et alternativt ord. Som forklaret ovenfor skal man normalt angive et script her.
