Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/texteditor/mcp/locale/polish.po
Languages: pl

# MSG_Button_DefaultKeys (5//)
source: Default _keys
pl: _Klawisze domy¶lne

# MSG_Button_Delete (6//)
source: _Delete
pl: _Usuń

# MSG_Button_Insert (7//)
source: _Insert
pl: _Wstaw

# MSG_ConfigMenu_CheckWord (8//)
source: Check word
pl: SprawdŒ słowo

# MSG_ConfigMenu_TypeNSpell (9//)
source: Type'n'spell
pl: Pisz i sprawdzaj

# MSG_CycleItem_Mouse (12//)
source: (mouse only)
pl: (tylko myszka)

# MSG_Function_BOL (16//)
source: Beginning of line
pl: Pocz±tek linii

# MSG_Function_Bottom (18//)
source: Bottom
pl: Koniec pliku

# MSG_Function_Copy (19//)
source: Copy
pl: Skopiuj

# MSG_Function_Cut (20//)
source: Cut
pl: Wytnij

# MSG_Function_DelBOL (21//)
source: Delete to BOL
pl: Skasuj do pocz±tku linii

# MSG_Function_DelBOW (22//)
source: Delete to BOW
pl: Skasuj do pocz±tku słowa

# MSG_Function_DelEOL (23//)
source: Delete to EOL
pl: Skasuj do końca linii

# MSG_Function_DelEOW (24//)
source: Delete to EOW
pl: Skasuj do końca słowa

# MSG_Function_Delete (25//)
source: Delete
pl: Skasuj

# MSG_Function_Down (26//)
source: Down
pl: W dół

# MSG_Function_EOL (27//)
source: End of line
pl: Koniec linii

# MSG_Function_Left (28//)
source: Left
pl: Lewo

# MSG_Function_NextGadget (29//)
source: Next gadget
pl: Nastêpny gadżet

# MSG_Function_NxtPage (30//)
source: Next page
pl: Nastêpna strona

# MSG_Function_NxtPara (31//)
source: Next paragraph
pl: Nastêpny akapit

# MSG_Function_NxtSent (32//)
source: Next sentence
pl: Nastêpne zdanie

# MSG_Function_NxtWord (33//)
source: Next word
pl: Nastêpne słowo

# MSG_Function_Paste (34//)
source: Paste
pl: Wklej

# MSG_Function_PrvPage (35//)
source: Prev page
pl: Poprzednia strona

# MSG_Function_PrvPara (36//)
source: Prev paragraph
pl: Poprzedni akapit

# MSG_Function_PrvSent (37//)
source: Prev sentence
pl: Poprzednie zdanie

# MSG_Function_PrvWord (38//)
source: Prev word
pl: Poprzednie słowo

# MSG_Function_Redo (39//)
source: Redo
pl: Przywróæ

# MSG_Function_Right (41//)
source: Right
pl: W prawo

# MSG_Function_SuggestSpelling (42//)
source: Suggest spelling
pl: Sugeruj pisowniê

# MSG_Function_Top (44//)
source: Top
pl: Pocz±tek pliku

# MSG_Function_Undo (45//)
source: Undo
pl: Cofnij

# MSG_Function_Up (46//)
source: Up
pl: W górê

# MSG_GroupTitle_Control (47//)
source: Control
pl: Kontrola

# MSG_GroupTitle_Cursor (48//)
source: Cursor
pl: Kursor

# MSG_GroupTitle_Design (49//)
source: Design
pl: Wygl±d

# MSG_GroupTitle_Fonts (50//)
source: Fonts
pl: Czcionki

# MSG_HelpTxt_SpellChecker (52//)
source: \33u Intro \33n The TextEditor gadget allows for easy integration of external spell checkers, making it possible to have both type'n'spell and also normal word guessing. \33u Lookup command \33n For the type'n'spell you'll have to set the lookup command to a script that will lookup the word and set the environment variable "Found" to either 0 (for not found) or 1 (for a match). This matches the default behaviour of AlphaSpell. You write %s where you want the word. If you use AlphaSpell, then you can use: \33bARexx:\33n "Options Results;Address ALPHASPELL Search For '%s' Path 'T:' Danish.ald" You \33bmust\33n remember the quotes, this will let ARexx execute it as a command instead of a script. \33u Suggest command \33n If you press <HELP> over a word, then the editor will launch this command, again with %s substituted with the current word. Your script should produce a file in T: named "Matches". This file is then read by the gadget, and the contents are listed in a popup listview, from where you can choose a word which will replace the misspelled one. Again, AlphaSpell users can use: \33bARexx:\33n "Options Results;Address ALPHASPELL Match '%s' To 'T:Matches' Path 'T:' Danish.ald" If you use the methods described above, then you must start AlphaSpell with the "ARexx" switch. It is advised to keep your dictionary in RAM if you enable the type'n'spell feature.
pl: \33u Wprowadzenie \33n Gadżety klasy TextEditor pozwalaj± na łatw± integracjê zewnêtrznego modułu sprawdzania pisowni, pozwalaj±c zarówno na sprawdzanie w trakcie pisania, jak i standardowego podpowiadania słów. \33u Polecenie wyszukiwania \33n Dla opcji "pisz i sprawdzaj" musisz ustawiæ polecenie wyszukiwania wskazuj±c na skrypt, który bêdzie wyszukiwał słowa, oraz ustawiał zmienn± ¶rodowiskow± "Found" na 0 (je¶li nie znajdzie słowa) lub 1 (je¶li znajdzie słowo). Odpowiada to domy¶lnemu zachowaniu programu AplhaSpell. Jako wyszukiwane słowo należy podaæ parametr %s. Je¶li używasz programu AlphaSpell możesz użyæ polecenia: \33bARexx:\33n "Options Results;Address ALPHASPELL Search For '%s' Path 'T:' Polish.ald" \33bMusisz\33n pamiêtaæ o cudzysłowach, to pozwoli ARexx'owi wykonaæ polecenie jako plik wykonywalny, a nie jako skrypt. \33u Polecenie sugerowania \33n Je¶li naci¶niejsz klawisz <HELP> nad wybranym słowem, edytor wykona to polecenie tak samo jak wyżej podstawiaj±c wskazane słowo pod parametr %s. Skrypt powinien generowaæ plik w katalogu "T:" o nazwie "Matches". Plik ten jest nastêpnie odczytywany przez gadżet, a jego zawarto¶æ jest wy¶wietlana na podrêcznej li¶cie, z której możesz wybraæ słowo maj±ce zast±piæ błêdnie wpisane. Ponownie użytkownicy programu AlphaSpell mog± użyæ: \33bARexx:\33n "Options Results;Address ALPHASPELL Match '%s' To 'T:Matches' Path 'T:' Danish.ald" Je¶li używasz metod opisanych powyżej, musisz uruchamiaæ program AlphaSpell z parametrem "ARexx". W przypadku wł±czenia opcji "pisz i sprawdzaj" zaleca siê przechowywanie danych słownikowych w pamiêci RAM.

# MSG_LVLabel_Action (53//)
source: \33c\0333Action:
pl: \33c\0333Działanie:

# MSG_LVLabel_Key (54//)
source: \33c\0333Key:
pl: \33c\0333Klawisz:

# MSG_Label_Background (55//)
source: Background
pl: Tło

# MSG_Label_BlinkSpeed (56//)
source: Blinkspeed
pl: Szybko¶æ migotania

# MSG_Label_BlkQual (57//)
source: Block qualifier
pl: Klawisz wywołuj±cy zaznaczanie bloku

# MSG_Label_Cursor (58//)
source: Normal
pl: Normalny

# MSG_Label_Fixed (59//)
source: Fixed
pl: Nieproporcjonalna

# MSG_Label_Frame (60//)
source: Frame
pl: Ramka

# MSG_Label_Highlight (61//)
source: Highlight
pl: Pod¶wietlenie

# MSG_Label_LookupCmd (62//)
source: Lookup command
pl: Polecenie wyszukiwania

# MSG_Label_LookupWords (63//)
source: Lookup word before suggesting?
pl: Przed sugerowaniem wyszukaj słowa

# MSG_Label_Normal (64//)
source: Normal
pl: Normalny

# MSG_Label_Selected (65//)
source: Selected
pl: Zaznaczony

# MSG_Label_SeparatorShadow (66//)
source: Shadow
pl: Ciemna krawêdŒ

# MSG_Label_SeparatorShine (67//)
source: Shine
pl: Jasna krawêdŒ

# MSG_Label_Smooth (68//)
source: Smooth
pl: Płynne

# MSG_Label_SpellNType (69//)
source: Spell check as you type?
pl: Sprawdzaj pisowniê w trakcie pisania

# MSG_Label_SuggestCmd (70//)
source: Suggest command
pl: Polecenie sugerowania

# MSG_Label_TabSize (71//)
source: Tab size
pl: Wielko¶æ tabulacji

# MSG_Label_Text (72//)
source: Text
pl: Tekst

# MSG_Label_UndoLevel (73//)
source: Undo levels
pl: Liczba poziomów cofania

# MSG_Label_Width (74//)
source: Width
pl: Szeroko¶æ

# MSG_MenuItem_Background (75//)
source: Background
pl: Tło

# MSG_MenuItem_Bold (76//)
source: Bold
pl: Pogrubiony

# MSG_MenuItem_Center (77//)
source: Center
pl: do ¶rodka

# MSG_MenuItem_Copy (78//)
source: Copy
pl: Skopiuj

# MSG_MenuItem_Cut (79//)
source: Cut
pl: Wytnij

# MSG_MenuItem_Delete (80//)
source: Delete
pl: Skasuj

# MSG_MenuItem_Fill (81//)
source: Fill
pl: kolor wypełnienia

# MSG_MenuItem_Halfshadow (82//)
source: Halfshadow
pl: półcień

# MSG_MenuItem_Halfshine (83//)
source: Halfshine
pl: półblask

# MSG_MenuItem_Italic (84//)
source: Italic
pl: Pochylony

# MSG_MenuItem_Left (85//)
source: Left
pl: do lewej

# MSG_MenuItem_Mark (86//)
source: Mark
pl: kolor zaznaczania

# MSG_MenuItem_Normal (87//)
source: Normal
pl: normalny

# MSG_MenuItem_Paste (88//)
source: Paste
pl: Wklej

# MSG_MenuItem_Redo (89//)
source: Redo
pl: Przywróæ

# MSG_MenuItem_Right (90//)
source: Right
pl: do prawej

# MSG_MenuItem_Shadow (91//)
source: Shadow
pl: kolor ciemnych krawêdzi

# MSG_MenuItem_Shine (92//)
source: Shine
pl: kolor jasnych krawêdzi

# MSG_MenuItem_Text (93//)
source: Text
pl: kolor tekstu

# MSG_MenuItem_Underline (94//)
source: Underline
pl: Podkre¶lony

# MSG_MenuItem_Undo (95//)
source: Undo
pl: Cofnij

# MSG_MenuSubTitle_Alignment (96//)
source: Alignment
pl: Wyrównywanie

# MSG_MenuSubTitle_Color (97//)
source: Color
pl: Kolor

# MSG_MenuTitle_Edit (98//)
source: Edit
pl: Edycja

# MSG_Page_Keybindings (99//)
source: Keybindings
pl: Przypisanie klawiszy

# MSG_Page_Sample (100//)
source: Sample
pl: Przykład

# MSG_Page_Settings (101//)
source: Settings
pl: Ustawienia

# MSG_Page_SpellChecker (102//)
source: Spell checker
pl: Sprawdzanie pisowni

# MSG_PopWinTitle_Background (103//)
source: Select background
pl: Wybierz tło

# MSG_PopWinTitle_Cursor (104//)
source: Select cursor color
pl: Wybierz kolor kursora

# MSG_PopWinTitle_Frame (105//)
source: Adjust frame
pl: Wybierz ramkê

# MSG_PopWinTitle_Highlight (106//)
source: Select highlight color
pl: Wybierz kolor pod¶wietlenia

# MSG_PopWinTitle_Selected (107//)
source: Select block color
pl: Wybierz kolor bloku

# MSG_PopWinTitle_SeparatorShadow (108//)
source: Select separators shadow color
pl: Wybierz kolor ciemnej krawêdzi separatora

# MSG_PopWinTitle_SeparatorShine (109//)
source: Select separators shine color
pl: Wybierz kolor jasnej krawêdzi separatora

# MSG_PopWinTitle_Text (110//)
source: Select text color
pl: Wybierz kolor tekstu

# MSG_SliderText_MaxWidth (111//)
source: Same as char
pl: Taki sam jak znaków

# MSG_SliderText_MinSpeed (112//)
source: Off
pl: wył.

# MSG_SliderText_MinWidth (113//)
source: 1 pixel
pl: pikseli: 1

# MSG_SliderText_StdWidth (115//)
source: %ld pixels
pl: pikseli: %ld

# MSG_SliderText_TabSize (116//)
source: %ld spaces
pl: spacji: %ld

# MSG_Function_GotoBookmark1 (117//)
source: Goto bookmark 1
pl: IdŒ do znacznika 1

# MSG_Function_GotoBookmark2 (118//)
source: Goto bookmark 2
pl: IdŒ do znacznika 2

# MSG_Function_GotoBookmark3 (119//)
source: Goto bookmark 3
pl: IdŒ do znacznika 3

# MSG_Function_SetBookmark1 (120//)
source: Set bookmark 1
pl: Ustaw znacznik 1

# MSG_Function_SetBookmark2 (121//)
source: Set bookmark 2
pl: Ustaw znacznik 2

# MSG_Function_SetBookmark3 (122//)
source: Set bookmark 3
pl: Ustaw znacznik 3

# MSG_Button_Snoop (123//)
source: Snoop
pl: Przechwyæ

# MSG_Function_DelLine (124//)
source: Delete line
pl: Skasuj liniê

# MSG_Function_SelectAll (125//)
source: Select all
pl: Zaznacz wszystko

# MSG_Function_SelectNone (126//)
source: Select none
pl: Odznacz wszystko

# MSG_WarnConfigVersion_Title (127//)
source: TextEditor.mcp warning
pl: TextEditor.mcp - ostrzeżenie

# MSG_WarnConfigVersion (128//)
source: Your currently saved keybindings setup is incompatible with the version of TextEditor.mcc you have installed. It is suggested that you reset the current keybindings to their defaults and edit them manually afterwards.
pl: Aktualnie zapisane przypisanie klawiszy jest niekompatybilne z zainstalowan± wersj± klasy TextEditor.mcc. Zalecane jest przywrócenie aktualnego przypisania klawiszy do ich domy¶lnych ustawień, a nastêpnie rêczna edycja tych ustawień.

# MSG_ResetAbort (129//)
source: Reset|Abort
pl: Przywróæ domy¶lne|Przerwij

# MSG_WarnHotkeyString_Title (130//)
source: TextEditor.mcp warning
pl: TextEditor.mcp - ostrzeżenie

# MSG_WarnHotkeyString (131//)
source: TextEditor.mcp couldn't open the minimum required version of the HotkeyString.mcc custom class and therefore failed during initialization. Please make sure you have the latest Hotkeystring.mcc class from http://www.sf.net/projects/bstring-mcc/ installed and try again.
pl: Klasa TextEditor.mcp nie może otworzyæ minimalnej wymaganej wersji klasy HotkeyString.mcc i dlatego jej inicjalizacja zakończyła siê niepowodzeniem. Proszê upewniæ siê, że posiadasz zainstalowan± najnowsz± wersjê klasy ze strony http://www.sf.net/projects/bstring-mcc/ i spróbowaæ ponownie.

# MSG_Label_InactiveCursor (133//)
source: Inactive cursor
pl: Nieaktywny kursor

# MSG_HELP_InactiveCursor (134//)
source: If enabled, a custom cursor will be used whenever the editor doesn't have the focus.
pl: Je¶li ta opcja jest wł±czona, własny kursor bêdzie używany nawet je¶li edytor nie bêdzie aktywny.

# MSG_Label_SelectPointer (135//)
source: Selection pointer
pl: WskaŒnik zaznaczania

# MSG_HELP_SelectPointer (136//)
source: If enabled, a custom selection pointer will appear when the mouse pointer is above the texteditor gadget.
pl: Je¶li ta opcja jest wł±czona, własny kursor zaznaczania bêdzie wy¶wietlany gdy wskaŒnik myszki znajdzie siê nad gadżetem klasy TextEditor.

# MSG_Label_InactiveColor (137//)
source: Inactive
pl: Nieaktywny

# MSG_PopWinTitle_InactiveColor (138//)
source: Select inactive color
pl: Wybierz kolor nieaktywnego

# MSG_HELP_TABSIZE (139//)
source: How many spaces hitting the <TAB> key will jump.
pl: Ile spacji ma przeskoczyæ kursor po naci¶niêciu klawisza <TAB>.

# MSG_HELP_DESIGN_FRAME (140//)
source: This is a button to adjust a frame. Click it to open an adjust window or use the drag&drop facilities to copy from or to another frame adjust button.
pl: To jest przycisk do ustawiania ramki. Kliknij, by otworzyæ okno ustawień, lub użyj przeci±gania i upuszczania by skopiowaæ ustawienia wygl±du z innego przycisku ustawień ramki.

# MSG_HELP_DESIGN_BACKGROUND (141//)
source: This is a button to adjust a background color or pattern. Click it to open an adjust window or use the drag&drop facilities to copy from or to another background adjust button.
pl: To jest przycisk ustawiania koloru lub wzoru tła. Kliknij, by otworzyæ okno ustawień, lub użyj przeci±gania i upuszczania by skopiowaæ ustawienia wygl±du z innego przycisku ustawień tła.

# MSG_HELP_DESIGN_TEXT (142//)
source: This is the color used to print the text.
pl: To jest kolor używany do wy¶wietlania tekstu.

# MSG_HELP_DESIGN_HIGHLIGHT (143//)
source: This is the color used to print highlighted text.
pl: To jest kolor uzywany do wy¶wietlania pod¶wietlonego tekstu.

# MSG_HELP_SEPARATOR_SHINE (144//)
source: This is the color used to print separator bars.
pl: To jest kolor uzywany do wy¶wietlania belek separuj±cych.

# MSG_HELP_SEPARATOR_SHADOW (145//)
source: This is the color used to print separator bars in shadow mode.
pl: To jest kolor uzywany do wy¶wietlania przyciemnionych belek separuj±cych.

# MSG_HELP_FONTS_NORMAL (146//)
source: Default font to be used by the editor.
pl: Domy¶lna czcionka używana przez edytor.

# MSG_HELP_FONTS_FIXED (147//)
source: Default font to be used by the editor whenever a fixed width font is requested.
pl: Domy¶lna czcionka używana przez edytor gdy wymagana jest czcionka nieproporcjonalna.

# MSG_HELP_CURSOR_NORMAL (148//)
source: Default color to be used for the cursor.
pl: Domy¶lny kolor kursora.

# MSG_HELP_CURSOR_SELECTED (149//)
source: Color to be used for the cursor in selected text.
pl: Kolor używany do wy¶wietlania kursora w zaznaczonym tek¶cie.

# MSG_HELP_CURSOR_INACTIVE (150//)
source: Color to use to print selected text when the editor doesn't have the focus.
pl: Kolor używany do wy¶wietlania zaznaczonego tekstu, gdy edytor jest nieaktywny.

# MSG_HELP_CURSOR_WIDTH (151//)
source: This is the width the cursor should have.
pl: To jest szeroko¶æ kursora.

# MSG_HELP_CURSOR_BLINKSPEED (152//)
source: You may want the cursor to blink to make it easier to find. Select 'Off' to disable this feature.
pl: Możesz wł±czyæ miganie kursora, by móc go łatwiej odszukaæ na ekranie. Wybierz "wył." by wył±czyæ tê funkcjê.

# MSG_HELP_BUTTON_DEFAULTKEYS (153//)
source: Restore all keybindings to the built-in defaults.
pl: Przywraca przypisania klawiszy do ich domy¶lnych warto¶ci.

# MSG_HELP_BUTTON_SNOOP (154//)
source: Use this field to set a keybinding for this action. You can either edit the string gadget directly or press the 'Snoop' button to make the gadget monitor keypresses until you press it again to confirm.
pl: Użyj tego pola do ustawienia przypisania klawiszy dla tego działania. Możesz bezpo¶rednio edytowaæ gadżet ci±gu lub użyæ opcji "przechwyæ" w celu wł±czenia przechwytywania wciskanych klawiszy do czasu ponownego wci¶niêcia przycisku.

# MSG_HELP_BUTTON_INSERT (155//)
source: Add a new keybinding to the list.
pl: Dodaje nowe przypisanie klawiszy do listy.

# MSG_HELP_BUTTON_DELETE (156//)
source: Delete this keybinding from the list.
pl: Usuwa zaznaczone przypisanie klawiszy z listy.

# MSG_HELP_SPELLCHECKER_LOOKUP_CMD (157//)
source: Specify here the lookup command you want to use, or leave this empty to disable the type'n'spell feature.
pl: Podaj tutaj polecenie wyszukiwania którego chcesz używaæ, lub pozostaw to pole puste, by wył±czyæ funkcjê "pisz i sprawdzaj".

# MSG_HELP_SPELLCHECKER_SUGGEST_CMD (158//)
source: Specify here the command that will be used to suggest an alternate word. As explained above, usually you should specify a script here.
pl: Podaj tutaj polecenie używane do sugerowania alternatywnych słów. Jak to wyja¶niono powyżej, powiniene¶ okre¶liæ tutaj ¶cieżkê wywołuj±c± skrypt.
