Repository: aros-development-team/AROS
Catalog: workbench/classes/zune/texteditor/mcp/locale/swedish.po
Languages: sv

# MSG_HelpBubble_BlockQual (0//)
source: Move the cursor key and hold down the qualifier that you set here to mark text.
sv: Håll nere tangenten som du har valt här och flytta markören för att markera text.

# MSG_HelpBubble_CheckWord (1//)
source: If enabled, then the editor will lookup the word, and only show suggestions if the word is misspelled.
sv: Om denna funktion är påslagen, kommer editorn att kontrollera ordet och visa förslag men endast om ordet är felstavat.

# MSG_HelpBubble_Smooth (2//)
source: This enables pixel smooth scrolling.
sv: Detta aktiverar bildpunktsjämn rullning.

# MSG_HelpBubble_TypeNSpell (3//)
source: Enable this to let the editor lookup the words while you type them.
sv: Aktivera detta, för att låta editorn kontrollera orden medan du skriver dem.

# MSG_HelpBubble_UndoLevel (4//)
source: Each undo level eats up 10 bytes of memory. Cut and copy will take a little more, depending on the size of the block you are cutting or copying.
sv: Varje ångernivå kräver 10 byte minne. Klipp ut och Kopiera kräver lite mera, beroende på storleken på den markerade texten som du klipper ut eller kopierar.

# MSG_Button_DefaultKeys (5//)
source: Default _keys
sv: _Standardknappar

# MSG_Button_Delete (6//)
source: _Delete
sv: _Ta bort

# MSG_Button_Insert (7//)
source: _Insert
sv: _Lägg till

# MSG_ConfigMenu_CheckWord (8//)
source: Check word
sv: Kontrollera ord

# MSG_ConfigMenu_TypeNSpell (9//)
source: Type'n'spell
sv: Skriv och kontrollera

# MSG_CycleItem_Ctrl (11//)
source: Control
sv: Kontroll

# MSG_CycleItem_Mouse (12//)
source: (mouse only)
sv: (endast mus)

# MSG_Function_BOL (16//)
source: Beginning of line
sv: Början av rad

# MSG_Function_Backspace (17//)
source: Backspace
sv: Baksteg

# MSG_Function_Bottom (18//)
source: Bottom
sv: Nederst

# MSG_Function_Copy (19//)
source: Copy
sv: Kopiera

# MSG_Function_Cut (20//)
source: Cut
sv: Klipp ut

# MSG_Function_DelBOL (21//)
source: Delete to BOL
sv: Radera till början av raden

# MSG_Function_DelBOW (22//)
source: Delete to BOW
sv: Radera till början av ordet

# MSG_Function_DelEOL (23//)
source: Delete to EOL
sv: Radera till slutet av raden

# MSG_Function_DelEOW (24//)
source: Delete to EOW
sv: Radera till slutet av ordet

# MSG_Function_Delete (25//)
source: Delete
sv: Radera

# MSG_Function_Down (26//)
source: Down
sv: Ner

# MSG_Function_EOL (27//)
source: End of line
sv: Slutet av raden

# MSG_Function_Left (28//)
source: Left
sv: Vänster

# MSG_Function_NextGadget (29//)
source: Next gadget
sv: Nästa knapp

# MSG_Function_NxtPage (30//)
source: Next page
sv: Nästa sida

# MSG_Function_NxtPara (31//)
source: Next paragraph
sv: Nästa paragraf

# MSG_Function_NxtSent (32//)
source: Next sentence
sv: Nästa mening

# MSG_Function_NxtWord (33//)
source: Next word
sv: Nästa ord

# MSG_Function_Paste (34//)
source: Paste
sv: Klistra in

# MSG_Function_PrvPage (35//)
source: Prev page
sv: Föregående sida

# MSG_Function_PrvPara (36//)
source: Prev paragraph
sv: Föregående paragraf

# MSG_Function_PrvSent (37//)
source: Prev sentence
sv: Föregående mening

# MSG_Function_PrvWord (38//)
source: Prev word
sv: Föregående ord

# MSG_Function_Redo (39//)
source: Redo
sv: Gör om

# MSG_Function_Return (40//)
source: Return
sv: Retur

# MSG_Function_Right (41//)
source: Right
sv: Höger

# MSG_Function_SuggestSpelling (42//)
source: Suggest spelling
sv: Föreslå stavning

# MSG_Function_Top (44//)
source: Top
sv: Överst

# MSG_Function_Undo (45//)
source: Undo
sv: Ångra

# MSG_Function_Up (46//)
source: Up
sv: Upp

# MSG_GroupTitle_Control (47//)
source: Control
sv: Kontroll

# MSG_GroupTitle_Cursor (48//)
source: Cursor
sv: Markör

# MSG_GroupTitle_Fonts (50//)
source: Fonts
sv: Typsnitt

# MSG_GroupTitle_Separator (51//)
source: Separator
sv: Skiljelinje

# MSG_HelpTxt_SpellChecker (52//)
source: \33u Intro \33n The TextEditor gadget allows for easy integration of external spell checkers, making it possible to have both type'n'spell and also normal word guessing. \33u Lookup command \33n For the type'n'spell you'll have to set the lookup command to a script that will lookup the word and set the environment variable "Found" to either 0 (for not found) or 1 (for a match). This matches the default behaviour of AlphaSpell. You write %s where you want the word. If you use AlphaSpell, then you can use: \33bARexx:\33n "Options Results;Address ALPHASPELL Search For '%s' Path 'T:' Danish.ald" You \33bmust\33n remember the quotes, this will let ARexx execute it as a command instead of a script. \33u Suggest command \33n If you press <HELP> over a word, then the editor will launch this command, again with %s substituted with the current word. Your script should produce a file in T: named "Matches". This file is then read by the gadget, and the contents are listed in a popup listview, from where you can choose a word which will replace the misspelled one. Again, AlphaSpell users can use: \33bARexx:\33n "Options Results;Address ALPHASPELL Match '%s' To 'T:Matches' Path 'T:' Danish.ald" If you use the methods described above, then you must start AlphaSpell with the "ARexx" switch. It is advised to keep your dictionary in RAM if you enable the type'n'spell feature.
sv: \33u Inledning \33n TextEditor-funktionen erbjuder en enkel integration med externa stavningskontroller, vilket tillåter dig att använda både kontrollera-medan-du-skriver funktionen samt normal ordgissning. \33u Kontrollera kommandot \33n För att använda kontrollera-medan-du-skriver funktionen, måste du ställa in kontrollera-kommandot att peka på ett skript som kontrollerar ordet och ställer in den globala variabeln "Found" till endera 0 (för inte funnen) eller 1 (för funnen). Detta matchar förfarandet i AlphaSpell. Du skriver %s där du vill ha ordet. Om du använder AlphaSpell kan du skriva: \33bARexx:\33n "Options Results;Address ALPHASPELL Search For '%s' Path 'T:' Danish.ald" Du \33bmåste\33n komma ihåg citationstecknen. De säger till ARexx att exekvera raden som ett kommando istället för som ett skript. \33u Föreslå-kommandot \33n Om du trycker på HELP-tangenten när du står på ett ord, kommer editorn att exekvera detta kommando, återigen med %s ersatt med det aktuella ordet. Ditt skript kommer att skapa en fil i T: med namnet "Matches". Denna fil läses sedan och innehållet visas i en popup-listvy, varifrån du kan välja det ord som ska ersätta det felstavade ordet. AlphaSpell-användare kan skriva: \33bARexx:\33n "Options Results;Address ALPHASPELL Match '%s' To 'T:Matches' Path 'T:' Danish.ald" Om du använder dig av metoderna beskrivna ovan, måste du starta AlphaSpell med "ARexx"-parametern. Det är rekommenderat att du placerar ordlistan i RAM: om du har kontrollera-medan-du-skriver funktionen påslagen.

# MSG_LVLabel_Action (53//)
source: \33c\0333Action:
sv: \33c\0333Kommando:

# MSG_LVLabel_Key (54//)
source: \33c\0333Key:
sv: \33c\0333Tangent:

# MSG_Label_Background (55//)
source: Background
sv: Bakgrund

# MSG_Label_BlinkSpeed (56//)
source: Blinkspeed
sv: Blinkhastighet

# MSG_Label_BlkQual (57//)
source: Block qualifier
sv: Markeringskombination

# MSG_Label_Fixed (59//)
source: Fixed
sv: Bestämt

# MSG_Label_Frame (60//)
source: Frame
sv: Ram

# MSG_Label_Highlight (61//)
source: Highlight
sv: Markera

# MSG_Label_LookupCmd (62//)
source: Lookup command
sv: Kontrollera-kommando

# MSG_Label_LookupWords (63//)
source: Lookup word before suggesting?
sv: Kontrollera ordet innan förslag på andra ord ges?

# MSG_Label_Normal (64//)
source: Normal
sv: Normalt

# MSG_Label_Selected (65//)
source: Selected
sv: Markerad

# MSG_Label_SeparatorShadow (66//)
source: Shadow
sv: Skugga

# MSG_Label_SeparatorShine (67//)
source: Shine
sv: Sken

# MSG_Label_Smooth (68//)
source: Smooth
sv: Utjämna

# MSG_Label_SpellNType (69//)
source: Spell check as you type?
sv: Kontrollera stavning medan du skriver?

# MSG_Label_SuggestCmd (70//)
source: Suggest command
sv: Föreslå-kommando

# MSG_Label_TabSize (71//)
source: Tab size
sv: Tab-storlek

# MSG_Label_UndoLevel (73//)
source: Undo levels
sv: Ångernivåer

# MSG_Label_Width (74//)
source: Width
sv: Bredd

# MSG_MenuItem_Background (75//)
source: Background
sv: Bakgrund

# MSG_MenuItem_Bold (76//)
source: Bold
sv: Fet

# MSG_MenuItem_Center (77//)
source: Center
sv: Mitten

# MSG_MenuItem_Copy (78//)
source: Copy
sv: Kopiera

# MSG_MenuItem_Cut (79//)
source: Cut
sv: Klipp ut

# MSG_MenuItem_Delete (80//)
source: Delete
sv: Radera

# MSG_MenuItem_Fill (81//)
source: Fill
sv: Fyll

# MSG_MenuItem_Halfshadow (82//)
source: Halfshadow
sv: Halvskugga

# MSG_MenuItem_Halfshine (83//)
source: Halfshine
sv: Halvsken

# MSG_MenuItem_Italic (84//)
source: Italic
sv: Kursiv

# MSG_MenuItem_Left (85//)
source: Left
sv: Vänster

# MSG_MenuItem_Mark (86//)
source: Mark
sv: Markera

# MSG_MenuItem_Paste (88//)
source: Paste
sv: Klistra in

# MSG_MenuItem_Redo (89//)
source: Redo
sv: Gör om

# MSG_MenuItem_Right (90//)
source: Right
sv: Höger

# MSG_MenuItem_Shadow (91//)
source: Shadow
sv: Skugga

# MSG_MenuItem_Shine (92//)
source: Shine
sv: Sken

# MSG_MenuItem_Underline (94//)
source: Underline
sv: Understruken

# MSG_MenuItem_Undo (95//)
source: Undo
sv: Ångra

# MSG_MenuSubTitle_Alignment (96//)
source: Alignment
sv: Justering

# MSG_MenuSubTitle_Color (97//)
source: Color
sv: Färg

# MSG_MenuTitle_Edit (98//)
source: Edit
sv: Redigera

# MSG_Page_Keybindings (99//)
source: Keybindings
sv: Tangentkombinationer

# MSG_Page_Sample (100//)
source: Sample
sv: Exempel

# MSG_Page_Settings (101//)
source: Settings
sv: Inställningar

# MSG_Page_SpellChecker (102//)
source: Spell checker
sv: Stavningskontroll

# MSG_PopWinTitle_Background (103//)
source: Select background
sv: Välj bakgrund

# MSG_PopWinTitle_Cursor (104//)
source: Select cursor color
sv: Välj markörfärg

# MSG_PopWinTitle_Frame (105//)
source: Adjust frame
sv: Justera ram

# MSG_PopWinTitle_Highlight (106//)
source: Select highlight color
sv: Välj markeringsfärg

# MSG_PopWinTitle_Selected (107//)
source: Select block color
sv: Välj markeringsfärg

# MSG_PopWinTitle_SeparatorShadow (108//)
source: Select separators shadow color
sv: Välj skiljelinjens skuggfärg

# MSG_PopWinTitle_SeparatorShine (109//)
source: Select separators shine color
sv: Välj skiljelinjens skenfärg

# MSG_PopWinTitle_Text (110//)
source: Select text color
sv: Välj textfärg

# MSG_SliderText_MaxWidth (111//)
source: Same as char
sv: Samma som bokstav

# MSG_SliderText_MinSpeed (112//)
source: Off
sv: Av

# MSG_SliderText_MinWidth (113//)
source: 1 pixel
sv: 1 bildpunkt

# MSG_SliderText_StdWidth (115//)
source: %ld pixels
sv: %ld bildpunkter

# MSG_SliderText_TabSize (116//)
source: %ld spaces
sv: %ld mellanslag

# MSG_Function_GotoBookmark1 (117//)
source: Goto bookmark 1
sv: Gå till bokmärke 1

# MSG_Function_GotoBookmark2 (118//)
source: Goto bookmark 2
sv: Gå till bokmärke 2

# MSG_Function_GotoBookmark3 (119//)
source: Goto bookmark 3
sv: Gå till bokmärke 3

# MSG_Function_SetBookmark1 (120//)
source: Set bookmark 1
sv: Välj bokmärke 1

# MSG_Function_SetBookmark2 (121//)
source: Set bookmark 2
sv: Välj bokmärke 2

# MSG_Function_SetBookmark3 (122//)
source: Set bookmark 3
sv: Välj bokmärke 3

# MSG_Button_Snoop (123//)
source: Snoop
sv: Avläs

# MSG_Function_DelLine (124//)
source: Delete line
sv: Radera rad

# MSG_Function_SelectAll (125//)
source: Select all
sv: Välj alla

# MSG_Function_SelectNone (126//)
source: Select none
sv: Välj inga

# MSG_WarnConfigVersion_Title (127//)
source: TextEditor.mcp warning
sv: TextEditor.mcp varning

# MSG_WarnConfigVersion (128//)
source: Your currently saved keybindings setup is incompatible with the version of TextEditor.mcc you have installed. It is suggested that you reset the current keybindings to their defaults and edit them manually afterwards.
sv: Din nuvarande sparade tangent-uppsättning är inkompatibel med den version av TextEditor.mcc du har installerad. Det är rekommenderat att du återställer tangent-uppsättningen till dess förval och redigerar dem manuellt efteråt.

# MSG_ResetAbort (129//)
source: Reset|Abort
sv: Återställ|Avbryt

# MSG_WarnHotkeyString_Title (130//)
source: TextEditor.mcp warning
sv: TextEditor.mcp varning

# MSG_WarnHotkeyString (131//)
source: TextEditor.mcp couldn't open the minimum required version of the HotkeyString.mcc custom class and therefore failed during initialization. Please make sure you have the latest Hotkeystring.mcc class from http://www.sf.net/projects/bstring-mcc/ installed and try again.
sv: TextEditor.mcp kunde inte öppna den minst krävda versionen av HotkeyString.mcc klassen och misslyckades därför under uppstart. Var god kontrollera att du har den senaste HotkeyString.mcc klassen från http://www.sf.net/projects/bstring-mcc/ installerad och pröva igen.

# MSG_Label_InactiveCursor (133//)
source: Inactive cursor
sv: Inaktiv markör

# MSG_HELP_InactiveCursor (134//)
source: If enabled, a custom cursor will be used whenever the editor doesn't have the focus.
sv: Om vald, så visas en speciell markör när texteditorn är i inaktivt tillstånd.

# MSG_Label_SelectPointer (135//)
source: Selection pointer
sv: Väljpekare

# MSG_HELP_SelectPointer (136//)
source: If enabled, a custom selection pointer will appear when the mouse pointer is above the texteditor gadget.
sv: Om vald, kommer en speciell pekare att visas när muspekaren är ovanför texteditorn.

# MSG_Label_InactiveColor (137//)
source: Inactive
sv: Inaktiv

# MSG_PopWinTitle_InactiveColor (138//)
source: Select inactive color
sv: Välj inaktiv färg

# MSG_HELP_TABSIZE (139//)
source: How many spaces hitting the <TAB> key will jump.
sv: Hur många teckenrutor markören hoppar vid användning av TAB-tangenten.

# MSG_HELP_DESIGN_FRAME (140//)
source: This is a button to adjust a frame. Click it to open an adjust window or use the drag&drop facilities to copy from or to another frame adjust button.
sv: Detta är en knapp för att justera en ram. Klicka på den för att öppna ett justeringsfönster eller använd dra&släpp för att kopiera från eller till en annan ramjusteringsknapp.

# MSG_HELP_DESIGN_BACKGROUND (141//)
source: This is a button to adjust a background color or pattern. Click it to open an adjust window or use the drag&drop facilities to copy from or to another background adjust button.
sv: Detta är en knapp för att justera en bakgrundsfärg eller mönster. Klicka på den för att öppna ett justeringsfönster eller använd dra&släpp från eller till en annan bakgrundsjusteringsknapp.

# MSG_HELP_DESIGN_TEXT (142//)
source: This is the color used to print the text.
sv: Detta är färgen som används för texten.

# MSG_HELP_DESIGN_HIGHLIGHT (143//)
source: This is the color used to print highlighted text.
sv: Detta är färgen som används för markerad text.

# MSG_HELP_SEPARATOR_SHINE (144//)
source: This is the color used to print separator bars.
sv: Detta är färgen som används för avdelningsrader.

# MSG_HELP_SEPARATOR_SHADOW (145//)
source: This is the color used to print separator bars in shadow mode.
sv: Detta är färgen som används för avdelningsrader i skugg läge.

# MSG_HELP_FONTS_NORMAL (146//)
source: Default font to be used by the editor.
sv: Förvalt typsnitt som används av redigeraren.

# MSG_HELP_FONTS_FIXED (147//)
source: Default font to be used by the editor whenever a fixed width font is requested.
sv: Förvalt typsnitt som används av redigeraren när typsnitt av fast bredd efterfrågas.

# MSG_HELP_CURSOR_NORMAL (148//)
source: Default color to be used for the cursor.
sv: Förvald färg att använda för markören.

# MSG_HELP_CURSOR_SELECTED (149//)
source: Color to be used for the cursor in selected text.
sv: Färg att använda för markerad text.

# MSG_HELP_CURSOR_INACTIVE (150//)
source: Color to use to print selected text when the editor doesn't have the focus.
sv: Färg att använda för markerad text när redigeraren inte har fokus.

# MSG_HELP_CURSOR_WIDTH (151//)
source: This is the width the cursor should have.
sv: Detta är bredden som markören skall ha.

# MSG_HELP_CURSOR_BLINKSPEED (152//)
source: You may want the cursor to blink to make it easier to find. Select 'Off' to disable this feature.
sv: Du kanske vill att markören skall blinka för att lättare hitta den. Välj 'av' för att stänga av denna funktion.

# MSG_HELP_BUTTON_DEFAULTKEYS (153//)
source: Restore all keybindings to the built-in defaults.
sv: Återställ alla tangentbindningar till de inbyggda förvalda.

# MSG_HELP_BUTTON_SNOOP (154//)
source: Use this field to set a keybinding for this action. You can either edit the string gadget directly or press the 'Snoop' button to make the gadget monitor keypresses until you press it again to confirm.
sv: Använd detta fält för att ställa in en tangentbindning för denna handling. Du kan antingen redigera direkt eller använda 'Avläs' knappen så att tangenttryckningar avläses tills du använder knappen igen för att bekräfta.

# MSG_HELP_BUTTON_INSERT (155//)
source: Add a new keybinding to the list.
sv: Lägg till en ny tangentbindning till listan.

# MSG_HELP_BUTTON_DELETE (156//)
source: Delete this keybinding from the list.
sv: Radera denna tangentbindning från listan.

# MSG_HELP_SPELLCHECKER_LOOKUP_CMD (157//)
source: Specify here the lookup command you want to use, or leave this empty to disable the type'n'spell feature.
sv: Specifiera här 'slå-upp' kommandot du vill använda eller lämna detta tomt för att stänga av kontrollera-medan-du-skriver funktionen.

# MSG_HELP_SPELLCHECKER_SUGGEST_CMD (158//)
source: Specify here the command that will be used to suggest an alternate word. As explained above, usually you should specify a script here.
sv: Specifiera här kommandot som kommer att användas för att föreslå ett alternativt ord. Som förklarat ovan, vanligtvis så bör du specifiera ett skript här.
